#pragma once 
#include <ABP_SkeletonRoyalGuard_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_SkeletonRoyalGuard.ABP_SkeletonRoyalGuard_C
// Size: 0xFE0(Inherited: 0x510)
struct UABP_SkeletonRoyalGuard_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	char pad_1316[4];  // 0x524 (0x524)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x528 (0x528)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x530 (0x530)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x538 (0x538)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x558 (0x558)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;  // 0x5A0 (0x5A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;  // 0x5C8 (0x5C8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x5F0 (0x5F0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x618 (0x618)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0x640 (0x640)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0x688 (0x688)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x6A8 (0x6A8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x6F0 (0x6F0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x710 (0x710)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x780 (0x780)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x7A0 (0x7A0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x868 (0x868)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x970 (0x970)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x998 (0x998)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x9C0 (0x9C0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x9E8 (0x9E8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0xA10 (0xA10)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0xA38 (0xA38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0xA60 (0xA60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0xA88 (0xA88)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0xAB0 (0xAB0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0xAD0 (0xAD0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0xB18 (0xB18)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0xB60 (0xB60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0xB88 (0xB88)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0xBD0 (0xBD0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0xCB0 (0xCB0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0xCD0 (0xCD0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0xD18 (0xD18)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0xD60 (0xD60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0xD88 (0xD88)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0xDD0 (0xDD0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0xEB0 (0xEB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0xED0 (0xED0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0xEF8 (0xEF8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0xF18 (0xF18)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_SkeletonRoyalGuard.ABP_SkeletonRoyalGuard_C.AnimGraph
	void ExecuteUbergraph_ABP_SkeletonRoyalGuard(int32_t EntryPoint); // Function ABP_SkeletonRoyalGuard.ABP_SkeletonRoyalGuard_C.ExecuteUbergraph_ABP_SkeletonRoyalGuard
}; 
 
 


