#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_GiantDragonfly.ABP_GiantDragonfly_C.AnimBlueprintGeneratedMutableData
// Size: 0x9(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool __BoolProperty_1 : 1;  // [x8 ([x8)


}; 
 
 // ScriptStruct ABP_GiantDragonfly.ABP_GiantDragonfly_C.AnimBlueprintGeneratedConstantData
// Size: 0x170(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_160;  // 0x4 (0x4)
	struct FName __NameProperty_161;  // 0xC (0xC)
	int32_t __IntProperty_162;  // 0x14 (0x14)
	struct FName __NameProperty_163;  // 0x18 (0x18)
	int32_t __IntProperty_164;  // 0x20 (0x20)
	struct FName __NameProperty_165;  // 0x24 (0x24)
	struct FName __NameProperty_166;  // 0x2C (0x2C)
	struct FInputScaleBiasClampConstants __StructProperty_167;  // 0x34 (0x34)
	struct FName __NameProperty_168;  // 0x60 (0x60)
	int32_t __IntProperty_169;  // 0x68 (0x68)
	char pad_108_1 : 7;  // 0x6C (0x6C)
	bool __BoolProperty_170 : 1;  // 0x6C (0x6C)
	char pad_109[3];  // 0x6D (0x6D)
	float __FloatProperty_171;  // 0x70 (0x70)
	float __FloatProperty_172;  // 0x74 (0x74)
	uint8_t __EnumProperty_173;  // 0x78 (0x78)
	enum class EAnimGroupRole __ByteProperty_174;  // 0x79 (0x79)
	char pad_122[2];  // 0x7A (0x7A)
	struct FName __NameProperty_175;  // 0x7C (0x7C)
	struct FName __NameProperty_176;  // 0x84 (0x84)
	int32_t __IntProperty_177;  // 0x8C (0x8C)
	struct UBlendProfile* __BlendProfile_178;  // 0x90 (0x90)
	struct UCurveFloat* __CurveFloat_179;  // 0x98 (0x98)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool __BoolProperty_180 : 1;  // 0xA0 (0xA0)
	uint8_t __EnumProperty_181;  // 0xA1 (0xA1)
	uint8_t __EnumProperty_182;  // 0xA2 (0xA2)
	char pad_163[5];  // 0xA3 (0xA3)
	struct TArray<float> __ArrayProperty_183;  // 0xA8 (0xA8)
	struct FAnimNodeFunctionRef __StructProperty_184;  // 0xB8 (0xB8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xD8 (0xD8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x158 (0x158)


}; 
 
 // Function ABP_GiantDragonfly.ABP_GiantDragonfly_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_GiantDragonfly.ABP_GiantDragonfly_C.ExecuteUbergraph_ABP_GiantDragonfly
struct FExecuteUbergraph_ABP_GiantDragonfly
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 