#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_Drum.ABP_Drum_C.AnimBlueprintGeneratedConstantData
// Size: 0x108(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_12;  // 0x4 (0x4)
	float __FloatProperty_13;  // 0xC (0xC)
	struct FInputScaleBiasClampConstants __StructProperty_14;  // 0x10 (0x10)
	float __FloatProperty_15;  // 0x3C (0x3C)
	char pad_64_1 : 7;  // 0x40 (0x40)
	bool __BoolProperty_16 : 1;  // 0x40 (0x40)
	uint8_t __EnumProperty_17;  // 0x41 (0x41)
	enum class EAnimGroupRole __ByteProperty_18;  // 0x42 (0x42)
	char pad_67[1];  // 0x43 (0x43)
	struct FName __NameProperty_19;  // 0x44 (0x44)
	char pad_76[4];  // 0x4C (0x4C)
	struct FAnimNodeFunctionRef __StructProperty_20;  // 0x50 (0x50)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0x70 (0x70)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0xF0 (0xF0)


}; 
 
 // Function ABP_Drum.ABP_Drum_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_Drum.ABP_Drum_C.ExecuteUbergraph_ABP_Drum
struct FExecuteUbergraph_ABP_Drum
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 