#pragma once 
#include <ABP_GiantCentipede_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_GiantCentipede.ABP_GiantCentipede_C
// Size: 0x2AC0(Inherited: 0x510)
struct UABP_GiantCentipede_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x540 (0x540)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x548 (0x548)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;  // 0x550 (0x550)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;  // 0x578 (0x578)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x5A0 (0x5A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x5C8 (0x5C8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x5F0 (0x5F0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x618 (0x618)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x640 (0x640)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;  // 0x668 (0x668)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10;  // 0x690 (0x690)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;  // 0x6B0 (0x6B0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;  // 0x6F8 (0x6F8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;  // 0x740 (0x740)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0x768 (0x768)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0x790 (0x790)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8;  // 0x7B8 (0x7B8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7;  // 0x880 (0x880)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;  // 0x948 (0x948)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0x990 (0x990)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9;  // 0xA70 (0xA70)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;  // 0xA90 (0xA90)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;  // 0xAD8 (0xAD8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0xB20 (0xB20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0xB48 (0xB48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0xB70 (0xB70)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6;  // 0xB98 (0xB98)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5;  // 0xC60 (0xC60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0xD28 (0xD28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0xD70 (0xD70)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8;  // 0xE50 (0xE50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0xE70 (0xE70)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0xE98 (0xE98)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3;  // 0xEB8 (0xEB8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;  // 0xF80 (0xF80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x1088 (0x1088)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;  // 0x1190 (0x1190)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x1200 (0x1200)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x1220 (0x1220)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x12E8 (0x12E8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x1310 (0x1310)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x1338 (0x1338)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x1360 (0x1360)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;  // 0x1388 (0x1388)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x13D0 (0x13D0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0x13F0 (0x13F0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x1438 (0x1438)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x1458 (0x1458)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;  // 0x14A0 (0x14A0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;  // 0x1510 (0x1510)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x15D8 (0x15D8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0x15F8 (0x15F8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x1640 (0x1640)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;  // 0x1660 (0x1660)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x16D0 (0x16D0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x1740 (0x1740)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;  // 0x1788 (0x1788)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x1850 (0x1850)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x1898 (0x1898)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x18E0 (0x18E0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0x1928 (0x1928)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0x19F0 (0x19F0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x1AB8 (0x1AB8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x1AD8 (0x1AD8)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x1BA0 (0x1BA0)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x1BE8 (0x1BE8)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization;  // 0x1C08 (0x1C08)
	char pad_7432[8];  // 0x1D08 (0x1D08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2;  // 0x1D10 (0x1D10)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;  // 0x2230 (0x2230)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;  // 0x2250 (0x2250)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics;  // 0x2270 (0x2270)
	double __CustomProperty_PositionAlpha_Head1_Goal_7FE6BC8542633FA01CECD6BE03A28C3F;  // 0x2790 (0x2790)
	struct FVector __CustomProperty_Position_Head1_Goal_7FE6BC8542633FA01CECD6BE03A28C3F;  // 0x2798 (0x2798)
	double __CustomProperty_RotationAlpha_Head1_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x27B0 (0x27B0)
	struct FRotator __CustomProperty_Rotation_Head1_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x27B8 (0x27B8)
	double __CustomProperty_PositionAlpha_Head1_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x27D0 (0x27D0)
	struct FVector __CustomProperty_Position_Head1_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x27D8 (0x27D8)
	double __CustomProperty_PositionAlpha_left_leg51_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x27F0 (0x27F0)
	struct FVector __CustomProperty_Position_left_leg51_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x27F8 (0x27F8)
	double __CustomProperty_PositionAlpha_right_leg39_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2810 (0x2810)
	struct FVector __CustomProperty_Position_right_leg39_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2818 (0x2818)
	double __CustomProperty_PositionAlpha_left_leg39_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2830 (0x2830)
	struct FVector __CustomProperty_Position_left_leg39_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2838 (0x2838)
	double __CustomProperty_PositionAlpha_right_leg31_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2850 (0x2850)
	struct FVector __CustomProperty_Position_right_leg31_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2858 (0x2858)
	double __CustomProperty_PositionAlpha_left_leg35_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2870 (0x2870)
	struct FVector __CustomProperty_Position_left_leg35_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2878 (0x2878)
	double __CustomProperty_PositionAlpha_right_leg27_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2890 (0x2890)
	struct FVector __CustomProperty_Position_right_leg27_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2898 (0x2898)
	double __CustomProperty_PositionAlpha_left_leg7_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x28B0 (0x28B0)
	struct FVector __CustomProperty_Position_left_leg7_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x28B8 (0x28B8)
	double __CustomProperty_PositionAlpha_right_leg7_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x28D0 (0x28D0)
	struct FVector __CustomProperty_Position_right_leg7_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x28D8 (0x28D8)
	double __CustomProperty_PositionAlpha_left_leg11_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x28F0 (0x28F0)
	struct FVector __CustomProperty_Position_left_leg11_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x28F8 (0x28F8)
	double __CustomProperty_PositionAlpha_right_leg11_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2910 (0x2910)
	struct FVector __CustomProperty_Position_right_leg11_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2918 (0x2918)
	double __CustomProperty_PositionAlpha_left_leg15_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2930 (0x2930)
	struct FVector __CustomProperty_Position_left_leg15_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2938 (0x2938)
	double __CustomProperty_PositionAlpha_right_leg15_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2950 (0x2950)
	struct FVector __CustomProperty_Position_right_leg15_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2958 (0x2958)
	double __CustomProperty_PositionAlpha_left_leg19_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2970 (0x2970)
	struct FVector __CustomProperty_Position_left_leg19_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2978 (0x2978)
	double __CustomProperty_PositionAlpha_right_leg19_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2990 (0x2990)
	struct FVector __CustomProperty_Position_right_leg19_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2998 (0x2998)
	double __CustomProperty_PositionAlpha_left_leg23_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x29B0 (0x29B0)
	struct FVector __CustomProperty_Position_left_leg23_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x29B8 (0x29B8)
	double __CustomProperty_PositionAlpha_left_leg27_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x29D0 (0x29D0)
	struct FVector __CustomProperty_Position_left_leg27_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x29D8 (0x29D8)
	double __CustomProperty_PositionAlpha_right_leg23_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x29F0 (0x29F0)
	struct FVector __CustomProperty_Position_right_leg23_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x29F8 (0x29F8)
	double __CustomProperty_PositionAlpha_left_leg31_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2A10 (0x2A10)
	struct FVector __CustomProperty_Position_left_leg31_Goal_B060879B4D8C11C9E82EF48105AA33F6;  // 0x2A18 (0x2A18)
	double __CustomProperty_PositionAlpha_Head1_Goal_831F36254A507BC4AFB19FB8CA5F25CE;  // 0x2A30 (0x2A30)
	struct FVector __CustomProperty_Position_Head1_Goal_831F36254A507BC4AFB19FB8CA5F25CE;  // 0x2A38 (0x2A38)
	struct FVector FootOffset;  // 0x2A50 (0x2A50)
	struct FVector LootAtPos;  // 0x2A68 (0x2A68)
	char pad_10880_1 : 7;  // 0x2A80 (0x2A80)
	bool RunPhase : 1;  // 0x2A80 (0x2A80)
	char pad_10881[7];  // 0x2A81 (0x2A81)
	struct FVector Offset;  // 0x2A88 (0x2A88)
	double Speed;  // 0x2AA0 (0x2AA0)
	double Direction;  // 0x2AA8 (0x2AA8)
	char pad_10928_1 : 7;  // 0x2AB0 (0x2AB0)
	bool bIsFastMoving : 1;  // 0x2AB0 (0x2AB0)
	char pad_10929[7];  // 0x2AB1 (0x2AB1)
	double SpeedCalc;  // 0x2AB8 (0x2AB8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_GiantCentipede.ABP_GiantCentipede_C.AnimGraph
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function ABP_GiantCentipede.ABP_GiantCentipede_C.BlueprintThreadSafeUpdateAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_GiantCentipede.ABP_GiantCentipede_C.BlueprintUpdateAnimation
	void ExecuteUbergraph_ABP_GiantCentipede(int32_t EntryPoint); // Function ABP_GiantCentipede.ABP_GiantCentipede_C.ExecuteUbergraph_ABP_GiantCentipede
}; 
 
 


