#pragma once 
#include <ABP_Slime_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_Slime.ABP_Slime_C
// Size: 0xD38(Inherited: 0x510)
struct UABP_Slime_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x520 (0x520)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x528 (0x528)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x530 (0x530)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x550 (0x550)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x598 (0x598)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x5C0 (0x5C0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x5E8 (0x5E8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x630 (0x630)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x650 (0x650)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x6C0 (0x6C0)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x6E0 (0x6E0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x7A8 (0x7A8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x7D0 (0x7D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x7F8 (0x7F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x820 (0x820)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x848 (0x848)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x870 (0x870)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x8B8 (0x8B8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0x8E0 (0x8E0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x9A8 (0x9A8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x9C8 (0x9C8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0xA10 (0xA10)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0xA38 (0xA38)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0xB00 (0xB00)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0xB20 (0xB20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0xB48 (0xB48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0xB68 (0xB68)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0xC30 (0xC30)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Slime.ABP_Slime_C.AnimGraph
	void ExecuteUbergraph_ABP_Slime(int32_t EntryPoint); // Function ABP_Slime.ABP_Slime_C.ExecuteUbergraph_ABP_Slime
}; 
 
 


