#pragma once 
#include <ABP_PlayerCharacterSelectCapture_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C
// Size: 0x1A33(Inherited: 0x5B0)
struct UABP_PlayerCharacterSelectCapture_C : UDCPlayerCharacterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x5B0 (0x5B0)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x5B8 (0x5B8)
	char pad_1508[4];  // 0x5E4 (0x5E4)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x5E8 (0x5E8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x5F0 (0x5F0)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x5F8 (0x5F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x618 (0x618)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x640 (0x640)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;  // 0x668 (0x668)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13;  // 0x6B0 (0x6B0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;  // 0x6D0 (0x6D0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12;  // 0x718 (0x718)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;  // 0x738 (0x738)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;  // 0x7A8 (0x7A8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;  // 0x888 (0x888)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;  // 0x8D0 (0x8D0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;  // 0x940 (0x940)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11;  // 0x9B0 (0x9B0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;  // 0x9D0 (0x9D0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10;  // 0xA18 (0xA18)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4;  // 0xA38 (0xA38)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;  // 0xB00 (0xB00)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_4;  // 0xC08 (0xC08)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;  // 0xC80 (0xC80)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_3;  // 0xCC8 (0xCC8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;  // 0xD40 (0xD40)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2;  // 0xD88 (0xD88)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0xE00 (0xE00)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;  // 0xE48 (0xE48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9;  // 0xEC0 (0xEC0)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3;  // 0xEE0 (0xEE0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0xFA8 (0xFA8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x1088 (0x1088)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0x10D0 (0x10D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x11B0 (0x11B0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x11D8 (0x11D8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;  // 0x1200 (0x1200)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8;  // 0x1248 (0x1248)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0x1268 (0x1268)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0x12B0 (0x12B0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x12D0 (0x12D0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x1340 (0x1340)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x1360 (0x1360)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x13A8 (0x13A8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x13C8 (0x13C8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;  // 0x1490 (0x1490)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x1598 (0x1598)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x15C0 (0x15C0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x15E8 (0x15E8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x1610 (0x1610)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0x1638 (0x1638)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x1680 (0x1680)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x16A0 (0x16A0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x16E8 (0x16E8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 000049013] Package BTD_CheckDistanceToLocation (000049013] Package BTD_CheckDistanceToLocation)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x1750 (0x1750)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x1770 (0x1770)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x17B8 (0x17B8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x17D8 (0x17D8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x18A0 (0x18A0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x18C8 (0x18C8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x18F0 (0x18F0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x1918 (0x1918)
	struct UAnimSequenceBase* ItemStandIdleAnimation;  // 0x1A20 (0x1A20)
	struct UAnimSequenceBase* SecondItemStandIdleAnimation;  // 0x1A28 (0x1A28)
	char pad_6704_1 : 7;  // 0x1A30 (0x1A30)
	bool bSecondaryItemSet : 1;  // 0x1A30 (0x1A30)
	char pad_6705_1 : 7;  // 0x1A31 (0x1A31)
	bool bPrimaryItemSet : 1;  // 0x1A31 (0x1A31)
	char pad_6706_1 : 7;  // 0x1A32 (0x1A32)
	bool bTwoHandedItemSet : 1;  // 0x1A32 (0x1A32)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_TransitionResult_71D708D84E12B4C3C1C32BA05B74CF1F(); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_TransitionResult_71D708D84E12B4C3C1C32BA05B74CF1F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_TransitionResult_6FE130B44ED351AF8C2604BBEEC5FF40(); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_TransitionResult_6FE130B44ED351AF8C2604BBEEC5FF40
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_BlendListByBool_FDF3806C460A816297B4E3A85F9CDE18(); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_BlendListByBool_FDF3806C460A816297B4E3A85F9CDE18
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_BlendListByBool_A9AC1C6E452166BB660C948174BAE83F(); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_BlendListByBool_A9AC1C6E452166BB660C948174BAE83F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_TransitionResult_45B0F85F441C2AD1E0D2C3AF5EAA193D(); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_TransitionResult_45B0F85F441C2AD1E0D2C3AF5EAA193D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_TransitionResult_12BFB1144E6136DD81E4C98147AA0D56(); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_TransitionResult_12BFB1144E6136DD81E4C98147AA0D56
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_BlendListByBool_1007956F4942F1FFDC35C1A6430A9FF8(); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PlayerCharacterSelectCapture_AnimGraphNode_BlendListByBool_1007956F4942F1FFDC35C1A6430A9FF8
	void OnChangedStandIdle(struct UAnimSequence* ItemStandIdleAnimation, struct FGameplayTag ItemHandType, struct FGameplayTag ItemSlotType); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.OnChangedStandIdle
	void ExecuteUbergraph_ABP_PlayerCharacterSelectCapture(int32_t EntryPoint); // Function ABP_PlayerCharacterSelectCapture.ABP_PlayerCharacterSelectCapture_C.ExecuteUbergraph_ABP_PlayerCharacterSelectCapture
}; 
 
 


