#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_SkeletonSpearman.ABP_SkeletonSpearman_C.AnimBlueprintGeneratedMutableData
// Size: 0xA(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool __BoolProperty_1 : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool __BoolProperty_2 : 1;  // 0x9 (0x9)


}; 
 
 // ScriptStruct ABP_SkeletonSpearman.ABP_SkeletonSpearman_C.AnimBlueprintGeneratedConstantData
// Size: 0x188(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_204;  // 0x4 (0x4)
	struct FName __NameProperty_205;  // 0xC (0xC)
	uint8_t __EnumProperty_206;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	struct FName __NameProperty_207;  // 0x18 (0x18)
	struct FName __NameProperty_208;  // 0x20 (0x20)
	int32_t __IntProperty_209;  // 0x28 (0x28)
	struct FName __NameProperty_210;  // 0x2C (0x2C)
	struct FName __NameProperty_211;  // 0x34 (0x34)
	int32_t __IntProperty_212;  // 0x3C (0x3C)
	struct FName __NameProperty_213;  // 0x40 (0x40)
	int32_t __IntProperty_214;  // 0x48 (0x48)
	char pad_76_1 : 7;  // 0x4C (0x4C)
	bool __BoolProperty_215 : 1;  // 0x4C (0x4C)
	char pad_77[3];  // 0x4D (0x4D)
	float __FloatProperty_216;  // 0x50 (0x50)
	struct FInputScaleBiasClampConstants __StructProperty_217;  // 0x54 (0x54)
	float __FloatProperty_218;  // 0x80 (0x80)
	uint8_t __EnumProperty_219;  // 0x84 (0x84)
	enum class EAnimGroupRole __ByteProperty_220;  // 0x85 (0x85)
	char pad_134[2];  // 0x86 (0x86)
	struct FName __NameProperty_221;  // 0x88 (0x88)
	struct UBlendProfile* __BlendProfile_222;  // 0x90 (0x90)
	struct UCurveFloat* __CurveFloat_223;  // 0x98 (0x98)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool __BoolProperty_224 : 1;  // 0xA0 (0xA0)
	uint8_t __EnumProperty_225;  // 0xA1 (0xA1)
	uint8_t __EnumProperty_226;  // 0xA2 (0xA2)
	char pad_163[5];  // 0xA3 (0xA3)
	struct TArray<float> __ArrayProperty_227;  // 0xA8 (0xA8)
	struct FName __NameProperty_228;  // 0xB8 (0xB8)
	struct FName __NameProperty_229;  // 0xC0 (0xC0)
	int32_t __IntProperty_230;  // 0xC8 (0xC8)
	char pad_204[4];  // 0xCC (0xCC)
	struct FAnimNodeFunctionRef __StructProperty_231;  // 0xD0 (0xD0)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xF0 (0xF0)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x170 (0x170)


}; 
 
 // Function ABP_SkeletonSpearman.ABP_SkeletonSpearman_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_SkeletonSpearman.ABP_SkeletonSpearman_C.ExecuteUbergraph_ABP_SkeletonSpearman
struct FExecuteUbergraph_ABP_SkeletonSpearman
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 