#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_SkeletonWarlord.ABP_SkeletonWarlord_C.AnimBlueprintGeneratedMutableData
// Size: 0xA(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool __BoolProperty_1 : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool __BoolProperty_2 : 1;  // 0x9 (0x9)


}; 
 
 // ScriptStruct ABP_SkeletonWarlord.ABP_SkeletonWarlord_C.AnimBlueprintGeneratedConstantData
// Size: 0x180(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_166;  // 0x4 (0x4)
	struct FName __NameProperty_167;  // 0xC (0xC)
	uint8_t __EnumProperty_168;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	struct FName __NameProperty_169;  // 0x18 (0x18)
	struct FName __NameProperty_170;  // 0x20 (0x20)
	int32_t __IntProperty_171;  // 0x28 (0x28)
	struct FName __NameProperty_172;  // 0x2C (0x2C)
	int32_t __IntProperty_173;  // 0x34 (0x34)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool __BoolProperty_174 : 1;  // 0x38 (0x38)
	char pad_57[3];  // 0x39 (0x39)
	float __FloatProperty_175;  // 0x3C (0x3C)
	struct FInputScaleBiasClampConstants __StructProperty_176;  // 0x40 (0x40)
	float __FloatProperty_177;  // 0x6C (0x6C)
	uint8_t __EnumProperty_178;  // 0x70 (0x70)
	enum class EAnimGroupRole __ByteProperty_179;  // 0x71 (0x71)
	char pad_114[2];  // 0x72 (0x72)
	struct FName __NameProperty_180;  // 0x74 (0x74)
	char pad_124[4];  // 0x7C (0x7C)
	struct UBlendProfile* __BlendProfile_181;  // 0x80 (0x80)
	struct UCurveFloat* __CurveFloat_182;  // 0x88 (0x88)
	char pad_144_1 : 7;  // 0x90 (0x90)
	bool __BoolProperty_183 : 1;  // 0x90 (0x90)
	uint8_t __EnumProperty_184;  // 0x91 (0x91)
	uint8_t __EnumProperty_185;  // 0x92 (0x92)
	char pad_147[5];  // 0x93 (0x93)
	struct TArray<float> __ArrayProperty_186;  // 0x98 (0x98)
	struct FName __NameProperty_187;  // 0xA8 (0xA8)
	int32_t __IntProperty_188;  // 0xB0 (0xB0)
	struct FName __NameProperty_189;  // 0xB4 (0xB4)
	struct FName __NameProperty_190;  // 0xBC (0xBC)
	int32_t __IntProperty_191;  // 0xC4 (0xC4)
	struct FAnimNodeFunctionRef __StructProperty_192;  // 0xC8 (0xC8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xE8 (0xE8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x168 (0x168)


}; 
 
 // Function ABP_SkeletonWarlord.ABP_SkeletonWarlord_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_SkeletonWarlord.ABP_SkeletonWarlord_C.ExecuteUbergraph_ABP_SkeletonWarlord
struct FExecuteUbergraph_ABP_SkeletonWarlord
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 