#pragma once 
#include <ABP_OilLantern_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_OilLantern.ABP_OilLantern_C
// Size: 0x1D01(Inherited: 0x5B0)
struct UABP_OilLantern_C : UItemWeaponAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x5B0 (0x5B0)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x5B8 (0x5B8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x5C8 (0x5C8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x5D0 (0x5D0)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x5D8 (0x5D8)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x5F8 (0x5F8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;  // 0x640 (0x640)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;  // 0x748 (0x748)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;  // 0x770 (0x770)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;  // 0x798 (0x798)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;  // 0x7C0 (0x7C0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;  // 0x7E8 (0x7E8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;  // 0x810 (0x810)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6;  // 0x858 (0x858)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;  // 0x920 (0x920)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16;  // 0x948 (0x948)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;  // 0x968 (0x968)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15;  // 0x990 (0x990)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;  // 0x9B0 (0x9B0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14;  // 0x9D8 (0x9D8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;  // 0x9F8 (0x9F8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5;  // 0xA40 (0xA40)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;  // 0xB08 (0xB08)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13;  // 0xB30 (0xB30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6;  // 0xB50 (0xB50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12;  // 0xC18 (0xC18)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;  // 0xC38 (0xC38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;  // 0xC60 (0xC60)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0xC88 (0xC88)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;  // 0xCB0 (0xCB0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;  // 0xCF8 (0xCF8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;  // 0xDC0 (0xDC0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11;  // 0xDE8 (0xDE8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;  // 0xE08 (0xE08)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0xED0 (0xED0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;  // 0xF18 (0xF18)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10;  // 0xF40 (0xF40)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0xF60 (0xF60)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9;  // 0xF88 (0xF88)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5;  // 0xFA8 (0xFA8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8;  // 0x1070 (0x1070)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4;  // 0x1090 (0x1090)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x1158 (0x1158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x1180 (0x1180)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x11A8 (0x11A8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x11D0 (0x11D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x11F8 (0x11F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x1220 (0x1220)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x1248 (0x1248)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0x1290 (0x1290)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0x12B8 (0x12B8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0x1380 (0x1380)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0x13A0 (0x13A0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x13C8 (0x13C8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0x13E8 (0x13E8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x1430 (0x1430)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0x1458 (0x1458)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x1520 (0x1520)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x1540 (0x1540)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x1568 (0x1568)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3;  // 0x1588 (0x1588)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x1650 (0x1650)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x1698 (0x1698)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x16E0 (0x16E0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x1728 (0x1728)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x1748 (0x1748)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;  // 0x1810 (0x1810)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x1918 (0x1918)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;  // 0x1A20 (0x1A20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x1B38 (0x1B38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x1B60 (0x1B60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x1B88 (0x1B88)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x1BD0 (0x1BD0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x1BF0 (0x1BF0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x1C18 (0x1C18)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x1C38 (0x1C38)
	char pad_7424_1 : 7;  // 0x1D00 (0x1D00)
	bool bIsInHand : 1;  // 0x1D00 (0x1D00)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_OilLantern.ABP_OilLantern_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_F473FE9642F5792C2DF6559B173264C5(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_F473FE9642F5792C2DF6559B173264C5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_CB7BAF094D179E8405DF80982EE7444B(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_CB7BAF094D179E8405DF80982EE7444B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_SequencePlayer_E29A8C234F43DD4DEA5CDCBD3C9B0F35(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_SequencePlayer_E29A8C234F43DD4DEA5CDCBD3C9B0F35
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_BlendListByBool_87C8E3DA4DB500A944463182CB2F8A49(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_BlendListByBool_87C8E3DA4DB500A944463182CB2F8A49
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_5E98B909412E43D4AEF1BCB7E24AE059(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_5E98B909412E43D4AEF1BCB7E24AE059
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_3AD8C6C443BDCDC70365AAB5EC1F536D(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_3AD8C6C443BDCDC70365AAB5EC1F536D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_A0E6917147EEBF2F3DD7BDB76CF6E240(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_A0E6917147EEBF2F3DD7BDB76CF6E240
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_C2568A8B4CCAF06CF2C3F0918D3F04B8(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_C2568A8B4CCAF06CF2C3F0918D3F04B8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_E02360EC4B3EBDB8246D67A2BDC23C03(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_E02360EC4B3EBDB8246D67A2BDC23C03
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_D09DC6A947057B7B54B38C923EFD8F36(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_D09DC6A947057B7B54B38C923EFD8F36
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_6A0484FB463BC0024A3538B3A198ED2A(); // Function ABP_OilLantern.ABP_OilLantern_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_OilLantern_AnimGraphNode_TransitionResult_6A0484FB463BC0024A3538B3A198ED2A
	void OnItemDataUpdated(struct FItemData& ItemData); // Function ABP_OilLantern.ABP_OilLantern_C.OnItemDataUpdated
	void ExecuteUbergraph_ABP_OilLantern(int32_t EntryPoint); // Function ABP_OilLantern.ABP_OilLantern_C.ExecuteUbergraph_ABP_OilLantern
}; 
 
 


