#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_Slime.ABP_Slime_C.AnimBlueprintGeneratedMutableData
// Size: 0x8(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)


}; 
 
 // ScriptStruct ABP_Slime.ABP_Slime_C.AnimBlueprintGeneratedConstantData
// Size: 0x140(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_115;  // 0x4 (0x4)
	float __FloatProperty_116;  // 0xC (0xC)
	struct FName __NameProperty_117;  // 0x10 (0x10)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool __BoolProperty_118 : 1;  // 0x18 (0x18)
	char pad_25[3];  // 0x19 (0x19)
	struct FName __NameProperty_119;  // 0x1C (0x1C)
	struct FName __NameProperty_120;  // 0x24 (0x24)
	int32_t __IntProperty_121;  // 0x2C (0x2C)
	float __FloatProperty_122;  // 0x30 (0x30)
	struct FInputScaleBiasClampConstants __StructProperty_123;  // 0x34 (0x34)
	float __FloatProperty_124;  // 0x60 (0x60)
	char pad_100_1 : 7;  // 0x64 (0x64)
	bool __BoolProperty_125 : 1;  // 0x64 (0x64)
	uint8_t __EnumProperty_126;  // 0x65 (0x65)
	enum class EAnimGroupRole __ByteProperty_127;  // 0x66 (0x66)
	char pad_103[1];  // 0x67 (0x67)
	struct FName __NameProperty_128;  // 0x68 (0x68)
	int32_t __IntProperty_129;  // 0x70 (0x70)
	struct FName __NameProperty_130;  // 0x74 (0x74)
	struct FName __NameProperty_131;  // 0x7C (0x7C)
	int32_t __IntProperty_132;  // 0x84 (0x84)
	struct FAnimNodeFunctionRef __StructProperty_133;  // 0x88 (0x88)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xA8 (0xA8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x128 (0x128)


}; 
 
 // Function ABP_Slime.ABP_Slime_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_Slime.ABP_Slime_C.ExecuteUbergraph_ABP_Slime
struct FExecuteUbergraph_ABP_Slime
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 