#pragma once 
#include <ABP_Door_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_Door.ABP_Door_C
// Size: 0x7C0(Inherited: 0x450)
struct UABP_Door_C : UDCAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x450 (0x450)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x458 (0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x460 (0x460)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x468 (0x468)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x488 (0x488)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x4D0 (0x4D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x4F8 (0x4F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x520 (0x520)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x548 (0x548)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x570 (0x570)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x598 (0x598)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x5C0 (0x5C0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x608 (0x608)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x628 (0x628)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x670 (0x670)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x690 (0x690)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x6D8 (0x6D8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x6F8 (0x6F8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Door.ABP_Door_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_0924E39D4A29496ACD814EAC38BF2BF5(); // Function ABP_Door.ABP_Door_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_0924E39D4A29496ACD814EAC38BF2BF5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_38EC38F54696A864E66A05A88B3CACCF(); // Function ABP_Door.ABP_Door_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_38EC38F54696A864E66A05A88B3CACCF
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_EDC947BD45B5C1BDAD0053A8F7C854DA(); // Function ABP_Door.ABP_Door_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_EDC947BD45B5C1BDAD0053A8F7C854DA
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_765EE8C848BFAB3A5BDBB389A5B8FC4A(); // Function ABP_Door.ABP_Door_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_765EE8C848BFAB3A5BDBB389A5B8FC4A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_8F377AE14DE82094A97556B062A5647F(); // Function ABP_Door.ABP_Door_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_8F377AE14DE82094A97556B062A5647F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_EE0054E04F967EF52EEDA19CCF884130(); // Function ABP_Door.ABP_Door_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Door_AnimGraphNode_TransitionResult_EE0054E04F967EF52EEDA19CCF884130
	void ExecuteUbergraph_ABP_Door(int32_t EntryPoint); // Function ABP_Door.ABP_Door_C.ExecuteUbergraph_ABP_Door
}; 
 
 


