#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_Lich.ABP_Lich_C.AnimBlueprintGeneratedMutableData
// Size: 0x14(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	float __FloatProperty_1;  // 0x8 (0x8)
	float __FloatProperty_2;  // 0xC (0xC)
	float __FloatProperty_3;  // 0x10 (0x10)


}; 
 
 // ScriptStruct ABP_Lich.ABP_Lich_C.AnimBlueprintGeneratedConstantData
// Size: 0x158(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_136;  // 0x4 (0x4)
	struct FName __NameProperty_137;  // 0xC (0xC)
	struct FName __NameProperty_138;  // 0x14 (0x14)
	char pad_28_1 : 7;  // 0x1C (0x1C)
	bool __BoolProperty_139 : 1;  // 0x1C (0x1C)
	uint8_t __EnumProperty_140;  // 0x1D (0x1D)
	char pad_30[2];  // 0x1E (0x1E)
	struct FName __NameProperty_141;  // 0x20 (0x20)
	struct FName __NameProperty_142;  // 0x28 (0x28)
	struct FName __NameProperty_143;  // 0x30 (0x30)
	int32_t __IntProperty_144;  // 0x38 (0x38)
	float __FloatProperty_145;  // 0x3C (0x3C)
	struct FInputScaleBiasClampConstants __StructProperty_146;  // 0x40 (0x40)
	float __FloatProperty_147;  // 0x6C (0x6C)
	float __FloatProperty_148;  // 0x70 (0x70)
	char pad_116_1 : 7;  // 0x74 (0x74)
	bool __BoolProperty_149 : 1;  // 0x74 (0x74)
	uint8_t __EnumProperty_150;  // 0x75 (0x75)
	enum class EAnimGroupRole __ByteProperty_151;  // 0x76 (0x76)
	char pad_119[1];  // 0x77 (0x77)
	struct FName __NameProperty_152;  // 0x78 (0x78)
	struct FName __NameProperty_153;  // 0x80 (0x80)
	int32_t __IntProperty_154;  // 0x88 (0x88)
	struct FName __NameProperty_155;  // 0x8C (0x8C)
	struct FName __NameProperty_156;  // 0x94 (0x94)
	int32_t __IntProperty_157;  // 0x9C (0x9C)
	struct FAnimNodeFunctionRef __StructProperty_158;  // 0xA0 (0xA0)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xC0 (0xC0)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x140 (0x140)


}; 
 
 // Function ABP_Lich.ABP_Lich_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_Lich.ABP_Lich_C.ExecuteUbergraph_ABP_Lich
struct FExecuteUbergraph_ABP_Lich
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 