#pragma once 
#include <ABP_GoblinWarrior_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_GoblinWarrior.ABP_GoblinWarrior_C
// Size: 0x1637(Inherited: 0x510)
struct UABP_GoblinWarrior_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	char pad_1316[4];  // 0x524 (0x524)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x528 (0x528)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x530 (0x530)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x538 (0x538)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x558 (0x558)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;  // 0x5A0 (0x5A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;  // 0x5C8 (0x5C8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x5F0 (0x5F0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x618 (0x618)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x640 (0x640)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x668 (0x668)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;  // 0x690 (0x690)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0x6D8 (0x6D8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0x6F8 (0x6F8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x740 (0x740)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x760 (0x760)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x7A8 (0x7A8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x7C8 (0x7C8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x838 (0x838)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x858 (0x858)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x920 (0x920)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0xA28 (0xA28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0xA50 (0xA50)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0xA78 (0xA78)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0xAA0 (0xAA0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0xAC8 (0xAC8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0xAF0 (0xAF0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0xB38 (0xB38)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;  // 0xB80 (0xB80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0xBA8 (0xBA8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0xBD0 (0xBD0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;  // 0xBF8 (0xBF8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;  // 0xCC0 (0xCC0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;  // 0xD88 (0xD88)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;  // 0xDA8 (0xDA8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2;  // 0xDC8 (0xDC8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0xEC0 (0xEC0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0xF08 (0xF08)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0xFE8 (0xFE8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x1008 (0x1008)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x1050 (0x1050)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0x1098 (0x1098)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x10C0 (0x10C0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x10E8 (0x10E8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0x1110 (0x1110)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0x11D8 (0x11D8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;  // 0x12A0 (0x12A0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;  // 0x12C0 (0x12C0)
	struct FAnimNode_LegIK AnimGraphNode_LegIK;  // 0x12E0 (0x12E0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // [x13D8 ([x13D8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 000046027] rited: 0x510)
 (000046027] Package GC_WoodenBarrel02_Default)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x1500 (0x1500)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x1520 (0x1520)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x1548 (0x1548)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x1568 (0x1568)
	int32_t Deadbody Index;  // 0x1630 (0x1630)
	char pad_5684_1 : 7;  // 0x1634 (0x1634)
	bool bIsDeadbody1 : 1;  // 0x1634 (0x1634)
	char pad_5685_1 : 7;  // 0x1635 (0x1635)
	bool bIsDeadbody2 : 1;  // 0x1635 (0x1635)
	char pad_5686_1 : 7;  // 0x1636 (0x1636)
	bool bIsDeadbody3 : 1;  // 0x1636 (0x1636)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_GoblinWarrior.ABP_GoblinWarrior_C.AnimGraph
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function ABP_GoblinWarrior.ABP_GoblinWarrior_C.BlueprintThreadSafeUpdateAnimation
	void OnRep_Deadbody Index(); // Function ABP_GoblinWarrior.ABP_GoblinWarrior_C.OnRep_Deadbody Index
	void ExecuteUbergraph_ABP_GoblinWarrior(int32_t EntryPoint); // Function ABP_GoblinWarrior.ABP_GoblinWarrior_C.ExecuteUbergraph_ABP_GoblinWarrior
}; 
 
 


