#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_SkeletonArcher.ABP_SkeletonArcher_C.AnimBlueprintGeneratedMutableData
// Size: 0xA(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool __BoolProperty_1 : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool __BoolProperty_2 : 1;  // 0x9 (0x9)


}; 
 
 // ScriptStruct ABP_SkeletonArcher.ABP_SkeletonArcher_C.AnimBlueprintGeneratedConstantData
// Size: 0x180(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_207;  // 0x4 (0x4)
	struct FName __NameProperty_208;  // 0xC (0xC)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool __BoolProperty_209 : 1;  // 0x14 (0x14)
	uint8_t __EnumProperty_210;  // 0x15 (0x15)
	char pad_22[2];  // 0x16 (0x16)
	struct FName __NameProperty_211;  // 0x18 (0x18)
	struct FName __NameProperty_212;  // 0x20 (0x20)
	int32_t __IntProperty_213;  // 0x28 (0x28)
	struct FName __NameProperty_214;  // 0x2C (0x2C)
	struct FName __NameProperty_215;  // 0x34 (0x34)
	int32_t __IntProperty_216;  // 0x3C (0x3C)
	float __FloatProperty_217;  // 0x40 (0x40)
	struct FInputScaleBiasClampConstants __StructProperty_218;  // 0x44 (0x44)
	float __FloatProperty_219;  // 0x70 (0x70)
	uint8_t __EnumProperty_220;  // 0x74 (0x74)
	enum class EAnimGroupRole __ByteProperty_221;  // 0x75 (0x75)
	char pad_118[2];  // 0x76 (0x76)
	struct FName __NameProperty_222;  // 0x78 (0x78)
	struct UBlendProfile* __BlendProfile_223;  // 0x80 (0x80)
	struct UCurveFloat* __CurveFloat_224;  // 0x88 (0x88)
	char pad_144_1 : 7;  // 0x90 (0x90)
	bool __BoolProperty_225 : 1;  // 0x90 (0x90)
	uint8_t __EnumProperty_226;  // 0x91 (0x91)
	uint8_t __EnumProperty_227;  // 0x92 (0x92)
	char pad_147[5];  // 0x93 (0x93)
	struct TArray<float> __ArrayProperty_228;  // 0x98 (0x98)
	struct FName __NameProperty_229;  // 0xA8 (0xA8)
	int32_t __IntProperty_230;  // 0xB0 (0xB0)
	struct FName __NameProperty_231;  // 0xB4 (0xB4)
	struct FName __NameProperty_232;  // 0xBC (0xBC)
	int32_t __IntProperty_233;  // 0xC4 (0xC4)
	struct FAnimNodeFunctionRef __StructProperty_234;  // 0xC8 (0xC8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xE8 (0xE8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x168 (0x168)


}; 
 
 // Function ABP_SkeletonArcher.ABP_SkeletonArcher_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_SkeletonArcher.ABP_SkeletonArcher_C.ExecuteUbergraph_ABP_SkeletonArcher
struct FExecuteUbergraph_ABP_SkeletonArcher
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 