#pragma once 
#include <ABP_PlayerCharacter_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_PlayerCharacter.ABP_PlayerCharacter_C
// Size: 0x6C81(Inherited: 0x5B0)
struct UABP_PlayerCharacter_C : UDCPlayerCharacterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x5B0 (0x5B0)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x5B8 (0x5B8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x680 (0x680)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x688 (0x688)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;  // 0x690 (0x690)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;  // 0x798 (0x798)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;  // 0x7C0 (0x7C0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;  // 0x7E8 (0x7E8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34;  // 0x830 (0x830)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;  // 0x850 (0x850)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33;  // 0x898 (0x898)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;  // 0x8B8 (0x8B8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16;  // 0x928 (0x928)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;  // 0xA08 (0xA08)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;  // 0xA50 (0xA50)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;  // 0xAC0 (0xAC0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32;  // 0xB30 (0xB30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;  // 0xB50 (0xB50)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15;  // 0xB98 (0xB98)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;  // 0xC78 (0xC78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;  // 0xCC0 (0xCC0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;  // 0xD08 (0xD08)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31;  // 0xD50 (0xD50)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_14;  // 0xD70 (0xD70)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;  // 0xE38 (0xE38)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14;  // 0xF40 (0xF40)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42;  // 0x1020 (0x1020)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41;  // 0x1048 (0x1048)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;  // 0x1070 (0x1070)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;  // 0x10B8 (0x10B8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;  // 0x11C0 (0x11C0)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_4;  // 0x11E0 (0x11E0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;  // 0x12D8 (0x12D8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;  // 0x12F8 (0x12F8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;  // 0x1400 (0x1400)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40;  // 0x1508 (0x1508)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39;  // 0x1530 (0x1530)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38;  // 0x1558 (0x1558)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13;  // 0x1580 (0x1580)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37;  // 0x1660 (0x1660)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12;  // 0x1688 (0x1688)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36;  // 0x1768 (0x1768)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11;  // 0x1790 (0x1790)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35;  // 0x1870 (0x1870)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10;  // 0x1898 (0x1898)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30;  // 0x1978 (0x1978)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_13;  // 0x1998 (0x1998)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9;  // 0x1A60 (0x1A60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;  // 0x1B40 (0x1B40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;  // 0x1C48 (0x1C48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;  // 0x1C70 (0x1C70)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;  // 0x1C98 (0x1C98)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29;  // 0x1CE0 (0x1CE0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;  // 0x1D00 (0x1D00)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28;  // 0x1D48 (0x1D48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;  // 0x1D68 (0x1D68)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27;  // 0x1DD8 (0x1DD8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;  // 0x1DF8 (0x1DF8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;  // 0x1E40 (0x1E40)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;  // 0x1F20 (0x1F20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;  // 0x1F68 (0x1F68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;  // 0x1FB0 (0x1FB0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26;  // 0x1FF8 (0x1FF8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12;  // 0x2018 (0x2018)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34;  // 0x20E0 (0x20E0)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x2108 (0x2108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;  // 0x2150 (0x2150)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;  // 0x2258 (0x2258)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;  // 0x2280 (0x2280)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;  // 0x22A8 (0x22A8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;  // 0x22D0 (0x22D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;  // 0x22F8 (0x22F8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33;  // 0x2320 (0x2320)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;  // 0x2348 (0x2348)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;  // 0x2390 (0x2390)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;  // 0x2470 (0x2470)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9;  // 0x24B8 (0x24B8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25;  // 0x2580 (0x2580)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;  // 0x25A0 (0x25A0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;  // 0x25C8 (0x25C8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24;  // 0x2610 (0x2610)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32;  // 0x2630 (0x2630)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;  // 0x2658 (0x2658)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8;  // 0x26A0 (0x26A0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;  // 0x2768 (0x2768)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;  // 0x2848 (0x2848)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23;  // 0x2890 (0x2890)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31;  // 0x28B0 (0x28B0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;  // 0x28D8 (0x28D8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;  // 0x29B8 (0x29B8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7;  // 0x2A00 (0x2A00)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;  // 0x2AC8 (0x2AC8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22;  // 0x2B10 (0x2B10)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11;  // 0x2B30 (0x2B30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21;  // 0x2BF8 (0x2BF8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30;  // 0x2C18 (0x2C18)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20;  // 0x2C40 (0x2C40)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10;  // 0x2C60 (0x2C60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;  // 0x2D28 (0x2D28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;  // 0x2E30 (0x2E30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;  // 0x2F38 (0x2F38)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29;  // 0x2F80 (0x2F80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;  // 0x2FA8 (0x2FA8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;  // 0x3088 (0x3088)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;  // 0x30B0 (0x30B0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;  // 0x30D8 (0x30D8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;  // 0x31E0 (0x31E0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;  // 0x3208 (0x3208)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;  // 0x3230 (0x3230)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;  // 0x3310 (0x3310)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19;  // 0x3338 (0x3338)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;  // 0x3358 (0x3358)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18;  // 0x3380 (0x3380)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9;  // 0x33A0 (0x33A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;  // 0x3468 (0x3468)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;  // 0x3490 (0x3490)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;  // 0x34B8 (0x34B8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;  // 0x34E0 (0x34E0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;  // 0x3508 (0x3508)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;  // 0x3530 (0x3530)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;  // 0x3558 (0x3558)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;  // 0x3580 (0x3580)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;  // 0x35F0 (0x35F0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;  // 0x3638 (0x3638)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;  // 0x3680 (0x3680)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6;  // 0x36F0 (0x36F0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;  // 0x37B8 (0x37B8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;  // 0x3828 (0x3828)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17;  // 0x3850 (0x3850)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;  // 0x3870 (0x3870)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;  // 0x38E0 (0x38E0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;  // 0x3928 (0x3928)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;  // 0x3970 (0x3970)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5;  // 0x39E0 (0x39E0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;  // 0x3AA8 (0x3AA8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;  // 0x3B18 (0x3B18)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16;  // 0x3B40 (0x3B40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;  // 0x3B60 (0x3B60)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;  // 0x3B88 (0x3B88)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x3C50 (0x3C50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;  // 0x3CC0 (0x3CC0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15;  // 0x3CE8 (0x3CE8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;  // 0x3D08 (0x3D08)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14;  // 0x3D30 (0x3D30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8;  // 0x3D50 (0x3D50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13;  // 0x3E18 (0x3E18)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;  // 0x3E38 (0x3E38)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12;  // 0x3E60 (0x3E60)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7;  // 0x3E80 (0x3E80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;  // 0x3F48 (0x3F48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x4050 (0x4050)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9;  // 0x4158 (0x4158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;  // 0x4270 (0x4270)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;  // 0x4298 (0x4298)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;  // 0x42C0 (0x42C0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;  // 0x4308 (0x4308)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;  // 0x4350 (0x4350)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11;  // 0x4418 (0x4418)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6;  // 0x4438 (0x4438)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8;  // 0x4500 (0x4500)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;  // 0x4618 (0x4618)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x4640 (0x4640)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x4668 (0x4668)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x4690 (0x4690)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;  // 0x46B8 (0x46B8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;  // 0x4700 (0x4700)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;  // 0x4748 (0x4748)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;  // 0x4790 (0x4790)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;  // 0x47D8 (0x47D8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;  // 0x4820 (0x4820)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;  // 0x4868 (0x4868)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10;  // 0x48B0 (0x48B0)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_4;  // 0x48D0 (0x48D0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;  // 0x4948 (0x4948)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_3;  // 0x4990 (0x4990)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;  // 0x4A08 (0x4A08)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2;  // 0x4A50 (0x4A50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;  // 0x4AC8 (0x4AC8)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;  // 0x4B10 (0x4B10)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9;  // 0x4B88 (0x4B88)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5;  // 0x4BA8 (0x4BA8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8;  // 0x4C70 (0x4C70)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0x4C90 (0x4C90)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x4CD8 (0x4CD8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;  // 0x4D20 (0x4D20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;  // 0x4D68 (0x4D68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0x4DB0 (0x4DB0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;  // 0x4DF8 (0x4DF8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x4E40 (0x4E40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0x4E88 (0x4E88)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4;  // 0x4EA8 (0x4EA8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0x4F70 (0x4F70)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x5050 (0x5050)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x5070 (0x5070)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x5098 (0x5098)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x50C0 (0x50C0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x50E8 (0x50E8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;  // 0x5110 (0x5110)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7;  // 0x51D8 (0x51D8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;  // 0x52F0 (0x52F0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;  // 0x5318 (0x5318)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;  // 0x5340 (0x5340)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6;  // 0x5408 (0x5408)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5;  // 0x5520 (0x5520)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;  // 0x5638 (0x5638)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x5660 (0x5660)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;  // 0x5680 (0x5680)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x56A8 (0x56A8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4;  // 0x56C8 (0x56C8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;  // 0x57E0 (0x57E0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;  // 0x5808 (0x5808)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;  // 0x58D0 (0x58D0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;  // 0x58F8 (0x58F8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;  // 0x5920 (0x5920)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3;  // 0x5948 (0x5948)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;  // 0x5A60 (0x5A60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;  // 0x5AA8 (0x5AA8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2;  // 0x5AF0 (0x5AF0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;  // 0x5C08 (0x5C08)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x5D20 (0x5D20)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3;  // 0x5D40 (0x5D40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x5E08 (0x5E08)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;  // 0x5E50 (0x5E50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0x5E78 (0x5E78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0x5EA0 (0x5EA0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0x5EC8 (0x5EC8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x5EF0 (0x5EF0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0x5F38 (0x5F38)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;  // 0x6000 (0x6000)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0x6048 (0x6048)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0x6090 (0x6090)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0x6170 (0x6170)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x6238 (0x6238)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x6258 (0x6258)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x6320 (0x6320)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x6348 (0x6348)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting_3;  // 0x6370 (0x6370)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;  // 0x6490 (0x6490)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;  // 0x64B0 (0x64B0)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_3;  // 0x64D0 (0x64D0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x65C8 (0x65C8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x65F0 (0x65F0)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting_2;  // 0x6610 (0x6610)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2;  // 0x6730 (0x6730)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x6828 (0x6828)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;  // 0x6870 (0x6870)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x6890 (0x6890)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;  // 0x68B8 (0x68B8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;  // 0x68D8 (0x68D8)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting;  // 0x68F8 (0x68F8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK;  // 0x6A18 (0x6A18)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;  // 0x6B10 (0x6B10)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x6B30 (0x6B30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x6B58 (0x6B58)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x6B78 (0x6B78)
	char pad_27712_1 : 7;  // 0x6C40 (0x6C40)
	bool isCrawling : 1;  // 0x6C40 (0x6C40)
	char pad_27713_1 : 7;  // 0x6C41 (0x6C41)
	bool isBlocking : 1;  // 0x6C41 (0x6C41)
	char pad_27714_1 : 7;  // 0x6C42 (0x6C42)
	bool bIsNormalGroundMoving : 1;  // 0x6C42 (0x6C42)
	char pad_27715_1 : 7;  // 0x6C43 (0x6C43)
	bool bIsNormalFalling : 1;  // 0x6C43 (0x6C43)
	char pad_27716_1 : 7;  // 0x6C44 (0x6C44)
	bool bIsRootMotionCurveSmall : 1;  // 0x6C44 (0x6C44)
	char pad_27717_1 : 7;  // 0x6C45 (0x6C45)
	bool bIsIKHandOffCurveLarge : 1;  // 0x6C45 (0x6C45)
	char pad_27718_1 : 7;  // 0x6C46 (0x6C46)
	bool bIsCrouchMovingOrRootMotion : 1;  // 0x6C46 (0x6C46)
	char pad_27719_1 : 7;  // 0x6C47 (0x6C47)
	bool bIsNormalCrouchGroundMoving : 1;  // 0x6C47 (0x6C47)
	char pad_27720_1 : 7;  // 0x6C48 (0x6C48)
	bool bIsRestMontageLooping : 1;  // 0x6C48 (0x6C48)
	char pad_27721_1 : 7;  // 0x6C49 (0x6C49)
	bool bIsWomanElfHead : 1;  // 0x6C49 (0x6C49)
	char pad_27722_1 : 7;  // 0x6C4A (0x6C4A)
	bool bShouldPlayHitReactionFlipFlop : 1;  // 0x6C4A (0x6C4A)
	char pad_27723_1 : 7;  // 0x6C4B (0x6C4B)
	bool bShouldPlayHitReaction : 1;  // 0x6C4B (0x6C4B)
	char pad_27724_1 : 7;  // 0x6C4C (0x6C4C)
	bool bIsWomanHead : 1;  // 0x6C4C (0x6C4C)
	char pad_27725_1 : 7;  // 0x6C4D (0x6C4D)
	bool bIsOrcHead : 1;  // 0x6C4D (0x6C4D)
	char pad_27726_1 : 7;  // 0x6C4E (0x6C4E)
	bool bIsMovingWithMontageLooping : 1;  // 0x6C4E (0x6C4E)
	char pad_27727_1 : 7;  // 0x6C4F (0x6C4F)
	bool bIsLandToJogs : 1;  // 0x6C4F (0x6C4F)
	char pad_27728_1 : 7;  // 0x6C50 (0x6C50)
	bool bIsLandToIdle : 1;  // 0x6C50 (0x6C50)
	char pad_27729_1 : 7;  // 0x6C51 (0x6C51)
	bool bIsJumpStartToApex : 1;  // 0x6C51 (0x6C51)
	char pad_27730[2];  // 0x6C52 (0x6C52)
	float AimEmoteCurveValue;  // 0x6C54 (0x6C54)
	float SmokingPipeCurveValue;  // 0x6C58 (0x6C58)
	float CupOfCoffeeCurveValue;  // 0x6C5C (0x6C5C)
	float CommonWeaponCurveValue;  // 0x6C60 (0x6C60)
	float PrimaryWeaponCurveValue;  // 0x6C64 (0x6C64)
	float SecondaryWeaponCurveValue;  // 0x6C68 (0x6C68)
	float IKHandRWeight;  // 0x6C6C (0x6C6C)
	char pad_27760_1 : 7;  // 0x6C70 (0x6C70)
	bool GameplayTag_bIsResting : 1;  // 0x6C70 (0x6C70)
	char pad_27761_1 : 7;  // 0x6C71 (0x6C71)
	bool GameplayTag_bIsFullbodyAnimating : 1;  // 0x6C71 (0x6C71)
	char pad_27762_1 : 7;  // 0x6C72 (0x6C72)
	bool GameplayTag_bIsSkillMontagePlaying : 1;  // 0x6C72 (0x6C72)
	char pad_27763_1 : 7;  // 0x6C73 (0x6C73)
	bool GameplayTag_bIsEmotePlaying : 1;  // 0x6C73 (0x6C73)
	char pad_27764_1 : 7;  // 0x6C74 (0x6C74)
	bool GameplayTag_bIsAttackPrimary : 1;  // 0x6C74 (0x6C74)
	char pad_27765_1 : 7;  // 0x6C75 (0x6C75)
	bool GameplayTag_bIsAttackSecondary : 1;  // 0x6C75 (0x6C75)
	char pad_27766_1 : 7;  // 0x6C76 (0x6C76)
	bool GameplayTag_bIsAttackSpecial : 1;  // 0x6C76 (0x6C76)
	char pad_27767_1 : 7;  // 0x6C77 (0x6C77)
	bool GameplayTag_bIsPlayMusic : 1;  // 0x6C77 (0x6C77)
	char pad_27768_1 : 7;  // 0x6C78 (0x6C78)
	bool GameplayTag_bIsItemConsuming : 1;  // 0x6C78 (0x6C78)
	char pad_27769_1 : 7;  // 0x6C79 (0x6C79)
	bool GameplayTag_bIsInteractInstall : 1;  // 0x6C79 (0x6C79)
	char pad_27770_1 : 7;  // 0x6C7A (0x6C7A)
	bool GameplayTag_bIsItemEquipPrimary : 1;  // 0x6C7A (0x6C7A)
	char pad_27771_1 : 7;  // 0x6C7B (0x6C7B)
	bool GameplayTag_bIsItemEquipSecondary : 1;  // 0x6C7B (0x6C7B)
	char pad_27772_1 : 7;  // 0x6C7C (0x6C7C)
	bool GameplayTag_bIsItemEquipPrimaryTwoHanded : 1;  // 0x6C7C (0x6C7C)
	char pad_27773_1 : 7;  // 0x6C7D (0x6C7D)
	bool GameplayTag_bIsItemEquipSecondaryTwoHanded : 1;  // 0x6C7D (0x6C7D)
	char pad_27774_1 : 7;  // 0x6C7E (0x6C7E)
	bool bIsPrimaryMontagePlaying : 1;  // 0x6C7E (0x6C7E)
	char pad_27775_1 : 7;  // 0x6C7F (0x6C7F)
	bool bIsSecondaryMontagePlaying : 1;  // 0x6C7F (0x6C7F)
	char pad_27776_1 : 7;  // 0x6C80 (0x6C80)
	bool bIsTwoHandedMontagePlaying : 1;  // 0x6C80 (0x6C80)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_PlayerCharacter.ABP_PlayerCharacter_C.AnimGraph
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function ABP_PlayerCharacter.ABP_PlayerCharacter_C.BlueprintThreadSafeUpdateAnimation
	void ExecuteUbergraph_ABP_PlayerCharacter(int32_t EntryPoint); // Function ABP_PlayerCharacter.ABP_PlayerCharacter_C.ExecuteUbergraph_ABP_PlayerCharacter
}; 
 
 


