#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_SkeletonChampion.ABP_SkeletonChampion_C.AnimBlueprintGeneratedMutableData
// Size: 0xC(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool __BoolProperty : 1;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool __BoolProperty_1 : 1;  // 0x2 (0x2)
	char pad_3[1];  // 0x3 (0x3)
	float __FloatProperty_2;  // 0x4 (0x4)
	float __FloatProperty_3;  // 0x8 (0x8)


}; 
 
 // ScriptStruct ABP_SkeletonChampion.ABP_SkeletonChampion_C.AnimBlueprintGeneratedConstantData
// Size: 0x188(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_222;  // 0x4 (0x4)
	struct FName __NameProperty_223;  // 0xC (0xC)
	struct FName __NameProperty_224;  // 0x14 (0x14)
	float __FloatProperty_225;  // 0x1C (0x1C)
	uint8_t __EnumProperty_226;  // 0x20 (0x20)
	char pad_33[3];  // 0x21 (0x21)
	struct FName __NameProperty_227;  // 0x24 (0x24)
	char pad_44[4];  // 0x2C (0x2C)
	struct UBlendProfile* __BlendProfile_228;  // 0x30 (0x30)
	struct UCurveFloat* __CurveFloat_229;  // 0x38 (0x38)
	uint8_t __EnumProperty_230;  // 0x40 (0x40)
	uint8_t __EnumProperty_231;  // 0x41 (0x41)
	char pad_66[6];  // 0x42 (0x42)
	struct TArray<float> __ArrayProperty_232;  // 0x48 (0x48)
	struct FName __NameProperty_233;  // 0x58 (0x58)
	struct FName __NameProperty_234;  // 0x60 (0x60)
	struct FName __NameProperty_235;  // 0x68 (0x68)
	int32_t __IntProperty_236;  // 0x70 (0x70)
	struct FInputScaleBiasClampConstants __StructProperty_237;  // 0x74 (0x74)
	struct FName __NameProperty_238;  // 0xA0 (0xA0)
	int32_t __IntProperty_239;  // 0xA8 (0xA8)
	char pad_172_1 : 7;  // 0xAC (0xAC)
	bool __BoolProperty_240 : 1;  // 0xAC (0xAC)
	char pad_173[3];  // 0xAD (0xAD)
	float __FloatProperty_241;  // 0xB0 (0xB0)
	float __FloatProperty_242;  // 0xB4 (0xB4)
	char pad_184_1 : 7;  // 0xB8 (0xB8)
	bool __BoolProperty_243 : 1;  // 0xB8 (0xB8)
	uint8_t __EnumProperty_244;  // 0xB9 (0xB9)
	enum class EAnimGroupRole __ByteProperty_245;  // 0xBA (0xBA)
	char pad_187[1];  // 0xBB (0xBB)
	struct FName __NameProperty_246;  // 0xBC (0xBC)
	struct FName __NameProperty_247;  // 0xC4 (0xC4)
	int32_t __IntProperty_248;  // 0xCC (0xCC)
	struct FAnimNodeFunctionRef __StructProperty_249;  // 0xD0 (0xD0)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xF0 (0xF0)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x170 (0x170)


}; 
 
 // Function ABP_SkeletonChampion.ABP_SkeletonChampion_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_SkeletonChampion.ABP_SkeletonChampion_C.ExecuteUbergraph_ABP_SkeletonChampion
struct FExecuteUbergraph_ABP_SkeletonChampion
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 