#pragma once 
#include <ABP_DeathSkull_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_DeathSkull.ABP_DeathSkull_C
// Size: 0xFE0(Inherited: 0x510)
struct UABP_DeathSkull_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x520 (0x520)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x528 (0x528)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x530 (0x530)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x550 (0x550)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x578 (0x578)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x5A0 (0x5A0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x5E8 (0x5E8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x608 (0x608)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x678 (0x678)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x698 (0x698)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x760 (0x760)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x7A8 (0x7A8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x8B0 (0x8B0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x8D8 (0x8D8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x900 (0x900)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x928 (0x928)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x950 (0x950)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x978 (0x978)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x9A0 (0x9A0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0x9C8 (0x9C8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x9F0 (0x9F0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0xA10 (0xA10)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0xA58 (0xA58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0xA80 (0xA80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0xAA8 (0xAA8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0xB70 (0xB70)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0xC50 (0xC50)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0xC70 (0xC70)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0xCB8 (0xCB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0xCE0 (0xCE0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0xD08 (0xD08)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0xDD0 (0xDD0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0xEB0 (0xEB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0xED0 (0xED0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0xEF8 (0xEF8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0xF18 (0xF18)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_DeathSkull.ABP_DeathSkull_C.AnimGraph
	void ExecuteUbergraph_ABP_DeathSkull(int32_t EntryPoint); // Function ABP_DeathSkull.ABP_DeathSkull_C.ExecuteUbergraph_ABP_DeathSkull
}; 
 
 


