#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_UndeadKnight.ABP_UndeadKnight_C.AnimBlueprintGeneratedMutableData
// Size: 0xC(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool __BoolProperty : 1;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool __BoolProperty_1 : 1;  // 0x2 (0x2)
	char pad_3[1];  // 0x3 (0x3)
	float __FloatProperty_2;  // 0x4 (0x4)
	float __FloatProperty_3;  // 0x8 (0x8)


}; 
 
 // ScriptStruct ABP_UndeadKnight.ABP_UndeadKnight_C.AnimBlueprintGeneratedConstantData
// Size: 0x180(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_193;  // 0x4 (0x4)
	struct FName __NameProperty_194;  // 0xC (0xC)
	struct FName __NameProperty_195;  // 0x14 (0x14)
	int32_t __IntProperty_196;  // 0x1C (0x1C)
	uint8_t __EnumProperty_197;  // 0x20 (0x20)
	char pad_33[3];  // 0x21 (0x21)
	struct FName __NameProperty_198;  // 0x24 (0x24)
	char pad_44[4];  // 0x2C (0x2C)
	struct UBlendProfile* __BlendProfile_199;  // 0x30 (0x30)
	struct UCurveFloat* __CurveFloat_200;  // 0x38 (0x38)
	uint8_t __EnumProperty_201;  // 0x40 (0x40)
	uint8_t __EnumProperty_202;  // 0x41 (0x41)
	char pad_66[6];  // 0x42 (0x42)
	struct TArray<float> __ArrayProperty_203;  // 0x48 (0x48)
	struct FName __NameProperty_204;  // 0x58 (0x58)
	struct FName __NameProperty_205;  // 0x60 (0x60)
	struct FInputScaleBiasClampConstants __StructProperty_206;  // 0x68 (0x68)
	struct FName __NameProperty_207;  // 0x94 (0x94)
	int32_t __IntProperty_208;  // 0x9C (0x9C)
	float __FloatProperty_209;  // 0xA0 (0xA0)
	char pad_164_1 : 7;  // 0xA4 (0xA4)
	bool __BoolProperty_210 : 1;  // 0xA4 (0xA4)
	char pad_165[3];  // 0xA5 (0xA5)
	float __FloatProperty_211;  // 0xA8 (0xA8)
	char pad_172_1 : 7;  // 0xAC (0xAC)
	bool __BoolProperty_212 : 1;  // 0xAC (0xAC)
	uint8_t __EnumProperty_213;  // 0xAD (0xAD)
	enum class EAnimGroupRole __ByteProperty_214;  // 0xAE (0xAE)
	char pad_175[1];  // 0xAF (0xAF)
	struct FName __NameProperty_215;  // 0xB0 (0xB0)
	struct FName __NameProperty_216;  // 0xB8 (0xB8)
	int32_t __IntProperty_217;  // 0xC0 (0xC0)
	char pad_196[4];  // 0xC4 (0xC4)
	struct FAnimNodeFunctionRef __StructProperty_218;  // 0xC8 (0xC8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xE8 (0xE8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x168 (0x168)


}; 
 
 // Function ABP_UndeadKnight.ABP_UndeadKnight_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_UndeadKnight.ABP_UndeadKnight_C.ExecuteUbergraph_ABP_UndeadKnight
struct FExecuteUbergraph_ABP_UndeadKnight
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 