#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_SkullKey.ABP_SkullKey_C.AnimBlueprintGeneratedConstantData
// Size: 0x108(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_17;  // 0x4 (0x4)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool __BoolProperty_18 : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)
	float __FloatProperty_19;  // 0x10 (0x10)
	struct FInputScaleBiasClampConstants __StructProperty_20;  // 0x14 (0x14)
	float __FloatProperty_21;  // 0x40 (0x40)
	char pad_68_1 : 7;  // 0x44 (0x44)
	bool __BoolProperty_22 : 1;  // 0x44 (0x44)
	uint8_t __EnumProperty_23;  // 0x45 (0x45)
	enum class EAnimGroupRole __ByteProperty_24;  // 0x46 (0x46)
	char pad_71[1];  // 0x47 (0x47)
	struct FName __NameProperty_25;  // 0x48 (0x48)
	struct FAnimNodeFunctionRef __StructProperty_26;  // 0x50 (0x50)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0x70 (0x70)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0xF0 (0xF0)


}; 
 
 // Function ABP_SkullKey.ABP_SkullKey_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_SkullKey.ABP_SkullKey_C.ExecuteUbergraph_ABP_SkullKey
struct FExecuteUbergraph_ABP_SkullKey
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 