#pragma once 
#include <ABP_DemonBerserker_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_DemonBerserker.ABP_DemonBerserker_C
// Size: 0x2538(Inherited: 0x510)
struct UABP_DemonBerserker_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	char pad_1316[4];  // 0x524 (0x524)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x528 (0x528)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x530 (0x530)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x538 (0x538)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x558 (0x558)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x5A0 (0x5A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x5C8 (0x5C8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x5F0 (0x5F0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x638 (0x638)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;  // 0x658 (0x658)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;  // 0x678 (0x678)
	char pad_1688[8];  // 0x698 (0x698)
	struct FAnimNode_LookAt AnimGraphNode_LookAt;  // 0x6A0 (0x6A0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x8F0 (0x8F0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x960 (0x960)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x980 (0x980)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0xA48 (0xA48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0xB50 (0xB50)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0xB78 (0xB78)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0xBA0 (0xBA0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0xBC8 (0xBC8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0xBF0 (0xBF0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0xC18 (0xC18)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0xC40 (0xC40)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;  // 0xC68 (0xC68)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0xC90 (0xC90)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0xCB0 (0xCB0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0xCF8 (0xCF8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;  // 0xD40 (0xD40)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0xD68 (0xD68)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0xD90 (0xD90)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;  // 0xDB8 (0xDB8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;  // 0xE80 (0xE80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0xF48 (0xF48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0xF90 (0xF90)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x1070 (0x1070)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x1090 (0x1090)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x10D8 (0x10D8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0x1120 (0x1120)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x1148 (0x1148)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x1170 (0x1170)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0x1198 (0x1198)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0x1260 (0x1260)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x1328 (0x1328)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0x1370 (0x1370)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x1450 (0x1450)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x1470 (0x1470)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x1498 (0x1498)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x14B8 (0x14B8)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3;  // 0x1580 (0x1580)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;  // 0x1AA0 (0x1AA0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;  // 0x1AC0 (0x1AC0)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2;  // 0x1AE0 (0x1AE0)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics;  // 0x2000 (0x2000)
	struct FVector Look At Pos;  // 0x2520 (0x2520)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_DemonBerserker.ABP_DemonBerserker_C.AnimGraph
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_DemonBerserker.ABP_DemonBerserker_C.BlueprintUpdateAnimation
	void ExecuteUbergraph_ABP_DemonBerserker(int32_t EntryPoint); // Function ABP_DemonBerserker.ABP_DemonBerserker_C.ExecuteUbergraph_ABP_DemonBerserker
}; 
 
 


