#pragma once 
#include <ABP_ReinforcedDungeonDoor_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_ReinforcedDungeonDoor.ABP_ReinforcedDungeonDoor_C
// Size: 0x7C0(Inherited: 0x450)
struct UABP_ReinforcedDungeonDoor_C : UDCAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x450 (0x450)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x458 (0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x460 (0x460)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x468 (0x468)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x488 (0x488)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x4D0 (0x4D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x4F8 (0x4F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x520 (0x520)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x548 (0x548)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x570 (0x570)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x598 (0x598)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x5C0 (0x5C0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x608 (0x608)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x628 (0x628)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x670 (0x670)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x690 (0x690)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x6D8 (0x6D8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x6F8 (0x6F8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_ReinforcedDungeonDoor.ABP_ReinforcedDungeonDoor_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_87D1484B433EF6AEB1C39FB00473E059(); // Function ABP_ReinforcedDungeonDoor.ABP_ReinforcedDungeonDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_87D1484B433EF6AEB1C39FB00473E059
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_326775754DB25C2C4ADA9EA434D03015(); // Function ABP_ReinforcedDungeonDoor.ABP_ReinforcedDungeonDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_326775754DB25C2C4ADA9EA434D03015
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_AD9170F144D16F5ACE0E6EA3CD5CD37F(); // Function ABP_ReinforcedDungeonDoor.ABP_ReinforcedDungeonDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_AD9170F144D16F5ACE0E6EA3CD5CD37F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_8E47BD554F0C039448E2088864342B67(); // Function ABP_ReinforcedDungeonDoor.ABP_ReinforcedDungeonDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_8E47BD554F0C039448E2088864342B67
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_EDAC9D5649475C1DB56A019011411AC5(); // Function ABP_ReinforcedDungeonDoor.ABP_ReinforcedDungeonDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_EDAC9D5649475C1DB56A019011411AC5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_1D9977D044412A7894415EB479776B32(); // Function ABP_ReinforcedDungeonDoor.ABP_ReinforcedDungeonDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ReinforcedDungeonDoor_AnimGraphNode_TransitionResult_1D9977D044412A7894415EB479776B32
	void ExecuteUbergraph_ABP_ReinforcedDungeonDoor(int32_t EntryPoint); // Function ABP_ReinforcedDungeonDoor.ABP_ReinforcedDungeonDoor_C.ExecuteUbergraph_ABP_ReinforcedDungeonDoor
}; 
 
 


