#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_GiantBat.ABP_GiantBat_C.AnimBlueprintGeneratedMutableData
// Size: 0x8(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)


}; 
 
 // ScriptStruct ABP_GiantBat.ABP_GiantBat_C.AnimBlueprintGeneratedConstantData
// Size: 0x168(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_150;  // 0x4 (0x4)
	struct FName __NameProperty_151;  // 0xC (0xC)
	int32_t __IntProperty_152;  // 0x14 (0x14)
	struct FName __NameProperty_153;  // 0x18 (0x18)
	struct FName __NameProperty_154;  // 0x20 (0x20)
	uint8_t __EnumProperty_155;  // 0x28 (0x28)
	char pad_41[3];  // 0x29 (0x29)
	struct FName __NameProperty_156;  // 0x2C (0x2C)
	struct FName __NameProperty_157;  // 0x34 (0x34)
	struct FName __NameProperty_158;  // 0x3C (0x3C)
	struct FName __NameProperty_159;  // 0x44 (0x44)
	int32_t __IntProperty_160;  // 0x4C (0x4C)
	struct FInputScaleBiasClampConstants __StructProperty_161;  // 0x50 (0x50)
	struct FName __NameProperty_162;  // 0x7C (0x7C)
	int32_t __IntProperty_163;  // 0x84 (0x84)
	char pad_136_1 : 7;  // 0x88 (0x88)
	bool __BoolProperty_164 : 1;  // 0x88 (0x88)
	char pad_137[3];  // 0x89 (0x89)
	float __FloatProperty_165;  // 0x8C (0x8C)
	float __FloatProperty_166;  // 0x90 (0x90)
	char pad_148_1 : 7;  // 0x94 (0x94)
	bool __BoolProperty_167 : 1;  // 0x94 (0x94)
	uint8_t __EnumProperty_168;  // 0x95 (0x95)
	enum class EAnimGroupRole __ByteProperty_169;  // 0x96 (0x96)
	char pad_151[1];  // 0x97 (0x97)
	struct FName __NameProperty_170;  // 0x98 (0x98)
	struct FName __NameProperty_171;  // 0xA0 (0xA0)
	int32_t __IntProperty_172;  // 0xA8 (0xA8)
	char pad_172[4];  // 0xAC (0xAC)
	struct FAnimNodeFunctionRef __StructProperty_173;  // 0xB0 (0xB0)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xD0 (0xD0)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x150 (0x150)


}; 
 
 // Function ABP_GiantBat.ABP_GiantBat_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_GiantBat.ABP_GiantBat_C.ExecuteUbergraph_ABP_GiantBat
struct FExecuteUbergraph_ABP_GiantBat
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 