#pragma once 
#include <ABP_GiantBat_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_GiantBat.ABP_GiantBat_C
// Size: 0xEB8(Inherited: 0x510)
struct UABP_GiantBat_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x520 (0x520)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x528 (0x528)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x530 (0x530)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;  // 0x550 (0x550)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;  // 0x578 (0x578)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x5A0 (0x5A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x5C8 (0x5C8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x5F0 (0x5F0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x618 (0x618)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x640 (0x640)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0x668 (0x668)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0x690 (0x690)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0x6B0 (0x6B0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x6F8 (0x6F8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0x720 (0x720)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x800 (0x800)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x820 (0x820)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x868 (0x868)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0x890 (0x890)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x970 (0x970)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x990 (0x990)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x9B8 (0x9B8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x9D8 (0x9D8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0xAA0 (0xAA0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0xAC8 (0xAC8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0xAF0 (0xAF0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0xB18 (0xB18)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0xB40 (0xB40)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0xB88 (0xB88)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0xBA8 (0xBA8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0xBF0 (0xBF0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0xC10 (0xC10)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0xC80 (0xC80)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0xCA0 (0xCA0)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0xD68 (0xD68)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0xDB0 (0xDB0)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_GiantBat.ABP_GiantBat_C.AnimGraph
	void ExecuteUbergraph_ABP_GiantBat(int32_t EntryPoint); // Function ABP_GiantBat.ABP_GiantBat_C.ExecuteUbergraph_ABP_GiantBat
}; 
 
 


