#pragma once 
#include <ABP_Zombie_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_Zombie.ABP_Zombie_C
// Size: 0x1840(Inherited: 0x510)
struct UABP_Zombie_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	char pad_1316[4];  // 0x524 (0x524)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x528 (0x528)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x530 (0x530)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x538 (0x538)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x558 (0x558)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x580 (0x580)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x5A8 (0x5A8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x5F0 (0x5F0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;  // 0x610 (0x610)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;  // 0x630 (0x630)
	struct FAnimNode_LookAt AnimGraphNode_LookAt;  // 0x650 (0x650)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x8A0 (0x8A0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x910 (0x910)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x930 (0x930)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x9F8 (0x9F8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0xA40 (0xA40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0xB48 (0xB48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0xB70 (0xB70)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0xB98 (0xB98)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0xBC0 (0xBC0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0xBE8 (0xBE8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0xC10 (0xC10)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0xC38 (0xC38)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;  // 0xC60 (0xC60)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0xC88 (0xC88)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0xCA8 (0xCA8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0xCF0 (0xCF0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;  // 0xD38 (0xD38)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0xD60 (0xD60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0xD88 (0xD88)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;  // 0xDB0 (0xDB0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;  // 0xE78 (0xE78)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;  // 0xF40 (0xF40)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;  // 0xF60 (0xF60)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2;  // 0xF80 (0xF80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0x1078 (0x1078)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0x10C0 (0x10C0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x11A0 (0x11A0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x11C0 (0x11C0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x1208 (0x1208)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0x1250 (0x1250)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x1278 (0x1278)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x12A0 (0x12A0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0x12C8 (0x12C8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0x1390 (0x1390)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;  // 0x1458 (0x1458)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;  // 0x1478 (0x1478)
	struct FAnimNode_LegIK AnimGraphNode_LegIK;  // 0x1498 (0x1498)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x1590 (0x1590)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0x15D8 (0x15D8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x16B8 (0x16B8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x16D8 (0x16D8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x1700 (0x1700)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x1720 (0x1720)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;  // 0x17E8 (0x17E8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;  // 0x1808 (0x1808)
	struct FVector Look At Pos;  // 0x1828 (0x1828)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Zombie.ABP_Zombie_C.AnimGraph
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Zombie.ABP_Zombie_C.BlueprintUpdateAnimation
	void ExecuteUbergraph_ABP_Zombie(int32_t EntryPoint); // Function ABP_Zombie.ABP_Zombie_C.ExecuteUbergraph_ABP_Zombie
}; 
 
 


