#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_DeathBeetle.ABP_DeathBeetle_C.AnimBlueprintGeneratedMutableData
// Size: 0xD(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	float __FloatProperty_1;  // 0x8 (0x8)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool __BoolProperty_2 : 1;  // 0xC (0xC)


}; 
 
 // ScriptStruct ABP_DeathBeetle.ABP_DeathBeetle_C.AnimBlueprintGeneratedConstantData
// Size: 0x170(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_159;  // 0x4 (0x4)
	struct FName __NameProperty_160;  // 0xC (0xC)
	int32_t __IntProperty_161;  // 0x14 (0x14)
	struct FName __NameProperty_162;  // 0x18 (0x18)
	int32_t __IntProperty_163;  // 0x20 (0x20)
	struct FName __NameProperty_164;  // 0x24 (0x24)
	struct FName __NameProperty_165;  // 0x2C (0x2C)
	struct FInputScaleBiasClampConstants __StructProperty_166;  // 0x34 (0x34)
	struct FName __NameProperty_167;  // 0x60 (0x60)
	int32_t __IntProperty_168;  // 0x68 (0x68)
	float __FloatProperty_169;  // 0x6C (0x6C)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool __BoolProperty_170 : 1;  // 0x70 (0x70)
	char pad_113[3];  // 0x71 (0x71)
	float __FloatProperty_171;  // 0x74 (0x74)
	uint8_t __EnumProperty_172;  // 0x78 (0x78)
	enum class EAnimGroupRole __ByteProperty_173;  // 0x79 (0x79)
	char pad_122[2];  // 0x7A (0x7A)
	struct FName __NameProperty_174;  // 0x7C (0x7C)
	struct FName __NameProperty_175;  // 0x84 (0x84)
	int32_t __IntProperty_176;  // 0x8C (0x8C)
	struct FAnimNodeFunctionRef __StructProperty_177;  // 0x90 (0x90)
	struct UBlendProfile* __BlendProfile_178;  // 0xB0 (0xB0)
	struct UCurveFloat* __CurveFloat_179;  // 0xB8 (0xB8)
	char pad_192_1 : 7;  // 0xC0 (0xC0)
	bool __BoolProperty_180 : 1;  // 0xC0 (0xC0)
	uint8_t __EnumProperty_181;  // 0xC1 (0xC1)
	uint8_t __EnumProperty_182;  // 0xC2 (0xC2)
	char pad_195[5];  // 0xC3 (0xC3)
	struct TArray<float> __ArrayProperty_183;  // 0xC8 (0xC8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xD8 (0xD8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x158 (0x158)


}; 
 
 // Function ABP_DeathBeetle.ABP_DeathBeetle_C.ExecuteUbergraph_ABP_DeathBeetle
struct FExecuteUbergraph_ABP_DeathBeetle
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 // Function ABP_DeathBeetle.ABP_DeathBeetle_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 