#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_GoblinArcher.ABP_GoblinArcher_C.AnimBlueprintGeneratedMutableData
// Size: 0xA(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool __BoolProperty_1 : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool __BoolProperty_2 : 1;  // 0x9 (0x9)


}; 
 
 // ScriptStruct ABP_GoblinArcher.ABP_GoblinArcher_C.AnimBlueprintGeneratedConstantData
// Size: 0x180(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_193;  // 0x4 (0x4)
	struct FName __NameProperty_194;  // 0xC (0xC)
	uint8_t __EnumProperty_195;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	struct FName __NameProperty_196;  // 0x18 (0x18)
	struct FName __NameProperty_197;  // 0x20 (0x20)
	struct FName __NameProperty_198;  // 0x28 (0x28)
	int32_t __IntProperty_199;  // 0x30 (0x30)
	char pad_52_1 : 7;  // 0x34 (0x34)
	bool __BoolProperty_200 : 1;  // 0x34 (0x34)
	char pad_53[3];  // 0x35 (0x35)
	float __FloatProperty_201;  // 0x38 (0x38)
	struct FInputScaleBiasClampConstants __StructProperty_202;  // 0x3C (0x3C)
	float __FloatProperty_203;  // 0x68 (0x68)
	float __FloatProperty_204;  // 0x6C (0x6C)
	uint8_t __EnumProperty_205;  // 0x70 (0x70)
	enum class EAnimGroupRole __ByteProperty_206;  // 0x71 (0x71)
	char pad_114[2];  // 0x72 (0x72)
	struct FName __NameProperty_207;  // 0x74 (0x74)
	char pad_124[4];  // 0x7C (0x7C)
	struct UBlendProfile* __BlendProfile_208;  // 0x80 (0x80)
	struct UCurveFloat* __CurveFloat_209;  // 0x88 (0x88)
	char pad_144_1 : 7;  // 0x90 (0x90)
	bool __BoolProperty_210 : 1;  // 0x90 (0x90)
	uint8_t __EnumProperty_211;  // 0x91 (0x91)
	uint8_t __EnumProperty_212;  // 0x92 (0x92)
	char pad_147[5];  // 0x93 (0x93)
	struct TArray<float> __ArrayProperty_213;  // 0x98 (0x98)
	struct FName __NameProperty_214;  // 0xA8 (0xA8)
	int32_t __IntProperty_215;  // 0xB0 (0xB0)
	struct FName __NameProperty_216;  // 0xB4 (0xB4)
	struct FName __NameProperty_217;  // 0xBC (0xBC)
	int32_t __IntProperty_218;  // 0xC4 (0xC4)
	struct FAnimNodeFunctionRef __StructProperty_219;  // 0xC8 (0xC8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xE8 (0xE8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x168 (0x168)


}; 
 
 // Function ABP_GoblinArcher.ABP_GoblinArcher_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_GoblinArcher.ABP_GoblinArcher_C.ExecuteUbergraph_ABP_GoblinArcher
struct FExecuteUbergraph_ABP_GoblinArcher
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 