#pragma once 
#include <ABP_Mummy_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_Mummy.ABP_Mummy_C
// Size: 0x1918(Inherited: 0x510)
struct UABP_Mummy_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x528 (0x528)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x530 (0x530)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x538 (0x538)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x558 (0x558)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;  // 0x5A0 (0x5A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;  // 0x5C8 (0x5C8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x5F0 (0x5F0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x618 (0x618)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0x640 (0x640)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0x688 (0x688)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x6A8 (0x6A8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x6F0 (0x6F0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;  // 0x710 (0x710)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;  // 0x730 (0x730)
	struct FAnimNode_LookAt AnimGraphNode_LookAt;  // 0x750 (0x750)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x9A0 (0x9A0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0xA10 (0xA10)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0xA30 (0xA30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0xAF8 (0xAF8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0xB20 (0xB20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0xB48 (0xB48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0xB70 (0xB70)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0xB98 (0xB98)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0xBC0 (0xBC0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0xBE8 (0xBE8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;  // 0xC10 (0xC10)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0xC38 (0xC38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0xC58 (0xC58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;  // 0xCA0 (0xCA0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0xCC8 (0xCC8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;  // 0xCF0 (0xCF0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;  // 0xDB8 (0xDB8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;  // 0xE80 (0xE80)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;  // 0xEA0 (0xEA0)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2;  // 0xEC0 (0xEC0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0xFB8 (0xFB8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0x1000 (0x1000)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x10E0 (0x10E0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0x1128 (0x1128)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x1150 (0x1150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x1170 (0x1170)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0x11B8 (0x11B8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x11E0 (0x11E0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0x1208 (0x1208)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0x12D0 (0x12D0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;  // 0x1398 (0x1398)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;  // 0x13B8 (0x13B8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK;  // 0x13D8 (0x13D8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x14D0 (0x14D0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0x1518 (0x1518)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x15F8 (0x15F8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x1640 (0x1640)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x1668 (0x1668)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x1688 (0x1688)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x16B0 (0x16B0)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x16D0 (0x16D0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x1798 (0x1798)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;  // 0x18A0 (0x18A0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;  // 0x18C0 (0x18C0)
	double Random Min;  // 0x18E0 (0x18E0)
	double Random Max;  // 0x18E8 (0x18E8)
	double Random Result;  // 0x18F0 (0x18F0)
	char pad_6392_1 : 7;  // 0x18F8 (0x18F8)
	bool UnderGround? : 1;  // 0x18F8 (0x18F8)
	char pad_6393[7];  // 0x18F9 (0x18F9)
	struct FVector Look At Pos;  // 0x1900 (0x1900)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Mummy.ABP_Mummy_C.AnimGraph
	void BlueprintInitializeAnimation(); // Function ABP_Mummy.ABP_Mummy_C.BlueprintInitializeAnimation
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_Mummy.ABP_Mummy_C.BlueprintUpdateAnimation
	void ExecuteUbergraph_ABP_Mummy(int32_t EntryPoint); // Function ABP_Mummy.ABP_Mummy_C.ExecuteUbergraph_ABP_Mummy
}; 
 
 


