#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_FloorSpikes.ABP_FloorSpikes_C.AnimBlueprintGeneratedConstantData
// Size: 0x130(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_70;  // 0x4 (0x4)
	struct FName __NameProperty_71;  // 0xC (0xC)
	int32_t __IntProperty_72;  // 0x14 (0x14)
	struct FName __NameProperty_73;  // 0x18 (0x18)
	int32_t __IntProperty_74;  // 0x20 (0x20)
	char pad_36_1 : 7;  // 0x24 (0x24)
	bool __BoolProperty_75 : 1;  // 0x24 (0x24)
	char pad_37[3];  // 0x25 (0x25)
	float __FloatProperty_76;  // 0x28 (0x28)
	struct FInputScaleBiasClampConstants __StructProperty_77;  // 0x2C (0x2C)
	float __FloatProperty_78;  // 0x58 (0x58)
	char pad_92_1 : 7;  // 0x5C (0x5C)
	bool __BoolProperty_79 : 1;  // 0x5C (0x5C)
	uint8_t __EnumProperty_80;  // 0x5D (0x5D)
	enum class EAnimGroupRole __ByteProperty_81;  // 0x5E (0x5E)
	char pad_95[1];  // 0x5F (0x5F)
	struct FName __NameProperty_82;  // 0x60 (0x60)
	struct FName __NameProperty_83;  // 0x68 (0x68)
	int32_t __IntProperty_84;  // 0x70 (0x70)
	char pad_116[4];  // 0x74 (0x74)
	struct FAnimNodeFunctionRef __StructProperty_85;  // 0x78 (0x78)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0x98 (0x98)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x118 (0x118)


}; 
 
 // Function ABP_FloorSpikes.ABP_FloorSpikes_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_FloorSpikes.ABP_FloorSpikes_C.ExecuteUbergraph_ABP_FloorSpikes
struct FExecuteUbergraph_ABP_FloorSpikes
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_EqualEqual_GameplayTag_ReturnValue : 1;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool CallFunc_EqualEqual_GameplayTag_ReturnValue_2 : 1;  // 0x5 (0x5)
	char pad_6_1 : 7;  // 0x6 (0x6)
	bool CallFunc_EqualEqual_GameplayTag_ReturnValue_3 : 1;  // 0x6 (0x6)
	char pad_7_1 : 7;  // 0x7 (0x7)
	bool CallFunc_EqualEqual_GameplayTag_ReturnValue_4 : 1;  // 0x7 (0x7)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool CallFunc_EqualEqual_GameplayTag_ReturnValue_5 : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool CallFunc_EqualEqual_GameplayTag_ReturnValue_6 : 1;  // 0x9 (0x9)


}; 
 
 