#pragma once 
#include <ABP_DoubleDoor_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_DoubleDoor.ABP_DoubleDoor_C
// Size: 0x7C0(Inherited: 0x450)
struct UABP_DoubleDoor_C : UDCAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x450 (0x450)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x458 (0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x460 (0x460)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x468 (0x468)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x488 (0x488)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x4D0 (0x4D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x4F8 (0x4F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x520 (0x520)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x548 (0x548)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x570 (0x570)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x598 (0x598)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x5C0 (0x5C0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x608 (0x608)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x628 (0x628)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x670 (0x670)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x690 (0x690)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x6D8 (0x6D8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x6F8 (0x6F8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_DoubleDoor.ABP_DoubleDoor_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_EEA0186445869486574BBDBB9E0810BE(); // Function ABP_DoubleDoor.ABP_DoubleDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_EEA0186445869486574BBDBB9E0810BE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_62747A01482440EC3BEB5BAE56FA326C(); // Function ABP_DoubleDoor.ABP_DoubleDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_62747A01482440EC3BEB5BAE56FA326C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_2EBCE2134E9BE3D0633330BD555DD487(); // Function ABP_DoubleDoor.ABP_DoubleDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_2EBCE2134E9BE3D0633330BD555DD487
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_7C87B75A4A11BD616E65E0BA24808EA6(); // Function ABP_DoubleDoor.ABP_DoubleDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_7C87B75A4A11BD616E65E0BA24808EA6
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_B994CCE3451DAF8E833F87B2D1381AD3(); // Function ABP_DoubleDoor.ABP_DoubleDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_B994CCE3451DAF8E833F87B2D1381AD3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_159831CF4EC66FD517AEE48640530A52(); // Function ABP_DoubleDoor.ABP_DoubleDoor_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_DoubleDoor_AnimGraphNode_TransitionResult_159831CF4EC66FD517AEE48640530A52
	void ExecuteUbergraph_ABP_DoubleDoor(int32_t EntryPoint); // Function ABP_DoubleDoor.ABP_DoubleDoor_C.ExecuteUbergraph_ABP_DoubleDoor
}; 
 
 


