#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_GhostKing.ABP_GhostKing_C.AnimBlueprintGeneratedMutableData
// Size: 0xE(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	float __FloatProperty_1;  // 0x8 (0x8)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool __BoolProperty_2 : 1;  // 0xC (0xC)
	char pad_13_1 : 7;  // 0xD (0xD)
	bool __BoolProperty_3 : 1;  // 0xD (0xD)


}; 
 
 // ScriptStruct ABP_GhostKing.ABP_GhostKing_C.AnimBlueprintGeneratedConstantData
// Size: 0x180(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_202;  // 0x4 (0x4)
	struct FName __NameProperty_203;  // 0xC (0xC)
	struct FName __NameProperty_204;  // 0x14 (0x14)
	uint8_t __EnumProperty_205;  // 0x1C (0x1C)
	char pad_29[3];  // 0x1D (0x1D)
	struct FName __NameProperty_206;  // 0x20 (0x20)
	struct FName __NameProperty_207;  // 0x28 (0x28)
	struct FName __NameProperty_208;  // 0x30 (0x30)
	int32_t __IntProperty_209;  // 0x38 (0x38)
	char pad_60_1 : 7;  // 0x3C (0x3C)
	bool __BoolProperty_210 : 1;  // 0x3C (0x3C)
	char pad_61[3];  // 0x3D (0x3D)
	float __FloatProperty_211;  // 0x40 (0x40)
	struct FInputScaleBiasClampConstants __StructProperty_212;  // 0x44 (0x44)
	float __FloatProperty_213;  // 0x70 (0x70)
	uint8_t __EnumProperty_214;  // 0x74 (0x74)
	enum class EAnimGroupRole __ByteProperty_215;  // 0x75 (0x75)
	char pad_118[2];  // 0x76 (0x76)
	struct FName __NameProperty_216;  // 0x78 (0x78)
	struct UBlendProfile* __BlendProfile_217;  // 0x80 (0x80)
	struct UCurveFloat* __CurveFloat_218;  // 0x88 (0x88)
	char pad_144_1 : 7;  // 0x90 (0x90)
	bool __BoolProperty_219 : 1;  // 0x90 (0x90)
	uint8_t __EnumProperty_220;  // 0x91 (0x91)
	uint8_t __EnumProperty_221;  // 0x92 (0x92)
	char pad_147[5];  // 0x93 (0x93)
	struct TArray<float> __ArrayProperty_222;  // 0x98 (0x98)
	struct FName __NameProperty_223;  // 0xA8 (0xA8)
	int32_t __IntProperty_224;  // 0xB0 (0xB0)
	struct FName __NameProperty_225;  // 0xB4 (0xB4)
	struct FName __NameProperty_226;  // 0xBC (0xBC)
	int32_t __IntProperty_227;  // 0xC4 (0xC4)
	struct FAnimNodeFunctionRef __StructProperty_228;  // 0xC8 (0xC8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xE8 (0xE8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x168 (0x168)


}; 
 
 // Function ABP_GhostKing.ABP_GhostKing_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_GhostKing.ABP_GhostKing_C.ExecuteUbergraph_ABP_GhostKing
struct FExecuteUbergraph_ABP_GhostKing
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 