#pragma once 
#include <ABP_FloorSpikes_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_FloorSpikes.ABP_FloorSpikes_C
// Size: 0x7C0(Inherited: 0x450)
struct UABP_FloorSpikes_C : UDCAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x450 (0x450)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x458 (0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x460 (0x460)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x468 (0x468)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x488 (0x488)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x4D0 (0x4D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x4F8 (0x4F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x520 (0x520)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x548 (0x548)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x570 (0x570)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x598 (0x598)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x5C0 (0x5C0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x608 (0x608)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x628 (0x628)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x670 (0x670)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x690 (0x690)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x6D8 (0x6D8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x6F8 (0x6F8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_FloorSpikes.ABP_FloorSpikes_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_6E534B9B42DB231A7860FA88E2DCA2C2(); // Function ABP_FloorSpikes.ABP_FloorSpikes_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_6E534B9B42DB231A7860FA88E2DCA2C2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_668D26654729D8FC280831B52B49F1A3(); // Function ABP_FloorSpikes.ABP_FloorSpikes_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_668D26654729D8FC280831B52B49F1A3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_40CCA99C41C801DF53B96A8052AA0F69(); // Function ABP_FloorSpikes.ABP_FloorSpikes_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_40CCA99C41C801DF53B96A8052AA0F69
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_8F81F4824186EB30FA134BA48F0DEE8F(); // Function ABP_FloorSpikes.ABP_FloorSpikes_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_8F81F4824186EB30FA134BA48F0DEE8F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_A1851C7C435C041D20F93FB383B61348(); // Function ABP_FloorSpikes.ABP_FloorSpikes_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_A1851C7C435C041D20F93FB383B61348
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_C5C15C55481625C9E49649A2FDCAAF66(); // Function ABP_FloorSpikes.ABP_FloorSpikes_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorSpikes_AnimGraphNode_TransitionResult_C5C15C55481625C9E49649A2FDCAAF66
	void ExecuteUbergraph_ABP_FloorSpikes(int32_t EntryPoint); // Function ABP_FloorSpikes.ABP_FloorSpikes_C.ExecuteUbergraph_ABP_FloorSpikes
}; 
 
 


