#pragma once 
#include <ABP_HuntingTrap_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_HuntingTrap.ABP_HuntingTrap_C
// Size: 0x7C0(Inherited: 0x450)
struct UABP_HuntingTrap_C : UDCAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x450 (0x450)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x458 (0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x460 (0x460)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x468 (0x468)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x488 (0x488)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x4D0 (0x4D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x4F8 (0x4F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x520 (0x520)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x548 (0x548)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x570 (0x570)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x598 (0x598)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x5C0 (0x5C0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x608 (0x608)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x628 (0x628)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x670 (0x670)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x690 (0x690)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x6D8 (0x6D8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x6F8 (0x6F8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_HuntingTrap.ABP_HuntingTrap_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_17AB5D2940A3D2668433FABC0B975826(); // Function ABP_HuntingTrap.ABP_HuntingTrap_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_17AB5D2940A3D2668433FABC0B975826
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_E92F21CD4F8156BC44EB918AA7FB07D6(); // Function ABP_HuntingTrap.ABP_HuntingTrap_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_E92F21CD4F8156BC44EB918AA7FB07D6
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_4C9EFD1E4C67D91A4CBB9685B4150C5B(); // Function ABP_HuntingTrap.ABP_HuntingTrap_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_4C9EFD1E4C67D91A4CBB9685B4150C5B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_5810710E4B1D3C4D97726C9EE1B447F8(); // Function ABP_HuntingTrap.ABP_HuntingTrap_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_5810710E4B1D3C4D97726C9EE1B447F8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_835E46CB46B698497287ACBEBC661DE9(); // Function ABP_HuntingTrap.ABP_HuntingTrap_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_835E46CB46B698497287ACBEBC661DE9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_02E4A9CF4006E73325BECABAF51E1210(); // Function ABP_HuntingTrap.ABP_HuntingTrap_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HuntingTrap_AnimGraphNode_TransitionResult_02E4A9CF4006E73325BECABAF51E1210
	void ExecuteUbergraph_ABP_HuntingTrap(int32_t EntryPoint); // Function ABP_HuntingTrap.ABP_HuntingTrap_C.ExecuteUbergraph_ABP_HuntingTrap
}; 
 
 


