#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_CaveTroll.ABP_CaveTroll_C.AnimBlueprintGeneratedMutableData
// Size: 0x8(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool __BoolProperty : 1;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool __BoolProperty_1 : 1;  // 0x2 (0x2)
	char pad_3[1];  // 0x3 (0x3)
	float __FloatProperty_2;  // 0x4 (0x4)


}; 
 
 // ScriptStruct ABP_CaveTroll.ABP_CaveTroll_C.AnimBlueprintGeneratedConstantData
// Size: 0x178(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_193;  // 0x4 (0x4)
	struct FName __NameProperty_194;  // 0xC (0xC)
	int32_t __IntProperty_195;  // 0x14 (0x14)
	enum class EAnimGroupRole __ByteProperty_196;  // 0x18 (0x18)
	uint8_t __EnumProperty_197;  // 0x19 (0x19)
	enum class EAnimGroupRole __ByteProperty_198;  // 0x1A (0x1A)
	char pad_27[1];  // 0x1B (0x1B)
	struct FName __NameProperty_199;  // 0x1C (0x1C)
	char pad_36[4];  // 0x24 (0x24)
	struct UBlendProfile* __BlendProfile_200;  // 0x28 (0x28)
	struct UCurveFloat* __CurveFloat_201;  // 0x30 (0x30)
	uint8_t __EnumProperty_202;  // 0x38 (0x38)
	uint8_t __EnumProperty_203;  // 0x39 (0x39)
	char pad_58[6];  // 0x3A (0x3A)
	struct TArray<float> __ArrayProperty_204;  // 0x40 (0x40)
	struct FName __NameProperty_205;  // 0x50 (0x50)
	struct FName __NameProperty_206;  // 0x58 (0x58)
	struct FInputScaleBiasClampConstants __StructProperty_207;  // 0x60 (0x60)
	struct FName __NameProperty_208;  // 0x8C (0x8C)
	int32_t __IntProperty_209;  // 0x94 (0x94)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool __BoolProperty_210 : 1;  // 0x98 (0x98)
	char pad_153[3];  // 0x99 (0x99)
	float __FloatProperty_211;  // 0x9C (0x9C)
	float __FloatProperty_212;  // 0xA0 (0xA0)
	char pad_164_1 : 7;  // 0xA4 (0xA4)
	bool __BoolProperty_213 : 1;  // 0xA4 (0xA4)
	uint8_t __EnumProperty_214;  // 0xA5 (0xA5)
	enum class EAnimGroupRole __ByteProperty_215;  // 0xA6 (0xA6)
	char pad_167[1];  // 0xA7 (0xA7)
	struct FName __NameProperty_216;  // 0xA8 (0xA8)
	struct FName __NameProperty_217;  // 0xB0 (0xB0)
	int32_t __IntProperty_218;  // 0xB8 (0xB8)
	char pad_188[4];  // 0xBC (0xBC)
	struct FAnimNodeFunctionRef __StructProperty_219;  // 0xC0 (0xC0)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xE0 (0xE0)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x160 (0x160)


}; 
 
 // Function ABP_CaveTroll.ABP_CaveTroll_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_CaveTroll.ABP_CaveTroll_C.ExecuteUbergraph_ABP_CaveTroll
struct FExecuteUbergraph_ABP_CaveTroll
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 