#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_DeathSkull.ABP_DeathSkull_C.AnimBlueprintGeneratedMutableData
// Size: 0x8(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)


}; 
 
 // ScriptStruct ABP_DeathSkull.ABP_DeathSkull_C.AnimBlueprintGeneratedConstantData
// Size: 0x148(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_141;  // 0x4 (0x4)
	struct FName __NameProperty_142;  // 0xC (0xC)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool __BoolProperty_143 : 1;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	struct FName __NameProperty_144;  // 0x18 (0x18)
	struct FName __NameProperty_145;  // 0x20 (0x20)
	int32_t __IntProperty_146;  // 0x28 (0x28)
	struct FName __NameProperty_147;  // 0x2C (0x2C)
	int32_t __IntProperty_148;  // 0x34 (0x34)
	float __FloatProperty_149;  // 0x38 (0x38)
	struct FInputScaleBiasClampConstants __StructProperty_150;  // 0x3C (0x3C)
	float __FloatProperty_151;  // 0x68 (0x68)
	char pad_108_1 : 7;  // 0x6C (0x6C)
	bool __BoolProperty_152 : 1;  // 0x6C (0x6C)
	uint8_t __EnumProperty_153;  // 0x6D (0x6D)
	enum class EAnimGroupRole __ByteProperty_154;  // 0x6E (0x6E)
	char pad_111[1];  // 0x6F (0x6F)
	struct FName __NameProperty_155;  // 0x70 (0x70)
	int32_t __IntProperty_156;  // 0x78 (0x78)
	struct FName __NameProperty_157;  // 0x7C (0x7C)
	struct FName __NameProperty_158;  // 0x84 (0x84)
	int32_t __IntProperty_159;  // 0x8C (0x8C)
	struct FAnimNodeFunctionRef __StructProperty_160;  // 0x90 (0x90)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xB0 (0xB0)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x130 (0x130)


}; 
 
 // Function ABP_DeathSkull.ABP_DeathSkull_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_DeathSkull.ABP_DeathSkull_C.ExecuteUbergraph_ABP_DeathSkull
struct FExecuteUbergraph_ABP_DeathSkull
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 