#pragma once 
#include <ABP_Campfire_Kettle_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_Campfire_Kettle.ABP_Campfire_Kettle_C
// Size: 0x670(Inherited: 0x450)
struct UABP_Campfire_Kettle_C : UDCAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x450 (0x450)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x458 (0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x460 (0x460)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x468 (0x468)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x488 (0x488)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x4B0 (0x4B0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x4D8 (0x4D8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x520 (0x520)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x540 (0x540)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x588 (0x588)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x5A8 (0x5A8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Campfire_Kettle.ABP_Campfire_Kettle_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Campfire_Kettle_AnimGraphNode_TransitionResult_32C6727148679332779745921B5BD2E7(); // Function ABP_Campfire_Kettle.ABP_Campfire_Kettle_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Campfire_Kettle_AnimGraphNode_TransitionResult_32C6727148679332779745921B5BD2E7
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Campfire_Kettle_AnimGraphNode_TransitionResult_7EB26F0D4CCC28CB5D6F94B567CE5A9E(); // Function ABP_Campfire_Kettle.ABP_Campfire_Kettle_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Campfire_Kettle_AnimGraphNode_TransitionResult_7EB26F0D4CCC28CB5D6F94B567CE5A9E
	void ExecuteUbergraph_ABP_Campfire_Kettle(int32_t EntryPoint); // Function ABP_Campfire_Kettle.ABP_Campfire_Kettle_C.ExecuteUbergraph_ABP_Campfire_Kettle
}; 
 
 


