#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_GoblinBolaslinger_Bolas.ABP_GoblinBolaslinger_Bolas_C.AnimBlueprintGeneratedConstantData
// Size: 0x118(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_18;  // 0x4 (0x4)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool __BoolProperty_19 : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)
	float __FloatProperty_20;  // 0x10 (0x10)
	struct FInputScaleBiasClampConstants __StructProperty_21;  // 0x14 (0x14)
	float __FloatProperty_22;  // 0x40 (0x40)
	char pad_68_1 : 7;  // 0x44 (0x44)
	bool __BoolProperty_23 : 1;  // 0x44 (0x44)
	uint8_t __EnumProperty_24;  // 0x45 (0x45)
	enum class EAnimGroupRole __ByteProperty_25;  // 0x46 (0x46)
	char pad_71[1];  // 0x47 (0x47)
	struct FName __NameProperty_26;  // 0x48 (0x48)
	struct FName __NameProperty_27;  // 0x50 (0x50)
	int32_t __IntProperty_28;  // 0x58 (0x58)
	char pad_92[4];  // 0x5C (0x5C)
	struct FAnimNodeFunctionRef __StructProperty_29;  // 0x60 (0x60)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0x80 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x100 (0x100)


}; 
 
 // Function ABP_GoblinBolaslinger_Bolas.ABP_GoblinBolaslinger_Bolas_C.ExecuteUbergraph_ABP_GoblinBolaslinger_Bolas
struct FExecuteUbergraph_ABP_GoblinBolaslinger_Bolas
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 // Function ABP_GoblinBolaslinger_Bolas.ABP_GoblinBolaslinger_Bolas_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 