#pragma once 
#include <ABP_PlayerCharacterCapture_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_PlayerCharacterCapture.ABP_PlayerCharacterCapture_C
// Size: 0x1EB8(Inherited: 0x5B0)
struct UABP_PlayerCharacterCapture_C : UDCPlayerCharacterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x5B0 (0x5B0)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x5B8 (0x5B8)
	char pad_1508[4];  // 0x5E4 (0x5E4)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x5E8 (0x5E8)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x5F0 (0x5F0)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x5F8 (0x5F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x618 (0x618)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x640 (0x640)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0x668 (0x668)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11;  // 0x6B0 (0x6B0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x6D0 (0x6D0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10;  // 0x718 (0x718)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;  // 0x738 (0x738)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;  // 0x7A8 (0x7A8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;  // 0x888 (0x888)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;  // 0x8D0 (0x8D0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;  // 0x940 (0x940)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9;  // 0x9B0 (0x9B0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0x9D0 (0x9D0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8;  // 0xA18 (0xA18)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4;  // 0xA38 (0xA38)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;  // 0xB00 (0xB00)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_4;  // 0xC08 (0xC08)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;  // 0xC80 (0xC80)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_3;  // 0xCC8 (0xCC8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;  // 0xD40 (0xD40)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2;  // 0xD88 (0xD88)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0xE00 (0xE00)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;  // 0xE48 (0xE48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0xEC0 (0xEC0)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3;  // 0xEE0 (0xEE0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0xFA8 (0xFA8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x1088 (0x1088)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0x10D0 (0x10D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x11B0 (0x11B0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x11D8 (0x11D8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x1200 (0x1200)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x1248 (0x1248)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x1268 (0x1268)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x12B0 (0x12B0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x12D0 (0x12D0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x1340 (0x1340)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x1360 (0x1360)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x13A8 (0x13A8)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x13C8 (0x13C8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;  // 0x1490 (0x1490)
	struct FAnimNode_Slot AnimGraphNode_Slot_4;  // 0x1598 (0x1598)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0x15E0 (0x15E0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0x1608 (0x1608)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0x1630 (0x1630)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x1658 (0x1658)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x1680 (0x1680)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x16A8 (0x16A8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x16D0 (0x16D0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;  // 0x16F0 (0x16F0)
	struct FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting;  // 0x1710 (0x1710)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2;  // 0x1830 (0x1830)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;  // 0x1928 (0x1928)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x1948 (0x1948)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x1970 (0x1970)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x1990 (0x1990)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;  // 0x1A58 (0x1A58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x1B60 (0x1B60)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;  // 0x1B88 (0x1B88)
	struct FAnimNode_LegIK AnimGraphNode_LegIK;  // 0x1BA8 (0x1BA8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;  // 0x1CA0 (0x1CA0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x1CC0 (0x1CC0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3;  // 0x1DC8 (0x1DC8)
	struct FAnimNode_Slot AnimGraphNode_Slot_2;  // 0x1E10 (0x1E10)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x1E58 (0x1E58)
	struct UAnimSequence* ItemStandIdleAnimation;  // 0x1EA0 (0x1EA0)
	struct UAnimSequence* SecondItemStandIdleAnimation;  // 0x1EA8 (0x1EA8)
	char pad_7856_1 : 7;  // 0x1EB0 (0x1EB0)
	bool bSecondaryItemSet : 1;  // 0x1EB0 (0x1EB0)
	char pad_7857_1 : 7;  // 0x1EB1 (0x1EB1)
	bool bPrimaryItemSet : 1;  // 0x1EB1 (0x1EB1)
	char pad_7858_1 : 7;  // 0x1EB2 (0x1EB2)
	bool bTwoHandedItemSet : 1;  // 0x1EB2 (0x1EB2)
	char pad_7859_1 : 7;  // 0x1EB3 (0x1EB3)
	bool GameplayTag_bIsResting : 1;  // 0x1EB3 (0x1EB3)
	char pad_7860_1 : 7;  // 0x1EB4 (0x1EB4)
	bool bIsGroundMoving : 1;  // 0x1EB4 (0x1EB4)
	char pad_7861_1 : 7;  // 0x1EB5 (0x1EB5)
	bool bIsWomanHead : 1;  // 0x1EB5 (0x1EB5)
	char pad_7862_1 : 7;  // 0x1EB6 (0x1EB6)
	bool bIsWomanElfHead : 1;  // 0x1EB6 (0x1EB6)
	char pad_7863_1 : 7;  // 0x1EB7 (0x1EB7)
	bool bIsOrcHead : 1;  // 0x1EB7 (0x1EB7)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_PlayerCharacterCapture.ABP_PlayerCharacterCapture_C.AnimGraph
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function ABP_PlayerCharacterCapture.ABP_PlayerCharacterCapture_C.BlueprintThreadSafeUpdateAnimation
	void OnChangedStandIdle(struct UAnimSequence* ItemStandIdleAnimation, struct FGameplayTag ItemHandType, struct FGameplayTag ItemSlotType); // Function ABP_PlayerCharacterCapture.ABP_PlayerCharacterCapture_C.OnChangedStandIdle
	void ExecuteUbergraph_ABP_PlayerCharacterCapture(int32_t EntryPoint); // Function ABP_PlayerCharacterCapture.ABP_PlayerCharacterCapture_C.ExecuteUbergraph_ABP_PlayerCharacterCapture
}; 
 
 


