#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_CrystalBall.ABP_CrystalBall_C.AnimBlueprintGeneratedConstantData
// Size: 0xD0(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_5;  // 0x4 (0x4)
	struct FName __NameProperty_6;  // 0xC (0xC)
	char pad_20[4];  // 0x14 (0x14)
	struct FAnimNodeFunctionRef __StructProperty_7;  // 0x18 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0x38 (0x38)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0xB8 (0xB8)


}; 
 
 // Function ABP_CrystalBall.ABP_CrystalBall_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_CrystalBall.ABP_CrystalBall_C.ExecuteUbergraph_ABP_CrystalBall
struct FExecuteUbergraph_ABP_CrystalBall
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FItemData K2Node_Event_ItemData;  // 0x8 (0x8)


}; 
 
 // Function ABP_CrystalBall.ABP_CrystalBall_C.OnItemDataUpdated
// Size: 0xA0(Inherited: 0xA0)
struct FOnItemDataUpdated : FOnItemDataUpdated
{
	struct FItemData ItemData;  // 0x0 (0x0)


}; 
 
 