#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_GoldenKey.ABP_GoldenKey_C.AnimBlueprintGeneratedConstantData
// Size: 0x110(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_17;  // 0x4 (0x4)
	char pad_12[4];  // 0xC (0xC)
	struct FAnimNodeFunctionRef __StructProperty_18;  // 0x10 (0x10)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool __BoolProperty_19 : 1;  // 0x30 (0x30)
	char pad_49[3];  // 0x31 (0x31)
	float __FloatProperty_20;  // 0x34 (0x34)
	struct FInputScaleBiasClampConstants __StructProperty_21;  // 0x38 (0x38)
	float __FloatProperty_22;  // 0x64 (0x64)
	char pad_104_1 : 7;  // 0x68 (0x68)
	bool __BoolProperty_23 : 1;  // 0x68 (0x68)
	uint8_t __EnumProperty_24;  // 0x69 (0x69)
	enum class EAnimGroupRole __ByteProperty_25;  // 0x6A (0x6A)
	char pad_107[1];  // 0x6B (0x6B)
	struct FName __NameProperty_26;  // 0x6C (0x6C)
	char pad_116[4];  // 0x74 (0x74)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0x78 (0x78)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0xF8 (0xF8)


}; 
 
 // Function ABP_GoldenKey.ABP_GoldenKey_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_GoldenKey.ABP_GoldenKey_C.ExecuteUbergraph_ABP_GoldenKey
struct FExecuteUbergraph_ABP_GoldenKey
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 