#pragma once 
#include <ABP_DemonDog_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_DemonDog.ABP_DemonDog_C
// Size: 0x1612(Inherited: 0x510)
struct UABP_DemonDog_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	char pad_1316[4];  // 0x524 (0x524)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x528 (0x528)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x530 (0x530)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x538 (0x538)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x558 (0x558)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;  // 0x5A0 (0x5A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;  // 0x5C8 (0x5C8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x5F0 (0x5F0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0x618 (0x618)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0x640 (0x640)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0x688 (0x688)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x6A8 (0x6A8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x6F0 (0x6F0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x710 (0x710)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x780 (0x780)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x7A0 (0x7A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0x868 (0x868)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0x890 (0x890)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0x8B8 (0x8B8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x8E0 (0x8E0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x908 (0x908)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x930 (0x930)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x958 (0x958)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;  // 0x980 (0x980)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x9A8 (0x9A8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0x9C8 (0x9C8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0xA10 (0xA10)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;  // 0xA58 (0xA58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0xA80 (0xA80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;  // 0xAA8 (0xAA8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;  // 0xB70 (0xB70)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;  // 0xC38 (0xC38)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;  // 0xC58 (0xC58)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2;  // 0xC78 (0xC78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0xD70 (0xD70)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0xDB8 (0xDB8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0xE98 (0xE98)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0xEC0 (0xEC0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0xEE0 (0xEE0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0xF28 (0xF28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0xF50 (0xF50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0xF78 (0xF78)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;  // 0x1040 (0x1040)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;  // 0x1060 (0x1060)
	struct FAnimNode_LegIK AnimGraphNode_LegIK;  // 0x1080 (0x1080)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x1178 (0x1178)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0x11C0 (0x11C0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x12A0 (0x12A0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0x12E8 (0x12E8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x13B0 (0x13B0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x13D8 (0x13D8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x13F8 (0x13F8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x1420 (0x1420)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x1440 (0x1440)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x1508 (0x1508)
	char pad_5648_1 : 7;  // 0x1610 (0x1610)
	bool bShouldPlayHitReactionNotSpawn : 1;  // 0x1610 (0x1610)
	char pad_5649_1 : 7;  // 0x1611 (0x1611)
	bool bShouldPlayStaggerNotSpawn : 1;  // 0x1611 (0x1611)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_DemonDog.ABP_DemonDog_C.AnimGraph
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function ABP_DemonDog.ABP_DemonDog_C.BlueprintThreadSafeUpdateAnimation
	void ExecuteUbergraph_ABP_DemonDog(int32_t EntryPoint); // Function ABP_DemonDog.ABP_DemonDog_C.ExecuteUbergraph_ABP_DemonDog
}; 
 
 


