#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_Spider_Mummy.ABP_Spider_Mummy_C.AnimBlueprintGeneratedMutableData
// Size: 0x8(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)


}; 
 
 // ScriptStruct ABP_Spider_Mummy.ABP_Spider_Mummy_C.AnimBlueprintGeneratedConstantData
// Size: 0x158(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_126;  // 0x4 (0x4)
	struct FName __NameProperty_127;  // 0xC (0xC)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool __BoolProperty_128 : 1;  // 0x14 (0x14)
	uint8_t __EnumProperty_129;  // 0x15 (0x15)
	char pad_22[2];  // 0x16 (0x16)
	struct FName __NameProperty_130;  // 0x18 (0x18)
	struct FName __NameProperty_131;  // 0x20 (0x20)
	int32_t __IntProperty_132;  // 0x28 (0x28)
	struct FName __NameProperty_133;  // 0x2C (0x2C)
	int32_t __IntProperty_134;  // 0x34 (0x34)
	float __FloatProperty_135;  // 0x38 (0x38)
	struct FInputScaleBiasClampConstants __StructProperty_136;  // 0x3C (0x3C)
	float __FloatProperty_137;  // 0x68 (0x68)
	float __FloatProperty_138;  // 0x6C (0x6C)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool __BoolProperty_139 : 1;  // 0x70 (0x70)
	uint8_t __EnumProperty_140;  // 0x71 (0x71)
	enum class EAnimGroupRole __ByteProperty_141;  // 0x72 (0x72)
	char pad_115[1];  // 0x73 (0x73)
	struct FName __NameProperty_142;  // 0x74 (0x74)
	struct FName __NameProperty_143;  // 0x7C (0x7C)
	int32_t __IntProperty_144;  // 0x84 (0x84)
	struct FName __NameProperty_145;  // 0x88 (0x88)
	struct FName __NameProperty_146;  // 0x90 (0x90)
	int32_t __IntProperty_147;  // 0x98 (0x98)
	char pad_156[4];  // 0x9C (0x9C)
	struct FAnimNodeFunctionRef __StructProperty_148;  // 0xA0 (0xA0)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xC0 (0xC0)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x140 (0x140)


}; 
 
 // Function ABP_Spider_Mummy.ABP_Spider_Mummy_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_Spider_Mummy.ABP_Spider_Mummy_C.ExecuteUbergraph_ABP_Spider_Mummy
struct FExecuteUbergraph_ABP_Spider_Mummy
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 