#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_SkeletonCrossbowman.ABP_SkeletonCrossbowman_C.AnimBlueprintGeneratedMutableData
// Size: 0xA(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool __BoolProperty_1 : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool __BoolProperty_2 : 1;  // 0x9 (0x9)


}; 
 
 // ScriptStruct ABP_SkeletonCrossbowman.ABP_SkeletonCrossbowman_C.AnimBlueprintGeneratedConstantData
// Size: 0x188(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_206;  // 0x4 (0x4)
	float __FloatProperty_207;  // 0xC (0xC)
	struct FName __NameProperty_208;  // 0x10 (0x10)
	uint8_t __EnumProperty_209;  // 0x18 (0x18)
	char pad_25[3];  // 0x19 (0x19)
	struct FName __NameProperty_210;  // 0x1C (0x1C)
	struct FName __NameProperty_211;  // 0x24 (0x24)
	int32_t __IntProperty_212;  // 0x2C (0x2C)
	struct FName __NameProperty_213;  // 0x30 (0x30)
	struct FName __NameProperty_214;  // 0x38 (0x38)
	int32_t __IntProperty_215;  // 0x40 (0x40)
	char pad_68_1 : 7;  // 0x44 (0x44)
	bool __BoolProperty_216 : 1;  // 0x44 (0x44)
	char pad_69[3];  // 0x45 (0x45)
	float __FloatProperty_217;  // 0x48 (0x48)
	struct FInputScaleBiasClampConstants __StructProperty_218;  // 0x4C (0x4C)
	float __FloatProperty_219;  // 0x78 (0x78)
	uint8_t __EnumProperty_220;  // 0x7C (0x7C)
	enum class EAnimGroupRole __ByteProperty_221;  // 0x7D (0x7D)
	char pad_126[2];  // 0x7E (0x7E)
	struct FName __NameProperty_222;  // 0x80 (0x80)
	struct UBlendProfile* __BlendProfile_223;  // 0x88 (0x88)
	struct UCurveFloat* __CurveFloat_224;  // 0x90 (0x90)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool __BoolProperty_225 : 1;  // 0x98 (0x98)
	uint8_t __EnumProperty_226;  // 0x99 (0x99)
	uint8_t __EnumProperty_227;  // 0x9A (0x9A)
	char pad_155[5];  // 0x9B (0x9B)
	struct TArray<float> __ArrayProperty_228;  // 0xA0 (0xA0)
	struct FName __NameProperty_229;  // 0xB0 (0xB0)
	int32_t __IntProperty_230;  // 0xB8 (0xB8)
	struct FName __NameProperty_231;  // 0xBC (0xBC)
	struct FName __NameProperty_232;  // 0xC4 (0xC4)
	int32_t __IntProperty_233;  // 0xCC (0xCC)
	struct FAnimNodeFunctionRef __StructProperty_234;  // 0xD0 (0xD0)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xF0 (0xF0)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x170 (0x170)


}; 
 
 // Function ABP_SkeletonCrossbowman.ABP_SkeletonCrossbowman_C.ExecuteUbergraph_ABP_SkeletonCrossbowman
struct FExecuteUbergraph_ABP_SkeletonCrossbowman
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 // Function ABP_SkeletonCrossbowman.ABP_SkeletonCrossbowman_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 