#pragma once 
#include <ABP_ChestSmall_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_ChestSmall.ABP_ChestSmall_C
// Size: 0x6C0(Inherited: 0x450)
struct UABP_ChestSmall_C : UDCAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x450 (0x450)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x458 (0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x460 (0x460)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x468 (0x468)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x488 (0x488)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x4D0 (0x4D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x4F8 (0x4F8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x520 (0x520)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x568 (0x568)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x588 (0x588)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x5D0 (0x5D0)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x5F0 (0x5F0)
	struct FGameplayTag GameplayTag_1;  // 0x6B8 (0x6B8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_ChestSmall.ABP_ChestSmall_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ChestSmall_AnimGraphNode_TransitionResult_5A45845643BDE8880966D0BB3D15F2FA(); // Function ABP_ChestSmall.ABP_ChestSmall_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ChestSmall_AnimGraphNode_TransitionResult_5A45845643BDE8880966D0BB3D15F2FA
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ChestSmall_AnimGraphNode_TransitionResult_350F82B84B0DE23F6969EE83910E3A49(); // Function ABP_ChestSmall.ABP_ChestSmall_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ChestSmall_AnimGraphNode_TransitionResult_350F82B84B0DE23F6969EE83910E3A49
	void ExecuteUbergraph_ABP_ChestSmall(int32_t EntryPoint); // Function ABP_ChestSmall.ABP_ChestSmall_C.ExecuteUbergraph_ABP_ChestSmall
}; 
 
 


