#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_Wraith.ABP_Wraith_C.AnimBlueprintGeneratedMutableData
// Size: 0xA(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool __BoolProperty_1 : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool __BoolProperty_2 : 1;  // 0x9 (0x9)


}; 
 
 // ScriptStruct ABP_Wraith.ABP_Wraith_C.AnimBlueprintGeneratedConstantData
// Size: 0x180(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_202;  // 0x4 (0x4)
	struct FName __NameProperty_203;  // 0xC (0xC)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool __BoolProperty_204 : 1;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	float __FloatProperty_205;  // 0x18 (0x18)
	uint8_t __EnumProperty_206;  // 0x1C (0x1C)
	char pad_29[3];  // 0x1D (0x1D)
	struct FName __NameProperty_207;  // 0x20 (0x20)
	struct FName __NameProperty_208;  // 0x28 (0x28)
	int32_t __IntProperty_209;  // 0x30 (0x30)
	char pad_52[4];  // 0x34 (0x34)
	struct UBlendProfile* __BlendProfile_210;  // 0x38 (0x38)
	struct UCurveFloat* __CurveFloat_211;  // 0x40 (0x40)
	uint8_t __EnumProperty_212;  // 0x48 (0x48)
	uint8_t __EnumProperty_213;  // 0x49 (0x49)
	char pad_74[6];  // 0x4A (0x4A)
	struct TArray<float> __ArrayProperty_214;  // 0x50 (0x50)
	float __FloatProperty_215;  // 0x60 (0x60)
	struct FInputScaleBiasClampConstants __StructProperty_216;  // 0x64 (0x64)
	float __FloatProperty_217;  // 0x90 (0x90)
	float __FloatProperty_218;  // 0x94 (0x94)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool __BoolProperty_219 : 1;  // 0x98 (0x98)
	uint8_t __EnumProperty_220;  // 0x99 (0x99)
	enum class EAnimGroupRole __ByteProperty_221;  // 0x9A (0x9A)
	char pad_155[1];  // 0x9B (0x9B)
	struct FName __NameProperty_222;  // 0x9C (0x9C)
	struct FName __NameProperty_223;  // 0xA4 (0xA4)
	int32_t __IntProperty_224;  // 0xAC (0xAC)
	struct FName __NameProperty_225;  // 0xB0 (0xB0)
	struct FName __NameProperty_226;  // 0xB8 (0xB8)
	int32_t __IntProperty_227;  // 0xC0 (0xC0)
	char pad_196[4];  // 0xC4 (0xC4)
	struct FAnimNodeFunctionRef __StructProperty_228;  // 0xC8 (0xC8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xE8 (0xE8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x168 (0x168)


}; 
 
 // Function ABP_Wraith.ABP_Wraith_C.ExecuteUbergraph_ABP_Wraith
struct FExecuteUbergraph_ABP_Wraith
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 // Function ABP_Wraith.ABP_Wraith_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 