#pragma once 
#include <ABP_FloorPortalScroll_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_FloorPortalScroll.ABP_FloorPortalScroll_C
// Size: 0x770(Inherited: 0x450)
struct UABP_FloorPortalScroll_C : UDCAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x450 (0x450)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x458 (0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x460 (0x460)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x468 (0x468)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x488 (0x488)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0x4D0 (0x4D0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0x4F8 (0x4F8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x520 (0x520)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x548 (0x548)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0x570 (0x570)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x5B8 (0x5B8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x5D8 (0x5D8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x620 (0x620)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x640 (0x640)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x688 (0x688)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x6A8 (0x6A8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_FloorPortalScroll.ABP_FloorPortalScroll_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorPortalScroll_AnimGraphNode_TransitionResult_9EF891CB472D95401EEB279DFA49016E(); // Function ABP_FloorPortalScroll.ABP_FloorPortalScroll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorPortalScroll_AnimGraphNode_TransitionResult_9EF891CB472D95401EEB279DFA49016E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorPortalScroll_AnimGraphNode_TransitionResult_CB02A45141C8258073BF38AFD4929C1C(); // Function ABP_FloorPortalScroll.ABP_FloorPortalScroll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorPortalScroll_AnimGraphNode_TransitionResult_CB02A45141C8258073BF38AFD4929C1C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorPortalScroll_AnimGraphNode_TransitionResult_F34D23BB4ACD6D7D2643838921A47E5D(); // Function ABP_FloorPortalScroll.ABP_FloorPortalScroll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorPortalScroll_AnimGraphNode_TransitionResult_F34D23BB4ACD6D7D2643838921A47E5D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorPortalScroll_AnimGraphNode_TransitionResult_9A87100B48357FE5C6352C930D336F22(); // Function ABP_FloorPortalScroll.ABP_FloorPortalScroll_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FloorPortalScroll_AnimGraphNode_TransitionResult_9A87100B48357FE5C6352C930D336F22
	void ExecuteUbergraph_ABP_FloorPortalScroll(int32_t EntryPoint); // Function ABP_FloorPortalScroll.ABP_FloorPortalScroll_C.ExecuteUbergraph_ABP_FloorPortalScroll
}; 
 
 


