#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_LavaMonster.ABP_LavaMonster_C.AnimBlueprintGeneratedMutableData
// Size: 0x8(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool __BoolProperty : 1;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool __BoolProperty_1 : 1;  // 0x2 (0x2)
	char pad_3[1];  // 0x3 (0x3)
	float __FloatProperty_2;  // 0x4 (0x4)


}; 
 
 // ScriptStruct ABP_LavaMonster.ABP_LavaMonster_C.AnimBlueprintGeneratedConstantData
// Size: 0x198(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_229;  // 0x4 (0x4)
	struct FName __NameProperty_230;  // 0xC (0xC)
	int32_t __IntProperty_231;  // 0x14 (0x14)
	struct FName __NameProperty_232;  // 0x18 (0x18)
	struct FName __NameProperty_233;  // 0x20 (0x20)
	float __FloatProperty_234;  // 0x28 (0x28)
	uint8_t __EnumProperty_235;  // 0x2C (0x2C)
	char pad_45[3];  // 0x2D (0x2D)
	struct FName __NameProperty_236;  // 0x30 (0x30)
	struct UBlendProfile* __BlendProfile_237;  // 0x38 (0x38)
	struct UCurveFloat* __CurveFloat_238;  // 0x40 (0x40)
	uint8_t __EnumProperty_239;  // 0x48 (0x48)
	uint8_t __EnumProperty_240;  // 0x49 (0x49)
	char pad_74[6];  // 0x4A (0x4A)
	struct TArray<float> __ArrayProperty_241;  // 0x50 (0x50)
	struct FName __NameProperty_242;  // 0x60 (0x60)
	struct FName __NameProperty_243;  // 0x68 (0x68)
	struct FName __NameProperty_244;  // 0x70 (0x70)
	int32_t __IntProperty_245;  // 0x78 (0x78)
	float __FloatProperty_246;  // 0x7C (0x7C)
	struct FInputScaleBiasClampConstants __StructProperty_247;  // 0x80 (0x80)
	struct FName __NameProperty_248;  // 0xAC (0xAC)
	int32_t __IntProperty_249;  // 0xB4 (0xB4)
	char pad_184_1 : 7;  // 0xB8 (0xB8)
	bool __BoolProperty_250 : 1;  // 0xB8 (0xB8)
	char pad_185[3];  // 0xB9 (0xB9)
	float __FloatProperty_251;  // 0xBC (0xBC)
	float __FloatProperty_252;  // 0xC0 (0xC0)
	char pad_196_1 : 7;  // 0xC4 (0xC4)
	bool __BoolProperty_253 : 1;  // 0xC4 (0xC4)
	uint8_t __EnumProperty_254;  // 0xC5 (0xC5)
	enum class EAnimGroupRole __ByteProperty_255;  // 0xC6 (0xC6)
	char pad_199[1];  // 0xC7 (0xC7)
	struct FName __NameProperty_256;  // 0xC8 (0xC8)
	struct FName __NameProperty_257;  // 0xD0 (0xD0)
	int32_t __IntProperty_258;  // 0xD8 (0xD8)
	char pad_220[4];  // 0xDC (0xDC)
	struct FAnimNodeFunctionRef __StructProperty_259;  // 0xE0 (0xE0)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0x100 (0x100)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x180 (0x180)


}; 
 
 // Function ABP_LavaMonster.ABP_LavaMonster_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_LavaMonster.ABP_LavaMonster_C.ExecuteUbergraph_ABP_LavaMonster
struct FExecuteUbergraph_ABP_LavaMonster
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 