#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_OldRustyKey.ABP_OldRustyKey_C.AnimBlueprintGeneratedConstantData
// Size: 0x108(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_18;  // 0x4 (0x4)
	char pad_12[4];  // 0xC (0xC)
	struct FAnimNodeFunctionRef __StructProperty_19;  // 0x10 (0x10)
	float __FloatProperty_20;  // 0x30 (0x30)
	struct FInputScaleBiasClampConstants __StructProperty_21;  // 0x34 (0x34)
	float __FloatProperty_22;  // 0x60 (0x60)
	char pad_100_1 : 7;  // 0x64 (0x64)
	bool __BoolProperty_23 : 1;  // 0x64 (0x64)
	uint8_t __EnumProperty_24;  // 0x65 (0x65)
	enum class EAnimGroupRole __ByteProperty_25;  // 0x66 (0x66)
	char pad_103[1];  // 0x67 (0x67)
	struct FName __NameProperty_26;  // 0x68 (0x68)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0x70 (0x70)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0xF0 (0xF0)


}; 
 
 // Function ABP_OldRustyKey.ABP_OldRustyKey_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_OldRustyKey.ABP_OldRustyKey_C.ExecuteUbergraph_ABP_OldRustyKey
struct FExecuteUbergraph_ABP_OldRustyKey
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 