#pragma once 
#include <ABP_Campfire_RoastedRabbit_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_Campfire_RoastedRabbit.ABP_Campfire_RoastedRabbit_C
// Size: 0x670(Inherited: 0x450)
struct UABP_Campfire_RoastedRabbit_C : UDCAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x450 (0x450)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x458 (0x458)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x460 (0x460)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x468 (0x468)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0x488 (0x488)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0x4B0 (0x4B0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x4D8 (0x4D8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x520 (0x520)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x540 (0x540)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x588 (0x588)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x5A8 (0x5A8)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_Campfire_RoastedRabbit.ABP_Campfire_RoastedRabbit_C.AnimGraph
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Campfire_RoastedRabbit_AnimGraphNode_TransitionResult_7F31320449686B1E2AF9FF81C004C789(); // Function ABP_Campfire_RoastedRabbit.ABP_Campfire_RoastedRabbit_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Campfire_RoastedRabbit_AnimGraphNode_TransitionResult_7F31320449686B1E2AF9FF81C004C789
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Campfire_RoastedRabbit_AnimGraphNode_TransitionResult_FEDCEDEA443B7C825E555BB7B783E00B(); // Function ABP_Campfire_RoastedRabbit.ABP_Campfire_RoastedRabbit_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Campfire_RoastedRabbit_AnimGraphNode_TransitionResult_FEDCEDEA443B7C825E555BB7B783E00B
	void ExecuteUbergraph_ABP_Campfire_RoastedRabbit(int32_t EntryPoint); // Function ABP_Campfire_RoastedRabbit.ABP_Campfire_RoastedRabbit_C.ExecuteUbergraph_ABP_Campfire_RoastedRabbit
}; 
 
 


