#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_CampfireKit.ABP_CampfireKit_C.AnimBlueprintGeneratedConstantData
// Size: 0x120(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_41;  // 0x4 (0x4)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool __BoolProperty_42 : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)
	struct FName __NameProperty_43;  // 0x10 (0x10)
	int32_t __IntProperty_44;  // 0x18 (0x18)
	float __FloatProperty_45;  // 0x1C (0x1C)
	struct FInputScaleBiasClampConstants __StructProperty_46;  // 0x20 (0x20)
	float __FloatProperty_47;  // 0x4C (0x4C)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool __BoolProperty_48 : 1;  // 0x50 (0x50)
	uint8_t __EnumProperty_49;  // 0x51 (0x51)
	enum class EAnimGroupRole __ByteProperty_50;  // 0x52 (0x52)
	char pad_83[1];  // 0x53 (0x53)
	struct FName __NameProperty_51;  // 0x54 (0x54)
	struct FName __NameProperty_52;  // 0x5C (0x5C)
	int32_t __IntProperty_53;  // 0x64 (0x64)
	struct FAnimNodeFunctionRef __StructProperty_54;  // 0x68 (0x68)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0x88 (0x88)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x108 (0x108)


}; 
 
 // Function ABP_CampfireKit.ABP_CampfireKit_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_CampfireKit.ABP_CampfireKit_C.ExecuteUbergraph_ABP_CampfireKit
struct FExecuteUbergraph_ABP_CampfireKit
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FItemData K2Node_Event_ItemData;  // 0x8 (0x8)


}; 
 
 // Function ABP_CampfireKit.ABP_CampfireKit_C.OnItemDataUpdated
// Size: 0xA0(Inherited: 0xA0)
struct FOnItemDataUpdated : FOnItemDataUpdated
{
	struct FItemData ItemData;  // 0x0 (0x0)


}; 
 
 