#pragma once 
#include <ABP_GoblinAxeman_Structs.h>
 
 
 
// AnimBlueprintGeneratedClass ABP_GoblinAxeman.ABP_GoblinAxeman_C
// Size: 0x16AF(Inherited: 0x510)
struct UABP_GoblinAxeman_C : UDCMonsterAnimInstanceBase
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x510 (0x510)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x518 (0x518)
	char pad_1316[4];  // 0x524 (0x524)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;  // 0x528 (0x528)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base;  // 0x530 (0x530)
	struct FAnimNode_Root AnimGraphNode_Root;  // 0x538 (0x538)
	struct FAnimNode_Slot AnimGraphNode_Slot;  // 0x558 (0x558)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;  // 0x5A0 (0x5A0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;  // 0x5C8 (0x5C8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;  // 0x5F0 (0x5F0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;  // 0x618 (0x618)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;  // 0x640 (0x640)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;  // 0x668 (0x668)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;  // 0x690 (0x690)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7;  // 0x6D8 (0x6D8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;  // 0x6F8 (0x6F8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6;  // 0x740 (0x740)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;  // 0x760 (0x760)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5;  // 0x7A8 (0x7A8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;  // 0x7C8 (0x7C8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4;  // 0x838 (0x838)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2;  // 0x858 (0x858)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;  // 0x920 (0x920)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;  // 0xA28 (0xA28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;  // 0xA50 (0xA50)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;  // 0xA78 (0xA78)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;  // 0xAA0 (0xAA0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;  // 0xAC8 (0xAC8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;  // 0xAF0 (0xAF0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;  // 0xB18 (0xB18)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult;  // 0xB40 (0xB40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;  // 0xB68 (0xB68)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;  // 0xBB0 (0xBB0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;  // 0xBF8 (0xBF8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;  // 0xC20 (0xC20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;  // 0xC48 (0xC48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;  // 0xC70 (0xC70)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;  // 0xD38 (0xD38)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;  // 0xE00 (0xE00)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;  // 0xE20 (0xE20)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2;  // 0xE40 (0xE40)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;  // 0xF38 (0xF38)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;  // 0xF80 (0xF80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3;  // 0x1060 (0x1060)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;  // 0x1080 (0x1080)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;  // 0x10C8 (0x10C8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;  // 0x1110 (0x1110)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;  // 0x1138 (0x1138)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;  // 0x1160 (0x1160)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;  // 0x1188 (0x1188)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;  // 0x1250 (0x1250)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;  // 0x1318 (0x1318)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;  // 0x1338 (0x1338)
	struct FAnimNode_LegIK AnimGraphNode_LegIK;  // 0x1358 (0x1358)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;  // 0x1450 (0x1450)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;  // 0x1498 (0x1498)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2;  // 0x1578 (0x1578)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;  // 0x1598 (0x1598)
	struct FAnimNode_StateResult AnimGraphNode_StateResult;  // 0x15C0 (0x15C0)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine;  // 0x15E0 (0x15E0)
	int32_t Deadbody Index;  // 0x16A8 (0x16A8)
	char pad_5804_1 : 7;  // 0x16AC (0x16AC)
	bool DeadbodyIndex1 : 1;  // 0x16AC (0x16AC)
	char pad_5805_1 : 7;  // 0x16AD (0x16AD)
	bool DeadbodyIndex2 : 1;  // 0x16AD (0x16AD)
	char pad_5806_1 : 7;  // 0x16AE (0x16AE)
	bool DeadbodyIndex3 : 1;  // 0x16AE (0x16AE)


	void AnimGraph(struct FPoseLink& AnimGraph); // Function ABP_GoblinAxeman.ABP_GoblinAxeman_C.AnimGraph
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function ABP_GoblinAxeman.ABP_GoblinAxeman_C.BlueprintThreadSafeUpdateAnimation
	void ExecuteUbergraph_ABP_GoblinAxeman(int32_t EntryPoint); // Function ABP_GoblinAxeman.ABP_GoblinAxeman_C.ExecuteUbergraph_ABP_GoblinAxeman
}; 
 
 


