#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_SkeletonFootman.ABP_SkeletonFootman_C.AnimBlueprintGeneratedMutableData
// Size: 0xA(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool __BoolProperty_1 : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool __BoolProperty_2 : 1;  // 0x9 (0x9)


}; 
 
 // ScriptStruct ABP_SkeletonFootman.ABP_SkeletonFootman_C.AnimBlueprintGeneratedConstantData
// Size: 0x188(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_213;  // 0x4 (0x4)
	struct FName __NameProperty_214;  // 0xC (0xC)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool __BoolProperty_215 : 1;  // 0x14 (0x14)
	uint8_t __EnumProperty_216;  // 0x15 (0x15)
	char pad_22[2];  // 0x16 (0x16)
	struct FName __NameProperty_217;  // 0x18 (0x18)
	struct FName __NameProperty_218;  // 0x20 (0x20)
	int32_t __IntProperty_219;  // 0x28 (0x28)
	struct FName __NameProperty_220;  // 0x2C (0x2C)
	struct FName __NameProperty_221;  // 0x34 (0x34)
	int32_t __IntProperty_222;  // 0x3C (0x3C)
	struct FName __NameProperty_223;  // 0x40 (0x40)
	int32_t __IntProperty_224;  // 0x48 (0x48)
	char pad_76[4];  // 0x4C (0x4C)
	struct UBlendProfile* __BlendProfile_225;  // 0x50 (0x50)
	struct UCurveFloat* __CurveFloat_226;  // 0x58 (0x58)
	uint8_t __EnumProperty_227;  // 0x60 (0x60)
	uint8_t __EnumProperty_228;  // 0x61 (0x61)
	char pad_98[6];  // 0x62 (0x62)
	struct TArray<float> __ArrayProperty_229;  // 0x68 (0x68)
	float __FloatProperty_230;  // 0x78 (0x78)
	struct FInputScaleBiasClampConstants __StructProperty_231;  // 0x7C (0x7C)
	float __FloatProperty_232;  // 0xA8 (0xA8)
	char pad_172_1 : 7;  // 0xAC (0xAC)
	bool __BoolProperty_233 : 1;  // 0xAC (0xAC)
	uint8_t __EnumProperty_234;  // 0xAD (0xAD)
	enum class EAnimGroupRole __ByteProperty_235;  // 0xAE (0xAE)
	char pad_175[1];  // 0xAF (0xAF)
	struct FName __NameProperty_236;  // 0xB0 (0xB0)
	struct FName __NameProperty_237;  // 0xB8 (0xB8)
	struct FName __NameProperty_238;  // 0xC0 (0xC0)
	int32_t __IntProperty_239;  // 0xC8 (0xC8)
	char pad_204[4];  // 0xCC (0xCC)
	struct FAnimNodeFunctionRef __StructProperty_240;  // 0xD0 (0xD0)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xF0 (0xF0)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x170 (0x170)


}; 
 
 // Function ABP_SkeletonFootman.ABP_SkeletonFootman_C.ExecuteUbergraph_ABP_SkeletonFootman
struct FExecuteUbergraph_ABP_SkeletonFootman
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 // Function ABP_SkeletonFootman.ABP_SkeletonFootman_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 