#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// ScriptStruct ABP_SkeletonSwordman.ABP_SkeletonSwordman_C.AnimBlueprintGeneratedMutableData
// Size: 0xA(Inherited: 0x1)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	char pad_1[3];  // 0x1 (0x1)
	float __FloatProperty;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool __BoolProperty_1 : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool __BoolProperty_2 : 1;  // 0x9 (0x9)


}; 
 
 // ScriptStruct ABP_SkeletonSwordman.ABP_SkeletonSwordman_C.AnimBlueprintGeneratedConstantData
// Size: 0x190(Inherited: 0x1)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	char pad_1[3];  // 0x1 (0x1)
	struct FName __NameProperty_212;  // 0x4 (0x4)
	float __FloatProperty_213;  // 0xC (0xC)
	struct FName __NameProperty_214;  // 0x10 (0x10)
	uint8_t __EnumProperty_215;  // 0x18 (0x18)
	char pad_25[3];  // 0x19 (0x19)
	struct FName __NameProperty_216;  // 0x1C (0x1C)
	struct FName __NameProperty_217;  // 0x24 (0x24)
	int32_t __IntProperty_218;  // 0x2C (0x2C)
	struct FName __NameProperty_219;  // 0x30 (0x30)
	struct FName __NameProperty_220;  // 0x38 (0x38)
	int32_t __IntProperty_221;  // 0x40 (0x40)
	struct FName __NameProperty_222;  // 0x44 (0x44)
	int32_t __IntProperty_223;  // 0x4C (0x4C)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool __BoolProperty_224 : 1;  // 0x50 (0x50)
	char pad_81[3];  // 0x51 (0x51)
	float __FloatProperty_225;  // 0x54 (0x54)
	struct FInputScaleBiasClampConstants __StructProperty_226;  // 0x58 (0x58)
	float __FloatProperty_227;  // 0x84 (0x84)
	uint8_t __EnumProperty_228;  // 0x88 (0x88)
	enum class EAnimGroupRole __ByteProperty_229;  // 0x89 (0x89)
	char pad_138[2];  // 0x8A (0x8A)
	struct FName __NameProperty_230;  // 0x8C (0x8C)
	char pad_148[4];  // 0x94 (0x94)
	struct UBlendProfile* __BlendProfile_231;  // 0x98 (0x98)
	struct UCurveFloat* __CurveFloat_232;  // 0xA0 (0xA0)
	char pad_168_1 : 7;  // 0xA8 (0xA8)
	bool __BoolProperty_233 : 1;  // 0xA8 (0xA8)
	uint8_t __EnumProperty_234;  // 0xA9 (0xA9)
	uint8_t __EnumProperty_235;  // 0xAA (0xAA)
	char pad_171[5];  // 0xAB (0xAB)
	struct TArray<float> __ArrayProperty_236;  // 0xB0 (0xB0)
	struct FName __NameProperty_237;  // 0xC0 (0xC0)
	struct FName __NameProperty_238;  // 0xC8 (0xC8)
	int32_t __IntProperty_239;  // 0xD0 (0xD0)
	char pad_212[4];  // 0xD4 (0xD4)
	struct FAnimNodeFunctionRef __StructProperty_240;  // 0xD8 (0xD8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;  // 0xF8 (0xF8)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base;  // 0x178 (0x178)


}; 
 
 // Function ABP_SkeletonSwordman.ABP_SkeletonSwordman_C.AnimGraph
struct FAnimGraph
{
	struct FPoseLink AnimGraph;  // 0x0 (0x0)


}; 
 
 // Function ABP_SkeletonSwordman.ABP_SkeletonSwordman_C.ExecuteUbergraph_ABP_SkeletonSwordman
struct FExecuteUbergraph_ABP_SkeletonSwordman
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 