#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function AdvancedWidgets.RadialSlider.GetNormalizedSliderHandlePosition
struct FGetNormalizedSliderHandlePosition
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.GetCustomDefaultValue
struct FGetCustomDefaultValue
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetAngularOffset
struct FSetAngularOffset
{
	float InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetSliderHandleEndAngle
struct FSetSliderHandleEndAngle
{
	float InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.GetValue
struct FGetValue
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetCenterBackgroundColor
struct FSetCenterBackgroundColor
{
	struct FLinearColor InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetHandStartEndRatio
struct FSetHandStartEndRatio
{
	struct FVector2D InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetCustomDefaultValue
struct FSetCustomDefaultValue
{
	float InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetLocked
struct FSetLocked
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool InValue : 1;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetShowSliderHand
struct FSetShowSliderHand
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool InShowSliderHand : 1;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetShowSliderHandle
struct FSetShowSliderHandle
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool InShowSliderHandle : 1;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetSliderBarColor
struct FSetSliderBarColor
{
	struct FLinearColor InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetSliderHandleColor
struct FSetSliderHandleColor
{
	struct FLinearColor InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetSliderHandleStartAngle
struct FSetSliderHandleStartAngle
{
	float InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetSliderProgressColor
struct FSetSliderProgressColor
{
	struct FLinearColor InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetSliderRange
struct FSetSliderRange
{
	struct FRuntimeFloatCurve InSliderRange;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetStepSize
struct FSetStepSize
{
	float InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetUseVerticalDrag
struct FSetUseVerticalDrag
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool InUseVerticalDrag : 1;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetValue
struct FSetValue
{
	float InValue;  // 0x0 (0x0)


}; 
 
 // Function AdvancedWidgets.RadialSlider.SetValueTags
struct FSetValueTags
{
	struct TArray<float> InValueTags;  // 0x0 (0x0)


}; 
 
 