#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_AbilityActor_Decal.BP_AbilityActor_Decal_C.ExecuteUbergraph_BP_AbilityActor_Decal
struct FExecuteUbergraph_BP_AbilityActor_Decal
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FName K2Node_Event_ParamName;  // 0x4 (0x4)
	char pad_12[4];  // 0xC (0xC)
	struct FVector K2Node_Event_value;  // 0x10 (0x10)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool CallFunc_EqualEqual_VectorVector_ReturnValue : 1;  // 0x28 (0x28)


}; 
 
 // Function BP_AbilityActor_Decal.BP_AbilityActor_Decal_C.SetReticleMaterialParamVector
// Size: 0x20(Inherited: 0x20)
struct FSetReticleMaterialParamVector : FSetReticleMaterialParamVector
{
	struct FName ParamName;  // 0x0 (0x0)
	struct FVector Value;  // 0x8 (0x8)


}; 
 
 