#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_Aoe_Zombie_PoisonArea.BP_Aoe_Zombie_PoisonArea_C.ExecuteUbergraph_BP_Aoe_Zombie_PoisonArea
struct FExecuteUbergraph_BP_Aoe_Zombie_PoisonArea
{
	int32_t EntryPoint;  // 0x0 (0x0)
	enum class EEndPlayReason K2Node_Event_EndPlayReason;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x5 (0x5)
	char pad_6_1 : 7;  // 0x6 (0x6)
	bool CallFunc_HasAuthority_ReturnValue_2 : 1;  // 0x6 (0x6)
	char pad_7_1 : 7;  // 0x7 (0x7)
	bool CallFunc_PlaySound_ReturnValue : 1;  // 0x7 (0x7)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool CallFunc_PlaySound_ReturnValue_2 : 1;  // 0x8 (0x8)


}; 
 
 // Function BP_Aoe_Zombie_PoisonArea.BP_Aoe_Zombie_PoisonArea_C.ReceiveEndPlay
// Size: 0x1(Inherited: 0x1)
struct FReceiveEndPlay : FReceiveEndPlay
{
	enum class EEndPlayReason EndPlayReason;  // 0x0 (0x0)


}; 
 
 