#pragma once 
#include <BP_CaptureStudioLobbyCreateCharacter_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_CaptureStudioLobbyCreateCharacter.BP_CaptureStudioLobbyCreateCharacter_C
// Size: 0x2F8(Inherited: 0x2B8)
struct ABP_CaptureStudioLobbyCreateCharacter_C : ADCCaptureStudioActor
{
	struct UArrowComponent* Arrow;  // 0x2B8 (0x2B8)
	struct UDirectionalLightComponent* DirectionalLight;  // 0x2C0 (0x2C0)
	struct USpotLightComponent* SpotLight1;  // 0x2C8 (0x2C8)
	struct UPointLightComponent* PointLight1;  // 0x2D0 (0x2D0)
	struct USpotLightComponent* SpotLight2;  // 0x2D8 (0x2D8)
	struct USpotLightComponent* SpotLight;  // 0x2E0 (0x2E0)
	struct UCameraComponent* WatchCameraForDev;  // 0x2E8 (0x2E8)
	struct UPointLightComponent* PointLight;  // 0x2F0 (0x2F0)


}; 
 
 


