#pragma once 
#include <BP_Cockatrice_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_Cockatrice.BP_Cockatrice_C
// Size: 0x1250(Inherited: 0x11B8)
struct ABP_Cockatrice_C : ABP_DCMonsterBaseWithOptions_C
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x11B8 (0x11B8)
	struct UBP_DCHitBox_C* BP_DCHitBox17;  // 0x11C0 (0x11C0)
	struct UBP_DCHitBox_C* BP_DCHitBox16;  // 0x11C8 (0x11C8)
	struct UBP_DCHitBox_C* BP_DCHitBox15;  // 0x11D0 (0x11D0)
	struct UBP_DCHitBox_C* BP_DCHitBox14;  // 0x11D8 (0x11D8)
	struct UBP_DCHitBox_C* BP_DCHitBox13;  // 0x11E0 (0x11E0)
	struct UBP_DCHitBox_C* BP_DCHitBox12;  // 0x11E8 (0x11E8)
	struct UBP_DCHitBox_C* BP_DCHitBox11;  // 0x11F0 (0x11F0)
	struct UBP_DCHitBox_C* BP_DCHitBox10;  // 0x11F8 (0x11F8)
	struct UBP_DCHitBox_C* BP_DCHitBox9;  // 0x1200 (0x1200)
	struct UBP_DCHitBox_C* BP_DCHitBox8;  // 0x1208 (0x1208)
	struct UBP_DCHitBox_C* BP_DCHitBox7;  // 0x1210 (0x1210)
	struct UBP_DCHitBox_C* BP_DCHitBox6;  // 0x1218 (0x1218)
	struct UBP_DCHitBox_C* BP_DCHitBox5;  // 0x1220 (0x1220)
	struct UBP_DCHitBox_C* BP_DCHitBox4;  // 0x1228 (0x1228)
	struct UBP_DCHitBox_C* BP_DCHitBox3;  // 0x1230 (0x1230)
	struct UBP_DCHitBox_C* BP_DCHitBox2;  // 0x1238 (0x1238)
	struct UBP_DCHitBox_C* BP_DCHitBox1;  // 0x1240 (0x1240)
	struct UBP_DCHitBox_C* BP_DCHitBox;  // 0x1248 (0x1248)


	void EventFMsgSoundEvent(struct FMsgSoundEvent Msg); // Function BP_Cockatrice.BP_Cockatrice_C.EventFMsgSoundEvent
	void OnSetAI(); // Function BP_Cockatrice.BP_Cockatrice_C.OnSetAI
	void GameplayTagUpdated(struct FGameplayTag InGameplayTag, int32_t InCount); // Function BP_Cockatrice.BP_Cockatrice_C.GameplayTagUpdated
	void ExecuteUbergraph_BP_Cockatrice(int32_t EntryPoint); // Function BP_Cockatrice.BP_Cockatrice_C.ExecuteUbergraph_BP_Cockatrice
}; 
 
 


