#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_CampfireProp.BP_CampfireProp_C.ExecuteUbergraph_BP_CampfireProp
struct FExecuteUbergraph_BP_CampfireProp
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_IsServer_ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FGameplayTag Temp_struct_Variable;  // 0x8 (0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x10 (0x10)
	struct FDelegate Temp_delegate_Variable;  // 0x20 (0x20)
	struct FGameplayTag Temp_struct_Variable_2;  // 0x30 (0x30)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x38 (0x38)
	struct FDelegate Temp_delegate_Variable_2;  // 0x48 (0x48)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x58 (0x58)
	int32_t K2Node_Event_InCount;  // 0x60 (0x60)
	char pad_100_1 : 7;  // 0x64 (0x64)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x64 (0x64)
	char pad_101_1 : 7;  // 0x65 (0x65)
	bool CallFunc_Greater_IntInt_ReturnValue_2 : 1;  // 0x65 (0x65)
	char pad_102_1 : 7;  // 0x66 (0x66)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess : 1;  // 0x66 (0x66)
	char pad_103_1 : 7;  // 0x67 (0x67)
	bool CallFunc_SetStaticMesh_ReturnValue : 1;  // 0x67 (0x67)
	struct UObject* K2Node_CustomEvent_InObjectLoaded_2;  // 0x68 (0x68)
	struct USoundData* K2Node_DynamicCast_AsSound_Data;  // 0x70 (0x70)
	char pad_120_1 : 7;  // 0x78 (0x78)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x78 (0x78)
	char pad_121[7];  // 0x79 (0x79)
	struct UObject* K2Node_CustomEvent_InObjectLoaded;  // 0x80 (0x80)
	struct USoundData* K2Node_DynamicCast_AsSound_Data_2;  // 0x88 (0x88)
	char pad_144_1 : 7;  // 0x90 (0x90)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x90 (0x90)
	char pad_145[7];  // 0x91 (0x91)
	struct UAkAudioEvent* CallFunc_Map_Find_Value;  // 0x98 (0x98)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool CallFunc_Map_Find_ReturnValue : 1;  // 0xA0 (0xA0)
	char pad_161[7];  // 0xA1 (0xA1)
	struct UAkAudioEvent* CallFunc_Map_Find_Value_2;  // 0xA8 (0xA8)
	char pad_176_1 : 7;  // 0xB0 (0xB0)
	bool CallFunc_Map_Find_ReturnValue_2 : 1;  // 0xB0 (0xB0)
	char pad_177[3];  // 0xB1 (0xB1)
	int32_t CallFunc_PostAkEvent_ReturnValue;  // 0xB4 (0xB4)
	int32_t CallFunc_PostAkEvent_ReturnValue_2;  // 0xB8 (0xB8)
	char pad_188_1 : 7;  // 0xBC (0xBC)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0xBC (0xBC)
	char pad_189[3];  // 0xBD (0xBD)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0xC0 (0xC0)
	char pad_200_1 : 7;  // 0xC8 (0xC8)
	bool CallFunc_IsServer_ReturnValue_2 : 1;  // 0xC8 (0xC8)
	char pad_201[7];  // 0xC9 (0xC9)
	double CallFunc_Multiply_DoubleDouble_B_ImplicitCast;  // 0xD0 (0xD0)
	float CallFunc_SetIntensity_NewIntensity_ImplicitCast;  // 0xD8 (0xD8)


}; 
 
 // Function BP_CampfireProp.BP_CampfireProp_C.OnOffSoundLoaded
struct FOnOffSoundLoaded
{
	struct UObject* InObjectLoaded;  // 0x0 (0x0)


}; 
 
 // Function BP_CampfireProp.BP_CampfireProp_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 // Function BP_CampfireProp.BP_CampfireProp_C.OnOnSoundLoaded
struct FOnOnSoundLoaded
{
	struct UObject* InObjectLoaded;  // 0x0 (0x0)


}; 
 
 