#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.ReceiveEndPlay
// Size: 0x1(Inherited: 0x1)
struct FReceiveEndPlay : FReceiveEndPlay
{
	enum class EEndPlayReason EndPlayReason;  // 0x0 (0x0)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.AddBeginOverlapActor
// Size: 0x8(Inherited: 0x8)
struct FAddBeginOverlapActor : FAddBeginOverlapActor
{
	struct ADCCharacterBase* CharacterBase;  // 0x0 (0x0)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.DespawnPrecedingFX
struct FDespawnPrecedingFX
{
	int32_t Temp_int_Array_Index_Variable;  // 0x0 (0x0)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x4 (0x4)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x8 (0x8)
	int32_t Temp_int_Array_Index_Variable_2;  // 0xC (0xC)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x10 (0x10)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x14 (0x14)
	int32_t Temp_int_Array_Index_Variable_3;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)
	struct UDecalComponent* CallFunc_Array_Get_Item;  // 0x20 (0x20)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x28 (0x28)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x2C (0x2C)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[3];  // 0x31 (0x31)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x34 (0x34)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_2 : 1;  // 0x38 (0x38)
	char pad_57[3];  // 0x39 (0x39)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x3C (0x3C)
	int32_t Temp_int_Loop_Counter_Variable_3;  // 0x40 (0x40)
	char pad_68_1 : 7;  // 0x44 (0x44)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_3 : 1;  // 0x44 (0x44)
	char pad_69_1 : 7;  // 0x45 (0x45)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x45 (0x45)
	char pad_70[2];  // 0x46 (0x46)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x48 (0x48)
	char pad_76[4];  // 0x4C (0x4C)
	struct UNiagaraComponent* CallFunc_Array_Get_Item_2;  // 0x50 (0x50)
	struct UParticleSystemComponent* CallFunc_Array_Get_Item_3;  // 0x58 (0x58)
	int32_t CallFunc_Array_Length_ReturnValue_5;  // 0x60 (0x60)
	int32_t CallFunc_Array_Length_ReturnValue_6;  // 0x64 (0x64)
	char pad_104_1 : 7;  // 0x68 (0x68)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x68 (0x68)
	char pad_105_1 : 7;  // 0x69 (0x69)
	bool CallFunc_Less_IntInt_ReturnValue_3 : 1;  // 0x69 (0x69)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.DespawnFiringFX
struct FDespawnFiringFX
{
	int32_t Temp_int_Array_Index_Variable;  // 0x0 (0x0)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x4 (0x4)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x8 (0x8)
	int32_t Temp_int_Array_Index_Variable_2;  // 0xC (0xC)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x10 (0x10)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x14 (0x14)
	int32_t Temp_int_Array_Index_Variable_3;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)
	struct UDecalComponent* CallFunc_Array_Get_Item;  // 0x20 (0x20)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x28 (0x28)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x2C (0x2C)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[3];  // 0x31 (0x31)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x34 (0x34)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_2 : 1;  // 0x38 (0x38)
	char pad_57[3];  // 0x39 (0x39)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x3C (0x3C)
	char pad_64_1 : 7;  // 0x40 (0x40)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_3 : 1;  // 0x40 (0x40)
	char pad_65[7];  // 0x41 (0x41)
	struct UNiagaraComponent* CallFunc_Array_Get_Item_2;  // 0x48 (0x48)
	int32_t CallFunc_Array_Length_ReturnValue_5;  // 0x50 (0x50)
	char pad_84_1 : 7;  // 0x54 (0x54)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x54 (0x54)
	char pad_85[3];  // 0x55 (0x55)
	struct UParticleSystemComponent* CallFunc_Array_Get_Item_3;  // 0x58 (0x58)
	int32_t CallFunc_Array_Length_ReturnValue_6;  // 0x60 (0x60)
	int32_t Temp_int_Loop_Counter_Variable_3;  // 0x64 (0x64)
	char pad_104_1 : 7;  // 0x68 (0x68)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x68 (0x68)
	char pad_105_1 : 7;  // 0x69 (0x69)
	bool CallFunc_Less_IntInt_ReturnValue_3 : 1;  // 0x69 (0x69)
	char pad_106[2];  // 0x6A (0x6A)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x6C (0x6C)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.ExecuteUbergraph_BP_DCAoeDefineBase_AutoActive
struct FExecuteUbergraph_BP_DCAoeDefineBase_AutoActive
{
	int32_t EntryPoint;  // 0x0 (0x0)
	int32_t Temp_int_Array_Index_Variable;  // 0x4 (0x4)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x8 (0x8)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x10 (0x10)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x14 (0x14)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x18 (0x18)
	char pad_25[3];  // 0x19 (0x19)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x1C (0x1C)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x20 (0x20)
	char pad_36[4];  // 0x24 (0x24)
	struct TArray<struct FGameplayTag> CallFunc_BreakGameplayTagContainer_GameplayTags;  // 0x28 (0x28)
	struct FGameplayTag CallFunc_Array_Get_Item;  // 0x38 (0x38)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x40 (0x40)
	int32_t Temp_int_Array_Index_Variable_3;  // 0x44 (0x44)
	int32_t Temp_int_Loop_Counter_Variable_3;  // 0x48 (0x48)
	char pad_76[4];  // 0x4C (0x4C)
	struct TArray<struct FGameplayTag> CallFunc_BreakGameplayTagContainer_GameplayTags_2;  // 0x50 (0x50)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x60 (0x60)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x64 (0x64)
	struct APawn* CallFunc_GetInstigator_ReturnValue;  // 0x68 (0x68)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x70 (0x70)
	char pad_113_1 : 7;  // 0x71 (0x71)
	bool K2Node_SwitchEnum_CmpSuccess_2 : 1;  // 0x71 (0x71)
	char pad_114[2];  // 0x72 (0x72)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x74 (0x74)
	char pad_120_1 : 7;  // 0x78 (0x78)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x78 (0x78)
	char pad_121[3];  // 0x79 (0x79)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x7C (0x7C)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_2;  // 0x80 (0x80)
	int32_t CallFunc_Max_ReturnValue;  // 0x84 (0x84)
	struct ADCAoeBase* K2Node_DynamicCast_AsDCAoe_Base;  // 0x88 (0x88)
	char pad_144_1 : 7;  // 0x90 (0x90)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x90 (0x90)
	char pad_145_1 : 7;  // 0x91 (0x91)
	bool CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_ReturnValue : 1;  // 0x91 (0x91)
	char pad_146_1 : 7;  // 0x92 (0x92)
	bool CallFunc_GetTargetArray_ReturnValue : 1;  // 0x92 (0x92)
	char pad_147[1];  // 0x93 (0x93)
	int32_t Temp_int_Loop_Counter_Variable_4;  // 0x94 (0x94)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool CallFunc_HasAuthority_ReturnValue_2 : 1;  // 0x98 (0x98)
	char pad_153_1 : 7;  // 0x99 (0x99)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x99 (0x99)
	char pad_154[2];  // 0x9A (0x9A)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x9C (0x9C)
	int32_t CallFunc_Array_Length_ReturnValue_5;  // 0xA0 (0xA0)
	int32_t Temp_int_Array_Index_Variable_4;  // 0xA4 (0xA4)
	char pad_168_1 : 7;  // 0xA8 (0xA8)
	bool CallFunc_Less_IntInt_ReturnValue_3 : 1;  // 0xA8 (0xA8)
	char pad_169[3];  // 0xA9 (0xA9)
	struct FGameplayTag CallFunc_Array_Get_Item_2;  // 0xAC (0xAC)
	char pad_180[4];  // 0xB4 (0xB4)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_3;  // 0xB8 (0xB8)
	int32_t CallFunc_Array_Find_ReturnValue;  // 0xC0 (0xC0)
	int32_t CallFunc_Array_Length_ReturnValue_6;  // 0xC4 (0xC4)
	char pad_200_1 : 7;  // 0xC8 (0xC8)
	bool CallFunc_EqualEqual_IntInt_ReturnValue : 1;  // 0xC8 (0xC8)
	char pad_201[3];  // 0xC9 (0xC9)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_3;  // 0xCC (0xCC)
	int32_t CallFunc_Max_ReturnValue_2;  // 0xD0 (0xD0)
	char pad_212[4];  // 0xD4 (0xD4)
	struct ADCAoeBase* K2Node_DynamicCast_AsDCAoe_Base_2;  // 0xD8 (0xD8)
	char pad_224_1 : 7;  // 0xE0 (0xE0)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0xE0 (0xE0)
	char pad_225_1 : 7;  // 0xE1 (0xE1)
	bool CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_ReturnValue_2 : 1;  // 0xE1 (0xE1)
	char pad_226_1 : 7;  // 0xE2 (0xE2)
	bool CallFunc_GetTargetArray_ReturnValue_2 : 1;  // 0xE2 (0xE2)
	char pad_227[1];  // 0xE3 (0xE3)
	int32_t Temp_int_Array_Index_Variable_5;  // 0xE4 (0xE4)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_4;  // 0xE8 (0xE8)
	enum class EEndPlayReason K2Node_Event_EndPlayReason;  // 0xF0 (0xF0)
	char pad_241[3];  // 0xF1 (0xF1)
	int32_t Temp_int_Array_Index_Variable_6;  // 0xF4 (0xF4)
	char pad_248_1 : 7;  // 0xF8 (0xF8)
	bool CallFunc_EqualEqual_DoubleDouble_ReturnValue : 1;  // 0xF8 (0xF8)
	char pad_249[7];  // 0xF9 (0xF9)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_5;  // 0x100 (0x100)
	int32_t CallFunc_Array_Find_ReturnValue_2;  // 0x108 (0x108)
	char pad_268_1 : 7;  // 0x10C (0x10C)
	bool CallFunc_EqualEqual_IntInt_ReturnValue_2 : 1;  // 0x10C (0x10C)
	char pad_269[3];  // 0x10D (0x10D)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x110 (0x110)
	struct FTimerHandle CallFunc_K2_SetTimer_ReturnValue;  // 0x118 (0x118)
	struct ADCCharacterBase* K2Node_Event_CharacterBase_2;  // 0x120 (0x120)
	char pad_296_1 : 7;  // 0x128 (0x128)
	bool CallFunc_EqualEqual_ObjectObject_ReturnValue : 1;  // 0x128 (0x128)
	char pad_297[7];  // 0x129 (0x129)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x130 (0x130)
	char pad_312_1 : 7;  // 0x138 (0x138)
	bool K2Node_DynamicCast_bSuccess_3 : 1;  // 0x138 (0x138)
	char pad_313[7];  // 0x139 (0x139)
	struct ADCPlayerCharacterBase* K2Node_DynamicCast_AsDCPlayer_Character_Base;  // 0x140 (0x140)
	char pad_328_1 : 7;  // 0x148 (0x148)
	bool K2Node_DynamicCast_bSuccess_4 : 1;  // 0x148 (0x148)
	char pad_329[7];  // 0x149 (0x149)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue;  // 0x150 (0x150)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x228 (0x228)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue_3;  // 0x300 (0x300)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x3D8 (0x3D8)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue_4;  // 0x488 (0x488)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData_2;  // 0x560 (0x560)
	char pad_1552_1 : 7;  // 0x610 (0x610)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x610 (0x610)
	char pad_1553[7];  // 0x611 (0x611)
	struct ADCCharacterBase* K2Node_Event_CharacterBase;  // 0x618 (0x618)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options_2;  // 0x620 (0x620)
	char pad_1576_1 : 7;  // 0x628 (0x628)
	bool K2Node_DynamicCast_bSuccess_5 : 1;  // 0x628 (0x628)
	char pad_1577[7];  // 0x629 (0x629)
	struct ADCPlayerCharacterBase* K2Node_DynamicCast_AsDCPlayer_Character_Base_2;  // 0x630 (0x630)
	char pad_1592_1 : 7;  // 0x638 (0x638)
	bool K2Node_DynamicCast_bSuccess_6 : 1;  // 0x638 (0x638)
	char pad_1593[3];  // 0x639 (0x639)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue;  // 0x63C (0x63C)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_2;  // 0x640 (0x640)
	char pad_1604_1 : 7;  // 0x644 (0x644)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x644 (0x644)
	char pad_1605[3];  // 0x645 (0x645)
	int32_t Temp_int_Loop_Counter_Variable_5;  // 0x648 (0x648)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_4;  // 0x64C (0x64C)
	char pad_1616_1 : 7;  // 0x650 (0x650)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_2 : 1;  // 0x650 (0x650)
	char pad_1617[3];  // 0x651 (0x651)
	float K2Node_Event_DeltaSeconds;  // 0x654 (0x654)
	char pad_1624_1 : 7;  // 0x658 (0x658)
	bool K2Node_SwitchEnum_CmpSuccess_3 : 1;  // 0x658 (0x658)
	char pad_1625_1 : 7;  // 0x659 (0x659)
	bool K2Node_SwitchEnum_CmpSuccess_4 : 1;  // 0x659 (0x659)
	char pad_1626[6];  // 0x65A (0x65A)
	struct TArray<struct AActor*> CallFunc_GetOverlappingActors_OverlappingActors;  // 0x660 (0x660)
	int32_t CallFunc_Array_Length_ReturnValue_7;  // 0x670 (0x670)
	char pad_1652_1 : 7;  // 0x674 (0x674)
	bool CallFunc_EqualEqual_IntInt_ReturnValue_3 : 1;  // 0x674 (0x674)
	char pad_1653_1 : 7;  // 0x675 (0x675)
	bool K2Node_SwitchEnum_CmpSuccess_5 : 1;  // 0x675 (0x675)
	char pad_1654[2];  // 0x676 (0x676)
	int32_t Temp_int_Loop_Counter_Variable_6;  // 0x678 (0x678)
	char pad_1660_1 : 7;  // 0x67C (0x67C)
	bool CallFunc_Less_IntInt_ReturnValue_4 : 1;  // 0x67C (0x67C)
	char pad_1661[3];  // 0x67D (0x67D)
	int32_t CallFunc_Add_IntInt_ReturnValue_4;  // 0x680 (0x680)
	float CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_AllowedAngle_ImplicitCast;  // 0x684 (0x684)
	float CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_DirectionalAngle_ImplicitCast;  // 0x688 (0x688)
	float CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_AllowedAngle_ImplicitCast_2;  // 0x68C (0x68C)
	float CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_DirectionalAngle_ImplicitCast_2;  // 0x690 (0x690)
	float CallFunc_Delay_Duration_ImplicitCast;  // 0x694 (0x694)
	float CallFunc_Delay_Duration_ImplicitCast_2;  // 0x698 (0x698)
	float CallFunc_Delay_Duration_ImplicitCast_3;  // 0x69C (0x69C)
	float CallFunc_K2_SetTimer_Time_ImplicitCast;  // 0x6A0 (0x6A0)
	float CallFunc_K2_SetTimer_InitialStartDelay_ImplicitCast;  // 0x6A4 (0x6A4)
	float CallFunc_Delay_Duration_ImplicitCast_4;  // 0x6A8 (0x6A8)
	float CallFunc_Delay_Duration_ImplicitCast_5;  // 0x6AC (0x6AC)
	float CallFunc_Delay_Duration_ImplicitCast_6;  // 0x6B0 (0x6B0)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.ReceiveTick
// Size: 0x4(Inherited: 0x4)
struct FReceiveTick : FReceiveTick
{
	float DeltaSeconds;  // 0x0 (0x0)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.Remove
struct FRemove
{
	struct ADCCharacterBase* InputPin;  // 0x0 (0x0)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct ADCPlayerCharacterBase* K2Node_DynamicCast_AsDCPlayer_Character_Base;  // 0x18 (0x18)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x20 (0x20)
	char pad_33_1 : 7;  // 0x21 (0x21)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x21 (0x21)
	char pad_34[2];  // 0x22 (0x22)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue;  // 0x24 (0x24)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_2;  // 0x28 (0x28)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.Trigger GameplayCue
struct FTrigger GameplayCue
{
	struct UObject* Input Pin;  // 0x0 (0x0)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct ADCPlayerCharacterBase* K2Node_DynamicCast_AsDCPlayer_Character_Base;  // 0x18 (0x18)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue;  // 0x28 (0x28)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x100 (0x100)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue_3;  // 0x1D8 (0x1D8)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue_4;  // 0x2B0 (0x2B0)
	char pad_904_1 : 7;  // 0x388 (0x388)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x388 (0x388)
	char pad_905_1 : 7;  // 0x389 (0x389)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x389 (0x389)
	char pad_906_1 : 7;  // 0x38A (0x38A)
	bool K2Node_SwitchEnum_CmpSuccess_2 : 1;  // 0x38A (0x38A)
	char pad_907[5];  // 0x38B (0x38B)
	struct APawn* CallFunc_GetInstigator_ReturnValue;  // 0x390 (0x390)
	char pad_920_1 : 7;  // 0x398 (0x398)
	bool CallFunc_EqualEqual_ObjectObject_ReturnValue : 1;  // 0x398 (0x398)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.Remove Gameplay Cue
struct FRemove Gameplay Cue
{
	struct UObject* Input Pin;  // 0x0 (0x0)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct ADCPlayerCharacterBase* K2Node_DynamicCast_AsDCPlayer_Character_Base;  // 0x18 (0x18)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x20 (0x20)
	char pad_33_1 : 7;  // 0x21 (0x21)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x21 (0x21)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.RemoveEndOverlapActor
// Size: 0x8(Inherited: 0x8)
struct FRemoveEndOverlapActor : FRemoveEndOverlapActor
{
	struct ADCCharacterBase* CharacterBase;  // 0x0 (0x0)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.SpawnPrecedingFX
struct FSpawnPrecedingFX
{
	int32_t Temp_int_Loop_Counter_Variable;  // 0x0 (0x0)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x4 (0x4)
	int32_t Temp_int_Array_Index_Variable;  // 0x8 (0x8)
	int32_t Temp_int_Array_Index_Variable_2;  // 0xC (0xC)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x10 (0x10)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x14 (0x14)
	int32_t Temp_int_Array_Index_Variable_3;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x20 (0x20)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x38 (0x38)
	struct UMaterialInstance* CallFunc_Array_Get_Item;  // 0x50 (0x50)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x58 (0x58)
	char pad_92[4];  // 0x5C (0x5C)
	struct UDecalComponent* CallFunc_SpawnDecalAtLocation_ReturnValue;  // 0x60 (0x60)
	int32_t CallFunc_Array_Add_ReturnValue;  // 0x68 (0x68)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x6C (0x6C)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool CallFunc_LessEqual_IntInt_ReturnValue : 1;  // 0x70 (0x70)
	char pad_113[3];  // 0x71 (0x71)
	int32_t Temp_int_Loop_Counter_Variable_3;  // 0x74 (0x74)
	struct UNiagaraSystem* CallFunc_Array_Get_Item_2;  // 0x78 (0x78)
	struct UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue;  // 0x80 (0x80)
	char pad_136_1 : 7;  // 0x88 (0x88)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x88 (0x88)
	char pad_137[3];  // 0x89 (0x89)
	int32_t CallFunc_Array_Add_ReturnValue_2;  // 0x8C (0x8C)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x90 (0x90)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x94 (0x94)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x98 (0x98)
	char pad_153[3];  // 0x99 (0x99)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x9C (0x9C)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool CallFunc_LessEqual_IntInt_ReturnValue_2 : 1;  // 0xA0 (0xA0)
	char pad_161[7];  // 0xA1 (0xA1)
	struct UParticleSystem* CallFunc_Array_Get_Item_3;  // 0xA8 (0xA8)
	int32_t CallFunc_Array_Length_ReturnValue_5;  // 0xB0 (0xB0)
	char pad_180[4];  // 0xB4 (0xB4)
	struct UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue;  // 0xB8 (0xB8)
	char pad_192_1 : 7;  // 0xC0 (0xC0)
	bool CallFunc_Less_IntInt_ReturnValue_3 : 1;  // 0xC0 (0xC0)
	char pad_193[3];  // 0xC1 (0xC1)
	int32_t CallFunc_Array_Length_ReturnValue_6;  // 0xC4 (0xC4)
	char pad_200_1 : 7;  // 0xC8 (0xC8)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0xC8 (0xC8)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.Send Gameplay Event To Hit
struct FSend Gameplay Event To Hit
{
	struct ADCCharacterBase* DCCharacterBase;  // 0x0 (0x0)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x8 (0x8)
	int32_t Temp_int_Array_Index_Variable;  // 0xB8 (0xB8)
	int32_t Temp_int_Loop_Counter_Variable;  // 0xBC (0xBC)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0xC0 (0xC0)
	struct FGameplayTag CallFunc_Array_Get_Item;  // 0xC4 (0xC4)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0xCC (0xCC)
	char pad_208_1 : 7;  // 0xD0 (0xD0)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0xD0 (0xD0)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.SetComponentTag
struct FSetComponentTag
{
	struct UActorComponent* InComponent;  // 0x0 (0x0)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.SetVariables
struct FSetVariables
{
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue;  // 0x0 (0x0)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.SpawnAntiAuraCollision
struct FSpawnAntiAuraCollision
{
	struct TArray<struct FName> K2Node_MakeArray_Array;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct AActor* CallFunc_GetOwner_ReturnValue;  // 0x18 (0x18)
	struct FRotator CallFunc_K2_GetActorRotation_ReturnValue;  // 0x20 (0x20)
	char pad_56[8];  // 0x38 (0x38)
	struct FTransform CallFunc_MakeTransform_ReturnValue;  // 0x40 (0x40)
	struct FTransform CallFunc_MakeTransform_ReturnValue_2;  // 0xA0 (0xA0)
	struct USphereComponent* CallFunc_AddComponent_ReturnValue;  // 0x100 (0x100)
	struct UCapsuleComponent* CallFunc_AddComponent_ReturnValue_2;  // 0x108 (0x108)
	struct FTransform CallFunc_MakeTransform_ReturnValue_3;  // 0x110 (0x110)
	struct UBoxComponent* CallFunc_AddComponent_ReturnValue_3;  // 0x170 (0x170)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.SpawnCollision
struct FSpawnCollision
{
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x0 (0x0)
	double CallFunc_BreakVector_X;  // 0x8 (0x8)
	double CallFunc_BreakVector_Y;  // 0x10 (0x10)
	double CallFunc_BreakVector_Z;  // 0x18 (0x18)
	double CallFunc_Divide_DoubleDouble_ReturnValue;  // 0x20 (0x20)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x28 (0x28)
	struct FVector CallFunc_Conv_DoubleToVector_ReturnValue;  // 0x30 (0x30)
	double CallFunc_BreakVector_X_2;  // 0x48 (0x48)
	double CallFunc_BreakVector_Y_2;  // 0x50 (0x50)
	double CallFunc_BreakVector_Z_2;  // 0x58 (0x58)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_2;  // 0x60 (0x60)
	struct FVector CallFunc_Conv_DoubleToVector_ReturnValue_2;  // 0x68 (0x68)
	struct AActor* CallFunc_GetOwner_ReturnValue;  // 0x80 (0x80)
	struct FRotator CallFunc_K2_GetActorRotation_ReturnValue;  // 0x88 (0x88)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0xA0 (0xA0)
	float CallFunc_BreakRotator_Roll;  // 0xB8 (0xB8)
	float CallFunc_BreakRotator_Pitch;  // 0xBC (0xBC)
	float CallFunc_BreakRotator_Yaw;  // 0xC0 (0xC0)
	char pad_196[4];  // 0xC4 (0xC4)
	double CallFunc_Add_DoubleDouble_ReturnValue_2;  // 0xC8 (0xC8)
	struct AActor* CallFunc_GetOwner_ReturnValue_2;  // 0xD0 (0xD0)
	double CallFunc_Add_DoubleDouble_ReturnValue_3;  // 0xD8 (0xD8)
	struct FRotator CallFunc_K2_GetActorRotation_ReturnValue_2;  // 0xE0 (0xE0)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0xF8 (0xF8)
	double CallFunc_Subtract_DoubleDouble_ReturnValue;  // 0x110 (0x110)
	struct FVector CallFunc_GetForwardVector_ReturnValue;  // 0x118 (0x118)
	struct FRotator CallFunc_MakeRotator_ReturnValue_2;  // 0x130 (0x130)
	struct FVector CallFunc_Multiply_VectorVector_ReturnValue;  // 0x148 (0x148)
	struct FVector CallFunc_GetForwardVector_ReturnValue_2;  // 0x160 (0x160)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x178 (0x178)
	struct FVector CallFunc_Multiply_VectorVector_ReturnValue_2;  // 0x190 (0x190)
	struct FVector CallFunc_Add_VectorVector_ReturnValue_2;  // 0x1A8 (0x1A8)
	double CallFunc_BreakVector_X_3;  // 0x1C0 (0x1C0)
	double CallFunc_BreakVector_Y_3;  // 0x1C8 (0x1C8)
	double CallFunc_BreakVector_Z_3;  // 0x1D0 (0x1D0)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_3;  // 0x1D8 (0x1D8)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_4;  // 0x1E0 (0x1E0)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_5;  // 0x1E8 (0x1E8)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_6;  // 0x1F0 (0x1F0)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_7;  // 0x1F8 (0x1F8)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0x200 (0x200)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_8;  // 0x218 (0x218)
	char pad_544_1 : 7;  // 0x220 (0x220)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x220 (0x220)
	char pad_545[7];  // 0x221 (0x221)
	struct AActor* CallFunc_GetOwner_ReturnValue_3;  // 0x228 (0x228)
	struct FRotator CallFunc_K2_GetActorRotation_ReturnValue_3;  // 0x230 (0x230)
	char pad_584[8];  // 0x248 (0x248)
	struct FTransform CallFunc_MakeTransform_ReturnValue;  // 0x250 (0x250)
	char pad_688_1 : 7;  // 0x2B0 (0x2B0)
	bool K2Node_SwitchEnum_CmpSuccess_2 : 1;  // 0x2B0 (0x2B0)
	char pad_689[7];  // 0x2B1 (0x2B1)
	struct UCapsuleComponent* CallFunc_AddComponent_ReturnValue;  // 0x2B8 (0x2B8)
	struct FTransform CallFunc_MakeTransform_ReturnValue_2;  // 0x2C0 (0x2C0)
	struct UCapsuleComponent* CallFunc_AddComponent_ReturnValue_2;  // 0x320 (0x320)
	char pad_808[8];  // 0x328 (0x328)
	struct FTransform CallFunc_MakeTransform_ReturnValue_3;  // 0x330 (0x330)
	struct FTransform CallFunc_MakeTransform_ReturnValue_4;  // 0x390 (0x390)
	struct UBoxComponent* CallFunc_AddComponent_ReturnValue_3;  // 0x3F0 (0x3F0)
	struct USphereComponent* CallFunc_AddComponent_ReturnValue_4;  // 0x3F8 (0x3F8)
	float CallFunc_DrawDebugCapsule_Duration_ImplicitCast;  // 0x400 (0x400)
	float CallFunc_DrawDebugSphere_Duration_ImplicitCast;  // 0x404 (0x404)
	float CallFunc_DrawDebugBox_Duration_ImplicitCast;  // 0x408 (0x408)
	float CallFunc_DrawDebugLine_Duration_ImplicitCast;  // 0x40C (0x40C)
	float CallFunc_DrawDebugLine_Duration_ImplicitCast_2;  // 0x410 (0x410)
	float CallFunc_DrawDebugLine_Duration_ImplicitCast_3;  // 0x414 (0x414)
	double CallFunc_Add_DoubleDouble_A_ImplicitCast;  // 0x418 (0x418)
	float CallFunc_MakeRotator_Yaw_ImplicitCast;  // 0x420 (0x420)
	float CallFunc_MakeRotator_Yaw_ImplicitCast_2;  // 0x424 (0x424)
	float CallFunc_DrawDebugCapsule_Radius_ImplicitCast;  // 0x428 (0x428)
	float CallFunc_DrawDebugSphere_Radius_ImplicitCast;  // 0x42C (0x42C)
	float CallFunc_DrawDebugCapsule_HalfHeight_ImplicitCast;  // 0x430 (0x430)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.SpawnFiringFX
struct FSpawnFiringFX
{
	int32_t Temp_int_Loop_Counter_Variable;  // 0x0 (0x0)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x4 (0x4)
	int32_t Temp_int_Array_Index_Variable;  // 0x8 (0x8)
	int32_t Temp_int_Array_Index_Variable_2;  // 0xC (0xC)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x10 (0x10)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x14 (0x14)
	int32_t Temp_int_Array_Index_Variable_3;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x20 (0x20)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x38 (0x38)
	struct UMaterialInstance* CallFunc_Array_Get_Item;  // 0x50 (0x50)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x58 (0x58)
	char pad_92[4];  // 0x5C (0x5C)
	struct UDecalComponent* CallFunc_SpawnDecalAtLocation_ReturnValue;  // 0x60 (0x60)
	char pad_104_1 : 7;  // 0x68 (0x68)
	bool CallFunc_LessEqual_IntInt_ReturnValue : 1;  // 0x68 (0x68)
	char pad_105[3];  // 0x69 (0x69)
	int32_t CallFunc_Array_Add_ReturnValue;  // 0x6C (0x6C)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x70 (0x70)
	int32_t Temp_int_Loop_Counter_Variable_3;  // 0x74 (0x74)
	struct UNiagaraSystem* CallFunc_Array_Get_Item_2;  // 0x78 (0x78)
	struct UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue;  // 0x80 (0x80)
	char pad_136_1 : 7;  // 0x88 (0x88)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x88 (0x88)
	char pad_137[3];  // 0x89 (0x89)
	int32_t CallFunc_Array_Add_ReturnValue_2;  // 0x8C (0x8C)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x90 (0x90)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x94 (0x94)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x98 (0x98)
	char pad_153[3];  // 0x99 (0x99)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x9C (0x9C)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool CallFunc_LessEqual_IntInt_ReturnValue_2 : 1;  // 0xA0 (0xA0)
	char pad_161[7];  // 0xA1 (0xA1)
	struct UParticleSystem* CallFunc_Array_Get_Item_3;  // 0xA8 (0xA8)
	int32_t CallFunc_Array_Length_ReturnValue_5;  // 0xB0 (0xB0)
	char pad_180[4];  // 0xB4 (0xB4)
	struct UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue;  // 0xB8 (0xB8)
	char pad_192_1 : 7;  // 0xC0 (0xC0)
	bool CallFunc_Less_IntInt_ReturnValue_3 : 1;  // 0xC0 (0xC0)
	char pad_193[3];  // 0xC1 (0xC1)
	int32_t CallFunc_Array_Add_ReturnValue_3;  // 0xC4 (0xC4)
	int32_t CallFunc_Array_Length_ReturnValue_6;  // 0xC8 (0xC8)
	char pad_204_1 : 7;  // 0xCC (0xCC)
	bool CallFunc_LessEqual_IntInt_ReturnValue_3 : 1;  // 0xCC (0xCC)


}; 
 
 // Function BP_DCAoeDefineBase_AutoActive.BP_DCAoeDefineBase_AutoActive_C.Trigger
struct FTrigger
{
	struct ADCCharacterBase* InputPin;  // 0x0 (0x0)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct ADCPlayerCharacterBase* K2Node_DynamicCast_AsDCPlayer_Character_Base;  // 0x18 (0x18)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x28 (0x28)
	char pad_216_1 : 7;  // 0xD8 (0xD8)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0xD8 (0xD8)
	char pad_217[7];  // 0xD9 (0xD9)
	struct TArray<struct FGameplayTag> CallFunc_BreakGameplayTagContainer_GameplayTags;  // 0xE0 (0xE0)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0xF0 (0xF0)
	int32_t Temp_int_Array_Index_Variable;  // 0xF4 (0xF4)
	int32_t Temp_int_Loop_Counter_Variable;  // 0xF8 (0xF8)
	char pad_252_1 : 7;  // 0xFC (0xFC)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0xFC (0xFC)
	char pad_253[3];  // 0xFD (0xFD)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData_2;  // 0x100 (0x100)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x1B0 (0x1B0)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x1B4 (0x1B4)
	struct TArray<struct FGameplayTag> CallFunc_BreakGameplayTagContainer_GameplayTags_2;  // 0x1B8 (0x1B8)
	struct FGameplayTag CallFunc_Array_Get_Item;  // 0x1C8 (0x1C8)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x1D0 (0x1D0)
	char pad_468_1 : 7;  // 0x1D4 (0x1D4)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x1D4 (0x1D4)
	char pad_469[3];  // 0x1D5 (0x1D5)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x1D8 (0x1D8)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x1DC (0x1DC)
	struct FGameplayTag CallFunc_Array_Get_Item_2;  // 0x1E0 (0x1E0)
	struct APawn* CallFunc_GetInstigator_ReturnValue;  // 0x1E8 (0x1E8)
	char pad_496_1 : 7;  // 0x1F0 (0x1F0)
	bool CallFunc_EqualEqual_ObjectObject_ReturnValue : 1;  // 0x1F0 (0x1F0)


}; 
 
 