#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_DeathSwarm.BP_DeathSwarm_C.ExecuteUbergraph_BP_DeathSwarm
struct FExecuteUbergraph_BP_DeathSwarm
{
	int32_t EntryPoint;  // 0x0 (0x0)
	float CallFunc_GetShapeScale_ReturnValue;  // 0x4 (0x4)
	float CallFunc_GetShapeScale_ReturnValue_2;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x10 (0x10)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_2;  // 0x18 (0x18)
	float K2Node_Event_DeltaSeconds;  // 0x20 (0x20)
	float CallFunc_GetShapeScale_ReturnValue_3;  // 0x24 (0x24)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_3;  // 0x28 (0x28)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_4;  // 0x30 (0x30)
	double CallFunc_Multiply_DoubleDouble_B_ImplicitCast;  // 0x38 (0x38)
	double CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2;  // 0x40 (0x40)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast;  // 0x48 (0x48)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_2;  // 0x4C (0x4C)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_3;  // 0x50 (0x50)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_4;  // 0x54 (0x54)
	float CallFunc_SetVariableFloat_InValue_ImplicitCast;  // 0x58 (0x58)
	char pad_92[4];  // 0x5C (0x5C)
	double CallFunc_Multiply_DoubleDouble_B_ImplicitCast_3;  // 0x60 (0x60)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_5;  // 0x68 (0x68)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_6;  // 0x6C (0x6C)
	float CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x70 (0x70)


}; 
 
 // Function BP_DeathSwarm.BP_DeathSwarm_C.UserConstructionScript
struct FUserConstructionScript : FUserConstructionScript
{
	float CallFunc_GetShapeScale_ReturnValue;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x8 (0x8)
	float CallFunc_GetShapeScale_ReturnValue_2;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue;  // 0x18 (0x18)
	double CallFunc_Divide_DoubleDouble_ReturnValue;  // 0x20 (0x20)
	struct FVector CallFunc_Conv_DoubleToVector_ReturnValue;  // 0x28 (0x28)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_2;  // 0x40 (0x40)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_3;  // 0x48 (0x48)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_4;  // 0x50 (0x50)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_2;  // 0x58 (0x58)
	double CallFunc_Multiply_DoubleDouble_B_ImplicitCast;  // 0x60 (0x60)
	float CallFunc_SetVariableFloat_InValue_ImplicitCast;  // 0x68 (0x68)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast;  // 0x6C (0x6C)
	double CallFunc_Multiply_DoubleDouble_B_ImplicitCast_2;  // 0x70 (0x70)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_2;  // 0x78 (0x78)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_3;  // 0x7C (0x7C)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_4;  // 0x80 (0x80)
	float CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x84 (0x84)
	float CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x88 (0x88)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_5;  // 0x8C (0x8C)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_6;  // 0x90 (0x90)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_7;  // 0x94 (0x94)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_8;  // 0x98 (0x98)


}; 
 
 // Function BP_DeathSwarm.BP_DeathSwarm_C.ReceiveTick
// Size: 0x4(Inherited: 0x4)
struct FReceiveTick : FReceiveTick
{
	float DeltaSeconds;  // 0x0 (0x0)


}; 
 
 