#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_DoubleAxe_Unique.BP_DoubleAxe_Unique_C.ExecuteUbergraph_BP_DoubleAxe_Unique
struct FExecuteUbergraph_BP_DoubleAxe_Unique
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue;  // 0x8 (0x8)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_2;  // 0x10 (0x10)
	double CallFunc_GetTimeSeconds_ReturnValue;  // 0x18 (0x18)
	double CallFunc_GetTimeSeconds_ReturnValue_2;  // 0x20 (0x20)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast;  // 0x28 (0x28)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_2;  // 0x2C (0x2C)


}; 
 
 