#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_DungeonDown.BP_DungeonDown_C.OnDungeonExitOverlapped
// Size: 0x22(Inherited: 0x9)
struct FOnDungeonExitOverlapped : FOnDungeonExitOverlapped
{
	struct ADCPlayerCharacterBase* PlayerCharacter;  // 0x0 (0x0)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool bResult : 1;  // 0x8 (0x8)
	struct AController* CallFunc_GetController_ReturnValue;  // 0x10 (0x10)
	struct ADCPlayerController* K2Node_DynamicCast_AsDCPlayer_Controller;  // 0x18 (0x18)
	char pad_34_1 : 7;  // 0x22 (0x22)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x20 (0x20)
	char pad_35_1 : 7;  // 0x23 ([x23)
	bool CallFunc_OnDungeonDownOverlapped_ReturnValue : 1;  // 001069279] ted: 0x9)
 (001069279] ted: 0x9)
)


}; 
 
 