#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_FootTrace.BP_FootTrace_C.BndEvt__BP_Footprint_DCTagCollisionDetector_K2Node_ComponentBoundEvent_0_GameplayTagCollisionDetectedSignature__DelegateSignature
struct FBndEvt__BP_Footprint_DCTagCollisionDetector_K2Node_ComponentBoundEvent_0_GameplayTagCollisionDetectedSignature__DelegateSignature
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bDetected : 1;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FAccountDataReplication AccountDataReplication;  // 0x8 (0x8)


}; 
 
 // Function BP_FootTrace.BP_FootTrace_C.ReceiveTick
// Size: 0x4(Inherited: 0x4)
struct FReceiveTick : FReceiveTick
{
	float DeltaSeconds;  // 0x0 (0x0)


}; 
 
 // Function BP_FootTrace.BP_FootTrace_C.ExecuteUbergraph_BP_FootTrace
struct FExecuteUbergraph_BP_FootTrace
{
	int32_t EntryPoint;  // 0x0 (0x0)
	float CallFunc_BreakRotator_Roll;  // 0x4 (0x4)
	float CallFunc_BreakRotator_Pitch;  // 0x8 (0x8)
	float CallFunc_BreakRotator_Yaw;  // 0xC (0xC)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x10 (0x10)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0x20 (0x20)
	struct FHitResult CallFunc_K2_AddActorWorldRotation_SweepHitResult;  // 0x38 (0x38)
	char pad_288_1 : 7;  // 0x120 (0x120)
	bool K2Node_ComponentBoundEvent_bDetected : 1;  // 0x120 (0x120)
	char pad_289[7];  // 0x121 (0x121)
	struct FAccountDataReplication K2Node_ComponentBoundEvent_AccountDataReplication;  // 0x128 (0x128)
	char pad_416_1 : 7;  // 0x1A0 (0x1A0)
	bool CallFunc_IsEmpty_ReturnValue : 1;  // 0x1A0 (0x1A0)
	char pad_417_1 : 7;  // 0x1A1 (0x1A1)
	bool CallFunc_Not_PreBool_ReturnValue : 1;  // 0x1A1 (0x1A1)
	char pad_418_1 : 7;  // 0x1A2 (0x1A2)
	bool CallFunc_Not_PreBool_ReturnValue_2 : 1;  // 0x1A2 (0x1A2)
	char pad_419_1 : 7;  // 0x1A3 (0x1A3)
	bool CallFunc_EqualEqual_StrStr_ReturnValue : 1;  // 0x1A3 (0x1A3)
	char pad_420_1 : 7;  // 0x1A4 (0x1A4)
	bool CallFunc_EqualEqual_StrStr_ReturnValue_2 : 1;  // 0x1A4 (0x1A4)
	char pad_421[3];  // 0x1A5 (0x1A5)
	float K2Node_Event_DeltaSeconds;  // 0x1A8 (0x1A8)
	int32_t CallFunc_Conv_BoolToInt_ReturnValue;  // 0x1AC (0x1AC)
	double CallFunc_Subtract_DoubleDouble_ReturnValue;  // 0x1B0 (0x1B0)
	struct UMaterialInstance* CallFunc_Map_Find_Value;  // 0x1B8 (0x1B8)
	char pad_448_1 : 7;  // 0x1C0 (0x1C0)
	bool CallFunc_Map_Find_ReturnValue : 1;  // 0x1C0 (0x1C0)
	char pad_449[7];  // 0x1C1 (0x1C1)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue;  // 0x1C8 (0x1C8)
	double CallFunc_RandomFloat_ReturnValue;  // 0x1D0 (0x1D0)
	double CallFunc_Divide_DoubleDouble_ReturnValue;  // 0x1D8 (0x1D8)
	char pad_480_1 : 7;  // 0x1E0 (0x1E0)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue : 1;  // 0x1E0 (0x1E0)
	char pad_481[3];  // 0x1E1 (0x1E1)
	struct FLinearColor CallFunc_LinearColorLerp_ReturnValue;  // 0x1E4 (0x1E4)
	char pad_500[4];  // 0x1F4 (0x1F4)
	double CallFunc_Add_DoubleDouble_A_ImplicitCast;  // 0x1F8 (0x1F8)
	float CallFunc_MakeRotator_Yaw_ImplicitCast;  // 0x200 (0x200)
	char pad_516[4];  // 0x204 (0x204)
	double CallFunc_Subtract_DoubleDouble_B_ImplicitCast;  // 0x208 (0x208)
	float CallFunc_LinearColorLerp_Alpha_ImplicitCast;  // 0x210 (0x210)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast;  // 0x214 (0x214)


}; 
 
 