#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_Flute.BP_Flute_C.ExecuteUbergraph_BP_Flute
struct FExecuteUbergraph_BP_Flute
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x4 (0x4)
	int32_t K2Node_Event_InCount;  // 0xC (0xC)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_MatchesTag_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool CallFunc_EqualEqual_IntInt_ReturnValue : 1;  // 0x11 (0x11)


}; 
 
 // Function BP_Flute.BP_Flute_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 