#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_FloorPortalScrollDown.BP_FloorPortalScrollDown_C.ExecuteUbergraph_BP_FloorPortalScrollDown
struct FExecuteUbergraph_BP_FloorPortalScrollDown
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FDelegate Temp_delegate_Variable;  // 0x4 (0x4)
	struct FDelegate Temp_delegate_Variable_2;  // 0x14 (0x14)
	char pad_36_1 : 7;  // 0x24 (0x24)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x24 (0x24)
	char pad_37_1 : 7;  // 0x25 (0x25)
	bool CallFunc_HasAuthority_ReturnValue_2 : 1;  // 0x25 (0x25)
	char pad_38_1 : 7;  // 0x26 (0x26)
	bool CallFunc_HasAuthority_ReturnValue_3 : 1;  // 0x26 (0x26)
	char pad_39_1 : 7;  // 0x27 (0x27)
	bool K2Node_CustomEvent_bOpen : 1;  // 0x27 (0x27)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool CallFunc_HasAuthority_ReturnValue_4 : 1;  // 0x28 (0x28)
	char pad_41[3];  // 0x29 (0x29)
	int32_t CallFunc_PostEvent_ReturnValue;  // 0x2C (0x2C)
	int32_t CallFunc_PostEvent_ReturnValue_2;  // 0x30 (0x30)


}; 
 
 // Function BP_FloorPortalScrollDown.BP_FloorPortalScrollDown_C.PlayPortalFX
struct FPlayPortalFX
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bOpen : 1;  // 0x0 (0x0)


}; 
 
 