#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_GhostKing_Common.BP_GhostKing_Common_C.Reset Variables
struct FReset Variables
{
	int32_t Temp_int_Array_Index_Variable;  // 0x0 (0x0)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x4 (0x4)
	struct ADCMonsterBase* CallFunc_Array_Get_Item;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x14 (0x14)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x18 (0x18)
	char pad_28_1 : 7;  // 0x1C (0x1C)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x1C (0x1C)
	char pad_29_1 : 7;  // 0x1D (0x1D)
	bool CallFunc_RemoveGameplayTag_ReturnValue : 1;  // 0x1D (0x1D)
	char pad_30[2];  // 0x1E (0x1E)
	struct FName CallFunc_MakeLiteralName_ReturnValue;  // 0x20 (0x20)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue;  // 0x28 (0x28)
	struct FName CallFunc_MakeLiteralName_ReturnValue_2;  // 0x30 (0x30)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_2;  // 0x38 (0x38)
	struct FName CallFunc_MakeLiteralName_ReturnValue_3;  // 0x40 (0x40)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_3;  // 0x48 (0x48)


}; 
 
 // Function BP_GhostKing_Common.BP_GhostKing_Common_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 // Function BP_GhostKing_Common.BP_GhostKing_Common_C.Check Combat To Comeback
// Size: 0x69(Inherited: 0x9)
struct FCheck Combat To Comeback : FCheck Combat To Comeback
{
	int32_t Temp_int_Loop_Counter_Variable;  // 0x0 (0x0)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x4 (0x4)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x8 (0x8)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0xC (0xC)
	int32_t Temp_int_Array_Index_Variable;  // 0x10 (0x10)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x14 (0x14)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0x18 (0x18)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_2;  // 0x20 (0x20)
	int32_t CallFunc_Array_AddUnique_ReturnValue;  // 0x28 (0x28)
	int32_t CallFunc_Array_AddUnique_ReturnValue_2;  // 0x2C (0x2C)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;  // 0x30 (0x30)
	char pad_73_1 : 7;  // 0x49 (0x49)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // 0x40 (0x40)
	char pad_74_1 : 7;  // 0x4A (0x4A)
	bool CallFunc_Array_RemoveItem_ReturnValue : 1;  // 0x41 (0x41)
	char pad_75_1 : 7;  // 0x4B (0x4B)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x42 (0x42)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x48 (0x48)
	char pad_92_1 : 7;  // 0x5C (0x5C)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_2 : 1;  // 0x58 (0x58)
	char pad_93_1 : 7;  // 0x5D (0x5D)
	bool CallFunc_Array_RemoveItem_ReturnValue_2 : 1;  // 0x59 (0x59)
	char pad_94_1 : 7;  // 0x5E (0x5E)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x5A (0x5A)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x5C (0x5C)
	char pad_99_1 : 7;  // 0x63 (0x63)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x60 (0x60)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x64 (0x64)
	char pad_104_1 : 7;  // 0x68 (0x68)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x68 (0x68)


}; 
 
 // Function BP_GhostKing_Common.BP_GhostKing_Common_C.BndEvt__BP_Lich_DCGameObjectLink_K2Node_ComponentBoundEvent_3_DCGameObjectLinkComponentUMsgGameLinkerRequest__DelegateSignature
// Size: 0xB8(Inherited: 0xB8)
struct FBndEvt__BP_Lich_DCGameObjectLink_K2Node_ComponentBoundEvent_3_DCGameObjectLinkComponentUMsgGameLinkerRequest__DelegateSignature : FBndEvt__BP_Lich_DCGameObjectLink_K2Node_ComponentBoundEvent_3_DCGameObjectLinkComponentUMsgGameLinkerRequest__DelegateSignature
{
	struct FObjectLinkRequestEvent RecvEvent;  // 0x0 (0x0)
	struct UObjectLinkMetaDataBlueprint* SendEventParam;  // 0xB0 (0xB0)


}; 
 
 // Function BP_GhostKing_Common.BP_GhostKing_Common_C.Add Soulstolen Tag After Comeback
struct FAdd Soulstolen Tag After Comeback
{
	int32_t Temp_int_Loop_Counter_Variable;  // 0x0 (0x0)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x4 (0x4)
	int32_t Temp_int_Array_Index_Variable;  // 0x8 (0x8)
	int32_t Temp_int_Array_Index_Variable_2;  // 0xC (0xC)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x10 (0x10)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x14 (0x14)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0x18 (0x18)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_2;  // 0x20 (0x20)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool CallFunc_AddGameplayTag_ReturnValue : 1;  // 0x28 (0x28)
	char pad_41_1 : 7;  // 0x29 (0x29)
	bool CallFunc_AddGameplayTag_ReturnValue_2 : 1;  // 0x29 (0x29)
	char pad_42[6];  // 0x2A (0x2A)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;  // 0x30 (0x30)
	char pad_64_1 : 7;  // 0x40 (0x40)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // 0x40 (0x40)
	char pad_65[7];  // 0x41 (0x41)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x48 (0x48)
	char pad_88_1 : 7;  // 0x58 (0x58)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_2 : 1;  // 0x58 (0x58)
	char pad_89[7];  // 0x59 (0x59)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_3;  // 0x60 (0x60)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_3 : 1;  // 0x70 (0x70)
	char pad_113[7];  // 0x71 (0x71)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_4;  // 0x78 (0x78)
	char pad_136_1 : 7;  // 0x88 (0x88)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_4 : 1;  // 0x88 (0x88)
	char pad_137[3];  // 0x89 (0x89)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x8C (0x8C)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x90 (0x90)
	char pad_148_1 : 7;  // 0x94 (0x94)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x94 (0x94)
	char pad_149_1 : 7;  // 0x95 (0x95)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x95 (0x95)


}; 
 
 // Function BP_GhostKing_Common.BP_GhostKing_Common_C.ExecuteUbergraph_BP_GhostKing_Common
struct FExecuteUbergraph_BP_GhostKing_Common
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_Normal_ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	int32_t Temp_int_Variable;  // 0x8 (0x8)
	int32_t Temp_int_Variable_2;  // 0xC (0xC)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool CallFunc_HasAuthority_ReturnValue_2 : 1;  // 0x11 (0x11)
	char pad_18[6];  // 0x12 (0x12)
	struct FMsgGASActorDieNotify Temp_struct_Variable;  // 0x18 (0x18)
	int32_t Temp_int_Array_Index_Variable;  // 0x218 (0x218)
	char pad_540[4];  // 0x21C (0x21C)
	struct ADCMonsterBase* CallFunc_Array_Get_Item;  // 0x220 (0x220)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x228 (0x228)
	char pad_556_1 : 7;  // 0x22C (0x22C)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x22C (0x22C)
	char pad_557[3];  // 0x22D (0x22D)
	int32_t Temp_int_Variable_3;  // 0x230 (0x230)
	char pad_564[4];  // 0x234 (0x234)
	double CallFunc_Conv_IntToDouble_ReturnValue;  // 0x238 (0x238)
	char pad_576_1 : 7;  // 0x240 (0x240)
	bool CallFunc_LessEqual_IntInt_ReturnValue : 1;  // 0x240 (0x240)
	char pad_577[3];  // 0x241 (0x241)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x244 (0x244)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x248 (0x248)
	int32_t K2Node_Event_InCount;  // 0x250 (0x250)
	char pad_596_1 : 7;  // 0x254 (0x254)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x254 (0x254)
	char pad_597[3];  // 0x255 (0x255)
	struct UAnimInstance* CallFunc_GetAnimInstance_ReturnValue;  // 0x258 (0x258)
	struct UABP_GhostKing_C* K2Node_DynamicCast_AsABP_Ghost_King;  // 0x260 (0x260)
	char pad_616_1 : 7;  // 0x268 (0x268)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x268 (0x268)
	char pad_617_1 : 7;  // 0x269 (0x269)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess : 1;  // 0x269 (0x269)
	char pad_618_1 : 7;  // 0x26A (0x26A)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2 : 1;  // 0x26A (0x26A)
	char pad_619[5];  // 0x26B (0x26B)
	struct UAnimInstance* CallFunc_GetAnimInstance_ReturnValue_2;  // 0x270 (0x270)
	struct UABP_GhostKing_C* K2Node_DynamicCast_AsABP_Ghost_King_2;  // 0x278 (0x278)
	char pad_640_1 : 7;  // 0x280 (0x280)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x280 (0x280)
	char pad_641[7];  // 0x281 (0x281)
	double CallFunc_Get_BB_HPRatio_HPRatio;  // 0x288 (0x288)
	double CallFunc_Conv_IntToDouble_ReturnValue_2;  // 0x290 (0x290)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x298 (0x298)
	double CallFunc_Subtract_DoubleDouble_ReturnValue;  // 0x2A0 (0x2A0)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x2A8 (0x2A8)
	char pad_684[4];  // 0x2AC (0x2AC)
	struct FObjectLinkRequestEvent K2Node_ComponentBoundEvent_RecvEvent;  // 0x2B0 (0x2B0)
	struct UObjectLinkMetaDataBlueprint* K2Node_ComponentBoundEvent_SendEventParam;  // 0x360 (0x360)
	char pad_872_1 : 7;  // 0x368 (0x368)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x368 (0x368)
	char pad_873[3];  // 0x369 (0x369)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x36C (0x36C)
	char pad_880_1 : 7;  // 0x370 (0x370)
	bool CallFunc_LinkEventBase_Result : 1;  // 0x370 (0x370)
	char pad_881_1 : 7;  // 0x371 (0x371)
	bool CallFunc_RemoveGameplayTag_ReturnValue : 1;  // 0x371 (0x371)
	char pad_882_1 : 7;  // 0x372 (0x372)
	bool CallFunc_RemoveGameplayTag_ReturnValue_2 : 1;  // 0x372 (0x372)
	char pad_883_1 : 7;  // 0x373 (0x373)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x373 (0x373)
	char pad_884[4];  // 0x374 (0x374)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue;  // 0x378 (0x378)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue;  // 0x380 (0x380)
	char pad_900_1 : 7;  // 0x384 (0x384)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // 0x384 (0x384)
	char pad_901[3];  // 0x385 (0x385)
	struct FVector CallFunc_Conv_FloatToVector_ReturnValue;  // 0x388 (0x388)
	struct ADCMonsterBase* CallFunc_SpawnMonster_ReturnValue;  // 0x3A0 (0x3A0)
	struct ABP_GhostKing_SmallGhost_C* K2Node_DynamicCast_AsBP_Ghost_King_Small_Ghost;  // 0x3A8 (0x3A8)
	char pad_944_1 : 7;  // 0x3B0 (0x3B0)
	bool K2Node_DynamicCast_bSuccess_3 : 1;  // 0x3B0 (0x3B0)
	char pad_945[7];  // 0x3B1 (0x3B1)
	struct TScriptInterface<IBaseInterface> CallFunc_BindMsgNode_BaseInterface_CastInput;  // 0x3B8 (0x3B8)
	struct UBindMsgNode* CallFunc_BindMsgNode_ReturnValue;  // 0x3C8 (0x3C8)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x3D0 (0x3D0)
	char pad_980_1 : 7;  // 0x3D4 (0x3D4)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x3D4 (0x3D4)
	char pad_981_1 : 7;  // 0x3D5 (0x3D5)
	bool CallFunc_Array_RemoveItem_ReturnValue : 1;  // 0x3D5 (0x3D5)
	char pad_982[2];  // 0x3D6 (0x3D6)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x3D8 (0x3D8)
	char pad_988[4];  // 0x3DC (0x3DC)
	struct UMsgBaseNode* Temp_object_Variable;  // 0x3E0 (0x3E0)
	char pad_1000_1 : 7;  // 0x3E8 (0x3E8)
	bool CallFunc_GetPayload_ReturnValue : 1;  // 0x3E8 (0x3E8)
	char pad_1001[7];  // 0x3E9 (0x3E9)
	struct FMsgGASActorDieNotify Temp_struct_Variable_2;  // 0x3F0 (0x3F0)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x5F0 (0x5F0)
	struct FTransform CallFunc_GetTransform_ReturnValue;  // 0x600 (0x600)
	struct FVector CallFunc_BreakTransform_Location;  // 0x660 (0x660)
	struct FRotator CallFunc_BreakTransform_Rotation;  // 0x678 (0x678)
	struct FVector CallFunc_BreakTransform_Scale;  // 0x690 (0x690)
	float CallFunc_BreakRotator_Roll;  // 0x6A8 (0x6A8)
	float CallFunc_BreakRotator_Pitch;  // 0x6AC (0x6AC)
	float CallFunc_BreakRotator_Yaw;  // 0x6B0 (0x6B0)
	char pad_1716[4];  // 0x6B4 (0x6B4)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x6B8 (0x6B8)
	int32_t CallFunc_Array_AddUnique_ReturnValue;  // 0x6C0 (0x6C0)
	char pad_1732[4];  // 0x6C4 (0x6C4)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0x6C8 (0x6C8)
	struct FVector CallFunc_GetForwardVector_ReturnValue;  // 0x6E0 (0x6E0)
	struct FVector CallFunc_Multiply_VectorVector_ReturnValue;  // 0x6F8 (0x6F8)
	struct UMsgBaseNode* K2Node_CustomEvent_ProxyObject;  // 0x710 (0x710)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x718 (0x718)
	struct FRotator CallFunc_FindLookAtRotation_ReturnValue;  // 0x730 (0x730)
	char pad_1864[8];  // 0x748 (0x748)
	struct FTransform CallFunc_MakeTransform_ReturnValue;  // 0x750 (0x750)
	char pad_1968_1 : 7;  // 0x7B0 (0x7B0)
	bool CallFunc_EqualEqual_IntInt_ReturnValue : 1;  // 0x7B0 (0x7B0)
	char pad_1969[7];  // 0x7B1 (0x7B1)
	struct AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue;  // 0x7B8 (0x7B8)
	struct ABP_GameSpawner_C* CallFunc_FinishSpawningActor_ReturnValue;  // 0x7C0 (0x7C0)
	char pad_1992_1 : 7;  // 0x7C8 (0x7C8)
	bool CallFunc_AddGameplayTag_ReturnValue : 1;  // 0x7C8 (0x7C8)
	char pad_1993_1 : 7;  // 0x7C9 (0x7C9)
	bool CallFunc_RemoveGameplayTag_ReturnValue_3 : 1;  // 0x7C9 (0x7C9)
	char pad_1994[6];  // 0x7CA (0x7CA)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue;  // 0x7D0 (0x7D0)
	double CallFunc_Add_DoubleDouble_A_ImplicitCast;  // 0x8A8 (0x8A8)
	float CallFunc_MakeRotator_Yaw_ImplicitCast;  // 0x8B0 (0x8B0)


}; 
 
 // Function BP_GhostKing_Common.BP_GhostKing_Common_C.Remove Curse
struct FRemove Curse
{
	int32_t Temp_int_Loop_Counter_Variable;  // 0x0 (0x0)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x4 (0x4)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x8 (0x8)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0xC (0xC)
	int32_t Temp_int_Loop_Counter_Variable_3;  // 0x10 (0x10)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x14 (0x14)
	int32_t Temp_int_Array_Index_Variable;  // 0x18 (0x18)
	int32_t Temp_int_Loop_Counter_Variable_4;  // 0x1C (0x1C)
	int32_t CallFunc_Add_IntInt_ReturnValue_4;  // 0x20 (0x20)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x24 (0x24)
	int32_t Temp_int_Array_Index_Variable_3;  // 0x28 (0x28)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x2C (0x2C)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0x30 (0x30)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x38 (0x38)
	char pad_57_1 : 7;  // 0x39 (0x39)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x39 (0x39)
	char pad_58[6];  // 0x3A (0x3A)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue;  // 0x40 (0x40)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue;  // 0x48 (0x48)
	int32_t Temp_int_Array_Index_Variable_4;  // 0x4C (0x4C)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_2;  // 0x50 (0x50)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x58 (0x58)
	char pad_92_1 : 7;  // 0x5C (0x5C)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x5C (0x5C)
	char pad_93_1 : 7;  // 0x5D (0x5D)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x5D (0x5D)
	char pad_94[2];  // 0x5E (0x5E)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x60 (0x60)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_2;  // 0x68 (0x68)
	char pad_108[4];  // 0x6C (0x6C)
	struct ABP_DCMonsterBaseWithOptions_C* CallFunc_Array_Get_Item_3;  // 0x70 (0x70)
	struct AActor* CallFunc_Array_Get_Item_4;  // 0x78 (0x78)
	char pad_128_1 : 7;  // 0x80 (0x80)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x80 (0x80)
	char pad_129[7];  // 0x81 (0x81)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x88 (0x88)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_3;  // 0x90 (0x90)
	char pad_148_1 : 7;  // 0x94 (0x94)
	bool CallFunc_IsValid_ReturnValue_4 : 1;  // 0x94 (0x94)
	char pad_149[3];  // 0x95 (0x95)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x98 (0x98)
	char pad_156_1 : 7;  // 0x9C (0x9C)
	bool CallFunc_Less_IntInt_ReturnValue_3 : 1;  // 0x9C (0x9C)
	char pad_157[3];  // 0x9D (0x9D)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0xA0 (0xA0)
	char pad_164_1 : 7;  // 0xA4 (0xA4)
	bool CallFunc_Less_IntInt_ReturnValue_4 : 1;  // 0xA4 (0xA4)


}; 
 
 // Function BP_GhostKing_Common.BP_GhostKing_Common_C.OnMessageReceived_75F8964240716405A440888646BEC122
struct FOnMessageReceived_75F8964240716405A440888646BEC122
{
	struct UMsgBaseNode* ProxyObject;  // 0x0 (0x0)


}; 
 
 