#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_GoblinMage.BP_GoblinMage_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 // Function BP_GoblinMage.BP_GoblinMage_C.ExecuteUbergraph_BP_GoblinMage
struct FExecuteUbergraph_BP_GoblinMage
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x4 (0x4)
	int32_t K2Node_Event_InCount;  // 0xC (0xC)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess : 1;  // 0x11 (0x11)
	char pad_18[6];  // 0x12 (0x12)
	struct UAnimInstance* CallFunc_GetAnimInstance_ReturnValue;  // 0x18 (0x18)
	struct UABP_GoblinMage_C* K2Node_DynamicCast_AsABP_Goblin_Mage;  // 0x20 (0x20)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)
	struct UABP_GoblinMage_C* K2Node_DynamicCast_AsABP_Goblin_Mage_2;  // 0x30 (0x30)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x38 (0x38)


}; 
 
 