#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_GiantSpider_CobWeb.BP_GiantSpider_CobWeb_C.ExecuteUbergraph_BP_GiantSpider_CobWeb
struct FExecuteUbergraph_BP_GiantSpider_CobWeb
{
	int32_t EntryPoint;  // 0x0 (0x0)
	int32_t Temp_int_Variable;  // 0x4 (0x4)
	struct ABP_GiantSpider_C* K2Node_DynamicCast_AsBP_Giant_Spider;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue;  // 0x18 (0x18)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x20 (0x20)
	char pad_36[4];  // 0x24 (0x24)
	struct UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_2;  // 0x28 (0x28)
	double CallFunc_GetTimeSeconds_ReturnValue;  // 0x30 (0x30)
	double CallFunc_GetTimeSeconds_ReturnValue_2;  // 0x38 (0x38)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast;  // 0x40 (0x40)
	float CallFunc_SetScalarParameterValue_Value_ImplicitCast_2;  // 0x44 (0x44)


}; 
 
 