#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_GiantBat.BP_GiantBat_C.ExecuteUbergraph_BP_GiantBat
struct FExecuteUbergraph_BP_GiantBat
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x8 (0x8)
	int32_t K2Node_Event_InCount;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)
	struct TArray<struct AActor*> Temp_object_Variable;  // 0x18 (0x18)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x28 (0x28)
	char pad_41_1 : 7;  // 0x29 (0x29)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess : 1;  // 0x29 (0x29)
	char pad_42_1 : 7;  // 0x2A (0x2A)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2 : 1;  // 0x2A (0x2A)
	char pad_43[5];  // 0x2B (0x2B)
	struct TArray<enum class EObjectTypeQuery> K2Node_MakeArray_Array;  // 0x30 (0x30)
	struct TArray<struct AActor*> Temp_object_Variable_2;  // 0x40 (0x40)
	struct AAIController* CallFunc_GetAIController_ReturnValue;  // 0x50 (0x50)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue;  // 0x58 (0x58)
	struct UAIPerceptionComponent* CallFunc_GetAIPerceptionComponent_ReturnValue;  // 0x70 (0x70)
	double CallFunc_BreakVector_X;  // 0x78 (0x78)
	double CallFunc_BreakVector_Y;  // 0x80 (0x80)
	double CallFunc_BreakVector_Z;  // 0x88 (0x88)
	double CallFunc_Subtract_DoubleDouble_ReturnValue;  // 0x90 (0x90)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_2;  // 0x98 (0x98)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0xB0 (0xB0)
	double CallFunc_BreakVector_X_2;  // 0xC8 (0xC8)
	double CallFunc_BreakVector_Y_2;  // 0xD0 (0xD0)
	double CallFunc_BreakVector_Z_2;  // 0xD8 (0xD8)
	struct FHitResult CallFunc_LineTraceSingleForObjects_OutHit;  // 0xE0 (0xE0)
	char pad_456_1 : 7;  // 0x1C8 (0x1C8)
	bool CallFunc_LineTraceSingleForObjects_ReturnValue : 1;  // 0x1C8 (0x1C8)
	char pad_457_1 : 7;  // 0x1C9 (0x1C9)
	bool CallFunc_BreakHitResult_bBlockingHit : 1;  // 0x1C9 (0x1C9)
	char pad_458_1 : 7;  // 0x1CA (0x1CA)
	bool CallFunc_BreakHitResult_bInitialOverlap : 1;  // 0x1CA (0x1CA)
	char pad_459[1];  // 0x1CB (0x1CB)
	float CallFunc_BreakHitResult_Time;  // 0x1CC (0x1CC)
	float CallFunc_BreakHitResult_Distance;  // 0x1D0 (0x1D0)
	char pad_468[4];  // 0x1D4 (0x1D4)
	struct FVector CallFunc_BreakHitResult_Location;  // 0x1D8 (0x1D8)
	struct FVector CallFunc_BreakHitResult_ImpactPoint;  // 0x1F0 (0x1F0)
	struct FVector CallFunc_BreakHitResult_Normal;  // 0x208 (0x208)
	struct FVector CallFunc_BreakHitResult_ImpactNormal;  // 0x220 (0x220)
	struct UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat;  // 0x238 (0x238)
	struct AActor* CallFunc_BreakHitResult_HitActor;  // 0x240 (0x240)
	struct UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent;  // 0x248 (0x248)
	struct FName CallFunc_BreakHitResult_HitBoneName;  // 0x250 (0x250)
	struct FName CallFunc_BreakHitResult_BoneName;  // 0x258 (0x258)
	int32_t CallFunc_BreakHitResult_HitItem;  // 0x260 (0x260)
	int32_t CallFunc_BreakHitResult_ElementIndex;  // 0x264 (0x264)
	int32_t CallFunc_BreakHitResult_FaceIndex;  // 0x268 (0x268)
	char pad_620[4];  // 0x26C (0x26C)
	struct FVector CallFunc_BreakHitResult_TraceStart;  // 0x270 (0x270)
	struct FVector CallFunc_BreakHitResult_TraceEnd;  // 0x288 (0x288)
	int32_t CallFunc_Get_BB_Phase_Phase;  // 0x2A0 (0x2A0)
	char pad_676[4];  // 0x2A4 (0x2A4)
	double CallFunc_BreakVector_X_3;  // 0x2A8 (0x2A8)
	double CallFunc_BreakVector_Y_3;  // 0x2B0 (0x2B0)
	double CallFunc_BreakVector_Z_3;  // 0x2B8 (0x2B8)
	int32_t CallFunc_RandomIntegerInRange_ReturnValue;  // 0x2C0 (0x2C0)
	char pad_708[4];  // 0x2C4 (0x2C4)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_2;  // 0x2C8 (0x2C8)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x2D0 (0x2D0)
	char pad_724[4];  // 0x2D4 (0x2D4)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x2D8 (0x2D8)
	char pad_736_1 : 7;  // 0x2E0 (0x2E0)
	bool CallFunc_SetSightRange_ReturnValue : 1;  // 0x2E0 (0x2E0)
	char pad_737[3];  // 0x2E1 (0x2E1)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x2E4 (0x2E4)
	char pad_756[4];  // 0x2F4 (0x2F4)
	struct TArray<enum class EObjectTypeQuery> K2Node_MakeArray_Array_2;  // 0x2F8 (0x2F8)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x308 (0x308)
	char pad_800_1 : 7;  // 0x320 (0x320)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // 0x320 (0x320)
	char pad_801[7];  // 0x321 (0x321)
	double CallFunc_BreakVector_X_4;  // 0x328 (0x328)
	double CallFunc_BreakVector_Y_4;  // 0x330 (0x330)
	double CallFunc_BreakVector_Z_4;  // 0x338 (0x338)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_3;  // 0x340 (0x340)
	double CallFunc_GetWorldDeltaSeconds_ReturnValue;  // 0x348 (0x348)
	struct FVector CallFunc_MakeVector_ReturnValue_2;  // 0x350 (0x350)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue;  // 0x368 (0x368)
	struct FHitResult CallFunc_LineTraceSingleForObjects_OutHit_2;  // 0x370 (0x370)
	char pad_1112_1 : 7;  // 0x458 (0x458)
	bool CallFunc_LineTraceSingleForObjects_ReturnValue_2 : 1;  // 0x458 (0x458)
	char pad_1113[7];  // 0x459 (0x459)
	struct FVector CallFunc_GetUpVector_ReturnValue;  // 0x460 (0x460)
	float CallFunc_SetSightRange_SightRange_ImplicitCast;  // 0x478 (0x478)
	float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;  // 0x47C (0x47C)


}; 
 
 // Function BP_GiantBat.BP_GiantBat_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 