#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_GiantSpider.BP_GiantSpider_C.ExecuteUbergraph_BP_GiantSpider
struct FExecuteUbergraph_BP_GiantSpider
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x4 (0x4)
	int32_t K2Node_Event_InCount;  // 0xC (0xC)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess : 1;  // 0x11 (0x11)
	char pad_18_1 : 7;  // 0x12 (0x12)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2 : 1;  // 0x12 (0x12)
	char pad_19_1 : 7;  // 0x13 (0x13)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x13 (0x13)
	char pad_20[4];  // 0x14 (0x14)
	double CallFunc_Get_BB_Probability_Probability;  // 0x18 (0x18)
	double CallFunc_Subtract_DoubleDouble_ReturnValue;  // 0x20 (0x20)
	double CallFunc_Get_BB_Probability_Probability_2;  // 0x28 (0x28)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function BP_GiantSpider.BP_GiantSpider_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 