#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_GiantWorm_PoisonArea.BP_GiantWorm_PoisonArea_C.ExecuteUbergraph_BP_GiantWorm_PoisonArea
struct FExecuteUbergraph_BP_GiantWorm_PoisonArea
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FDelegate Temp_delegate_Variable;  // 0x4 (0x4)
	struct FDelegate Temp_delegate_Variable_2;  // 0x14 (0x14)
	int32_t CallFunc_PostAkEvent_ReturnValue;  // 0x24 (0x24)
	int32_t CallFunc_PostAkEvent_ReturnValue_2;  // 0x28 (0x28)


}; 
 
 // Function BP_GiantWorm_PoisonArea.BP_GiantWorm_PoisonArea_C.SpawnFiringFX
// Size: 0x58(Inherited: 0xCD)
struct FSpawnFiringFX : FSpawnFiringFX
{
	float CallFunc_BreakVector3f_X;  // 0x0 (0x0)
	float CallFunc_BreakVector3f_Y;  // 0x4 (0x4)
	float CallFunc_BreakVector3f_Z;  // 0x8 (0x8)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x10 (0x10)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_2;  // 0x18 (0x18)
	double CallFunc_Divide_DoubleDouble_ReturnValue;  // 0x20 (0x20)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0x28 (0x28)
	struct FVector3f CallFunc_BreakVector3f_InVec_ImplicitCast;  // 0x40 (0x40)
	float CallFunc_SetFadeOut_StartDelay_ImplicitCast;  // 0x4C (0x4C)
	double CallFunc_Multiply_DoubleDouble_B_ImplicitCast;  // 0x50 (0x50)


}; 
 
 