#pragma once 
#include <BP_Hoard01_N1_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_Hoard01_N1.BP_Hoard01_N1_C
// Size: 0x630(Inherited: 0x4E0)
struct ABP_Hoard01_N1_C : ABP_ItemDispenserBase_C
{
	struct UStaticMeshComponent* SM_Chalice_02a;  // 0x4E0 (0x4E0)
	struct UStaticMeshComponent* SM_Bangle_01j;  // 0x4E8 (0x4E8)
	struct UStaticMeshComponent* SM_Statue_02a;  // 0x4F0 (0x4F0)
	struct UStaticMeshComponent* SM_Coin_Pile_01e1;  // 0x4F8 (0x4F8)
	struct UStaticMeshComponent* SM_Gems_01c_Holder1;  // 0x500 (0x500)
	struct UStaticMeshComponent* SM_Gems_01b_Holder1;  // 0x508 (0x508)
	struct UStaticMeshComponent* SM_Gems_01a_Holder3;  // 0x510 (0x510)
	struct UStaticMeshComponent* SM_Gems_01a_Holder2;  // 0x518 (0x518)
	struct UStaticMeshComponent* SM_Gems_01a_Holder1;  // 0x520 (0x520)
	struct UStaticMeshComponent* SM_CoinMaterial_01e3;  // 0x528 (0x528)
	struct UStaticMeshComponent* SM_Dagger_01a;  // 0x530 (0x530)
	struct UStaticMeshComponent* SM_Bangle_01i;  // 0x538 (0x538)
	struct UStaticMeshComponent* SM_Gems_01d_Holder;  // 0x540 (0x540)
	struct UStaticMeshComponent* SM_Gems_01c_Holder;  // 0x548 (0x548)
	struct UStaticMeshComponent* SM_Gems_01b_Holder;  // 0x550 (0x550)
	struct UStaticMeshComponent* SM_Gems_01a_Holder;  // 0x558 (0x558)
	struct UStaticMeshComponent* SM_Pearls_01c;  // 0x560 (0x560)
	struct UStaticMeshComponent* SM_Chalice_01a;  // 0x568 (0x568)
	struct UStaticMeshComponent* SM_CandleHolder;  // 0x570 (0x570)
	struct UStaticMeshComponent* SM_ScrollClosed;  // 0x578 (0x578)
	struct UStaticMeshComponent* SM_CandleHolderSmall;  // 0x580 (0x580)
	struct UStaticMeshComponent* SM_Bowl_01a;  // 0x588 (0x588)
	struct UStaticMeshComponent* SM_Chalice_02b;  // 0x590 (0x590)
	struct UStaticMeshComponent* SM_Candelabra_01;  // 0x598 (0x598)
	struct UStaticMeshComponent* SM_WaterPot_01a;  // 0x5A0 (0x5A0)
	struct UStaticMeshComponent* SM_Bangle_01a;  // 0x5A8 (0x5A8)
	struct UStaticMeshComponent* SM_CoinMaterial_01e;  // 0x5B0 (0x5B0)
	struct UStaticMeshComponent* SM_Coin_Pile_01a;  // 0x5B8 (0x5B8)
	struct UStaticMeshComponent* SM_ChestCoins_01a;  // 0x5C0 (0x5C0)
	struct UStaticMeshComponent* SM_Coin_Pile_01b;  // 0x5C8 (0x5C8)
	struct UStaticMeshComponent* SM_Chest_01g;  // 0x5D0 (0x5D0)
	struct UStaticMeshComponent* SM_Coin_Pile_01f;  // 0x5D8 (0x5D8)
	struct UStaticMeshComponent* SM_CoinMaterial_01e2;  // 0x5E0 (0x5E0)
	struct UStaticMeshComponent* SM_Coin_Pile_01e;  // 0x5E8 (0x5E8)
	struct UStaticMeshComponent* SM_Urn_01a;  // 0x5F0 (0x5F0)
	struct UStaticMeshComponent* SM_Crown_01a;  // 0x5F8 (0x5F8)
	struct UStaticMeshComponent* SM_MetalGoblet;  // 0x600 (0x600)
	struct UStaticMeshComponent* SM_Dagger_01b;  // 0x608 (0x608)
	struct UStaticMeshComponent* SM_Coin_Pile_01b1;  // 0x610 (0x610)
	struct UStaticMeshComponent* SM_Statue_01a;  // 0x618 (0x618)
	struct UStaticMeshComponent* SM_CoinMaterial_01e1;  // 0x620 (0x620)
	struct UStaticMeshComponent* SM_Coin_Pile_01h;  // 0x628 (0x628)


}; 
 
 


