#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_LightSourceBase.BP_LightSourceBase_C.ExecuteUbergraph_BP_LightSourceBase
struct FExecuteUbergraph_BP_LightSourceBase
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x8 (0x8)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x10 (0x10)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x14 (0x14)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x18 (0x18)
	char pad_28_1 : 7;  // 0x1C (0x1C)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x1C (0x1C)
	char pad_29[3];  // 0x1D (0x1D)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x20 (0x20)
	int32_t K2Node_Event_InCount;  // 0x28 (0x28)
	int32_t Temp_int_Array_Index_Variable;  // 0x2C (0x2C)
	struct UPointLightComponent* CallFunc_Array_Get_Item;  // 0x30 (0x30)
	double CallFunc_Multiply_DoubleDouble_A_ImplicitCast;  // 0x38 (0x38)
	float CallFunc_SetIntensity_NewIntensity_ImplicitCast;  // 0x40 (0x40)


}; 
 
 // Function BP_LightSourceBase.BP_LightSourceBase_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 