#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_PressurePlate.BP_PressurePlate_C.BndEvt__BP_FloorSpikeTrap_ActiveBox_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature
struct FBndEvt__BP_FloorSpikeTrap_ActiveBox_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature
{
	struct UPrimitiveComponent* OverlappedComponent;  // 0x0 (0x0)
	struct AActor* OtherActor;  // 0x8 (0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10 (0x10)
	int32_t OtherBodyIndex;  // 0x18 (0x18)
	char pad_28_1 : 7;  // 0x1C (0x1C)
	bool bFromSweep : 1;  // 0x1C (0x1C)
	char pad_29[3];  // 0x1D (0x1D)
	struct FHitResult SweepResult;  // 0x20 (0x20)


}; 
 
 // Function BP_PressurePlate.BP_PressurePlate_C.ExecuteUbergraph_BP_PressurePlate
struct FExecuteUbergraph_BP_PressurePlate
{
	int32_t EntryPoint;  // 0x0 (0x0)
	int32_t Temp_int_Variable;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool CallFunc_EqualEqual_IntInt_ReturnValue : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x9 (0x9)
	char pad_10[6];  // 0xA (0xA)
	struct UPrimitiveComponent* K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x10 (0x10)
	struct AActor* K2Node_ComponentBoundEvent_OtherActor_2;  // 0x18 (0x18)
	struct UPrimitiveComponent* K2Node_ComponentBoundEvent_OtherComp_2;  // 0x20 (0x20)
	int32_t K2Node_ComponentBoundEvent_OtherBodyIndex_2;  // 0x28 (0x28)
	char pad_44_1 : 7;  // 0x2C (0x2C)
	bool K2Node_ComponentBoundEvent_bFromSweep : 1;  // 0x2C (0x2C)
	char pad_45[3];  // 0x2D (0x2D)
	struct FHitResult K2Node_ComponentBoundEvent_SweepResult;  // 0x30 (0x30)
	struct UPrimitiveComponent* K2Node_ComponentBoundEvent_OverlappedComponent;  // 0x118 (0x118)
	struct AActor* K2Node_ComponentBoundEvent_OtherActor;  // 0x120 (0x120)
	struct UPrimitiveComponent* K2Node_ComponentBoundEvent_OtherComp;  // 0x128 (0x128)
	int32_t K2Node_ComponentBoundEvent_OtherBodyIndex;  // 0x130 (0x130)
	char pad_308_1 : 7;  // 0x134 (0x134)
	bool CallFunc_HasAuthority_ReturnValue_2 : 1;  // 0x134 (0x134)
	char pad_309[3];  // 0x135 (0x135)
	int32_t Temp_int_Variable_2;  // 0x138 (0x138)
	char pad_316_1 : 7;  // 0x13C (0x13C)
	bool CallFunc_EqualEqual_IntInt_ReturnValue_2 : 1;  // 0x13C (0x13C)
	char pad_317[3];  // 0x13D (0x13D)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x140 (0x140)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x144 (0x144)


}; 
 
 // Function BP_PressurePlate.BP_PressurePlate_C.BndEvt__BP_PressurePlates_ActiveBox_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
struct FBndEvt__BP_PressurePlates_ActiveBox_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
{
	struct UPrimitiveComponent* OverlappedComponent;  // 0x0 (0x0)
	struct AActor* OtherActor;  // 0x8 (0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10 (0x10)
	int32_t OtherBodyIndex;  // 0x18 (0x18)


}; 
 
 