#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_SkeletonArcher_Summoned.BP_SkeletonArcher_Summoned_C.BndEvt__BP_SkeletonArcher_Summoned_DCGameObjectLink_K2Node_ComponentBoundEvent_2_DCGameObjectLinkComponentUMsgGameLinkerRequest__DelegateSignature
struct FBndEvt__BP_SkeletonArcher_Summoned_DCGameObjectLink_K2Node_ComponentBoundEvent_2_DCGameObjectLinkComponentUMsgGameLinkerRequest__DelegateSignature
{
	struct FObjectLinkRequestEvent RecvEvent;  // 0x0 (0x0)
	struct UObjectLinkMetaDataBlueprint* SendEventParam;  // 0xB0 (0xB0)


}; 
 
 // Function BP_SkeletonArcher_Summoned.BP_SkeletonArcher_Summoned_C.OnFMsgGASAttributeNotifyBlueprint
// Size: 0x4D8(Inherited: 0x4D8)
struct FOnFMsgGASAttributeNotifyBlueprint : FOnFMsgGASAttributeNotifyBlueprint
{
	struct FMsgGASAttributeNotify InMsg;  // 0x0 (0x0)


}; 
 
 // Function BP_SkeletonArcher_Summoned.BP_SkeletonArcher_Summoned_C.OnFail_8D09AD2E484E08C0DD93AA832ABA2A1F
struct FOnFail_8D09AD2E484E08C0DD93AA832ABA2A1F
{
	enum class EPathFollowingResult MovementResult;  // 0x0 (0x0)


}; 
 
 // Function BP_SkeletonArcher_Summoned.BP_SkeletonArcher_Summoned_C.ExecuteUbergraph_BP_SkeletonArcher_Summoned
struct FExecuteUbergraph_BP_SkeletonArcher_Summoned
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue;  // 0x8 (0x8)
	struct UAbilityAsync_WaitGameplayTagRemoved* CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue;  // 0x10 (0x10)
	char CallFunc_MakeLiteralByte_ReturnValue;  // 0x18 (0x18)
	char pad_25_1 : 7;  // 0x19 (0x19)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x19 (0x19)
	char pad_26_1 : 7;  // 0x1A (0x1A)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x1A (0x1A)
	char pad_27[1];  // 0x1B (0x1B)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x1C (0x1C)
	char pad_44_1 : 7;  // 0x2C (0x2C)
	bool CallFunc_Death_ReturnValue : 1;  // 0x2C (0x2C)
	enum class EPathFollowingResult Temp_byte_Variable;  // 0x2D (0x2D)
	char pad_46[2];  // 0x2E (0x2E)
	struct TScriptInterface<IGameplayTagAssetInterface> K2Node_DynamicCast_As_________________;  // 0x30 (0x30)
	char pad_64_1 : 7;  // 0x40 (0x40)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x40 (0x40)
	char pad_65[7];  // 0x41 (0x41)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_2;  // 0x48 (0x48)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // [x50 ([x50)
	char pad_81_1 : 7;  // 0x51 (0x51)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x51 (0x51)
	enum class EPathFollowingResult K2Node_CustomEvent_MovementResult;  // 0x52 (0x52)
	char pad_83[5];  // 0x53 (0x53)
	struct UAbilityAsync_WaitGameplayTagRemoved* CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue_2;  // 0x58 (0x58)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;  // 0x60 (0x60)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_2 : 1;  // 0x70 (0x70)
	char pad_113_1 : 7;  // 0x71 (0x71)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x71 (0x71)
	char pad_114[2];  // 0x72 (0x72)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x74 (0x74)
	char pad_132[4];  // 0x84 (0x84)
	struct FObjectLinkRequestEvent K2Node_ComponentBoundEvent_RecvEvent;  // 0x88 (0x88)
	struct UObjectLinkMetaDataBlueprint* K2Node_ComponentBoundEvent_SendEventParam;  // 0x138 (0x138)
	char pad_320_1 : 7;  // 0x140 (0x140)
	bool CallFunc_Set_Target_Provider_Result : 1;  // 0x140 (0x140)
	char pad_321_1 : 7;  // 0x141 (0x141)
	bool CallFunc_EqualEqual_DoubleDouble_ReturnValue : 1;  // 0x141 (0x141)
	char pad_322[6];  // 0x142 (0x142)
	struct ABP_Lich_Common_C* K2Node_DynamicCast_AsBP_Lich_Common;  // 0x148 (0x148)
	char pad_336_1 : 7;  // 0x150 (0x150)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x150 (0x150)
	char pad_337_1 : 7;  // 0x151 (0x151)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess : 1;  // 0x151 (0x151)
	char pad_338_1 : 7;  // 0x152 (0x152)
	bool CallFunc_EqualEqual_GameplayTag_ReturnValue : 1;  // 0x152 (0x152)
	char pad_339_1 : 7;  // 0x153 (0x153)
	bool CallFunc_LinkEventBase_Result : 1;  // 0x153 (0x153)
	char pad_340[4];  // 0x154 (0x154)
	struct TArray<struct FPrimaryAssetId> K2Node_MakeArray_Array;  // 0x158 (0x158)
	char pad_360_1 : 7;  // 0x168 (0x168)
	bool Temp_bool_Variable : 1;  // 0x168 (0x168)
	char pad_361[7];  // 0x169 (0x169)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue;  // 0x170 (0x170)
	struct FMsgGASAttributeNotify K2Node_Event_InMsg;  // 0x180 (0x180)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x658 (0x658)
	int32_t K2Node_Event_InCount;  // 0x660 (0x660)
	char pad_1636_1 : 7;  // 0x664 (0x664)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x664 (0x664)
	char pad_1637_1 : 7;  // 0x665 (0x665)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2 : 1;  // 0x665 (0x665)
	char pad_1638_1 : 7;  // 0x666 (0x666)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3 : 1;  // 0x666 (0x666)
	char pad_1639[1];  // 0x667 (0x667)
	struct AActor* CallFunc_DCEffectContextGetInstigatorActor_ReturnValue;  // 0x668 (0x668)
	char pad_1648_1 : 7;  // 0x670 (0x670)
	bool CallFunc_IsValid_ReturnValue_4 : 1;  // 0x670 (0x670)
	char pad_1649_1 : 7;  // 0x671 (0x671)
	bool CallFunc_EqualEqual_GameplayAttributeGameplayAttribute_ReturnValue : 1;  // 0x671 (0x671)
	char pad_1650_1 : 7;  // 0x672 (0x672)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute : 1;  // 0x672 (0x672)
	char pad_1651[1];  // 0x673 (0x673)
	float CallFunc_GetFloatAttribute_ReturnValue;  // 0x674 (0x674)
	char pad_1656_1 : 7;  // 0x678 (0x678)
	bool CallFunc_Less_DoubleDouble_ReturnValue : 1;  // 0x678 (0x678)
	char pad_1657_1 : 7;  // 0x679 (0x679)
	bool CallFunc_Less_DoubleDouble_ReturnValue_2 : 1;  // 0x679 (0x679)
	char pad_1658_1 : 7;  // 0x67A (0x67A)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue : 1;  // 0x67A (0x67A)
	char pad_1659_1 : 7;  // 0x67B (0x67B)
	bool CallFunc_RemoveGameplayTag_ReturnValue : 1;  // 0x67B (0x67B)
	char pad_1660_1 : 7;  // 0x67C (0x67C)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_3 : 1;  // 0x67C (0x67C)
	char pad_1661_1 : 7;  // 0x67D (0x67D)
	bool CallFunc_AddGameplayTag_ReturnValue : 1;  // 0x67D (0x67D)
	char pad_1662[2];  // 0x67E (0x67E)
	struct UAnimMontage* CallFunc_GetCurrentMontage_ReturnValue;  // 0x680 (0x680)
	struct AAIController* CallFunc_GetAIController_ReturnValue;  // 0x688 (0x688)
	struct UAIAsyncTaskBlueprintProxy* CallFunc_CreateMoveToProxyObject_ReturnValue;  // 0x690 (0x690)
	char pad_1688_1 : 7;  // 0x698 (0x698)
	bool CallFunc_AddGameplayTag_ReturnValue_2 : 1;  // 0x698 (0x698)
	char pad_1689_1 : 7;  // 0x699 (0x699)
	bool CallFunc_IsValid_ReturnValue_5 : 1;  // 0x699 (0x699)
	char pad_1690_1 : 7;  // 0x69A (0x69A)
	bool CallFunc_IsValid_ReturnValue_6 : 1;  // 0x69A (0x69A)
	enum class EPathFollowingResult K2Node_CustomEvent_MovementResult_2;  // 0x69B (0x69B)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x69C (0x69C)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_4;  // 0x6AC (0x6AC)
	char pad_1724[4];  // 0x6BC (0x6BC)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue;  // 0x6C0 (0x6C0)
	struct AAIController* CallFunc_GetAIController_ReturnValue_2;  // 0x6C8 (0x6C8)
	char pad_1744_1 : 7;  // 0x6D0 (0x6D0)
	bool CallFunc_RemoveGameplayTag_ReturnValue_2 : 1;  // 0x6D0 (0x6D0)
	char pad_1745[7];  // 0x6D1 (0x6D1)
	struct FHitResult CallFunc_K2_SetActorLocation_SweepHitResult;  // 0x6D8 (0x6D8)
	char pad_1984_1 : 7;  // 0x7C0 (0x7C0)
	bool CallFunc_K2_SetActorLocation_ReturnValue : 1;  // 0x7C0 (0x7C0)
	char pad_1985[7];  // 0x7C1 (0x7C1)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x7C8 (0x7C8)
	double CallFunc_Vector_Distance_ReturnValue;  // 0x7E0 (0x7E0)
	char pad_2024_1 : 7;  // 0x7E8 (0x7E8)
	bool CallFunc_Greater_DoubleDouble_ReturnValue : 1;  // 0x7E8 (0x7E8)
	char pad_2025[7];  // 0x7E9 (0x7E9)
	struct TArray<struct FPrimaryAssetId> K2Node_MakeArray_Array_2;  // 0x7F0 (0x7F0)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue_2;  // 0x800 (0x800)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_5;  // 0x810 (0x810)
	char pad_2080_1 : 7;  // 0x820 (0x820)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_4 : 1;  // 0x820 (0x820)
	char pad_2081_1 : 7;  // 0x821 (0x821)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_5 : 1;  // 0x821 (0x821)
	char pad_2082[2];  // 0x822 (0x822)
	struct FName CallFunc_MakeLiteralName_ReturnValue;  // 0x824 (0x824)
	char pad_2092[4];  // 0x82C (0x82C)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_3;  // 0x830 (0x830)
	struct FName CallFunc_MakeLiteralName_ReturnValue_2;  // 0x838 (0x838)
	char CallFunc_GetValueAsEnum_ReturnValue;  // 0x840 (0x840)
	char CallFunc_GetValidValue_ReturnValue;  // 0x841 (0x841)
	char pad_2114_1 : 7;  // 0x842 (0x842)
	bool CallFunc_NotEqual_ByteByte_ReturnValue : 1;  // 0x842 (0x842)
	char pad_2115[5];  // 0x843 (0x843)
	double CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;  // 0x848 (0x848)
	double K2Node_VariableSet_Prev_HP_ImplicitCast;  // 0x850 (0x850)
	double K2Node_VariableSet_Prev_HP_ImplicitCast_2;  // 0x858 (0x858)
	double CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;  // 0x860 (0x860)
	double CallFunc_Less_DoubleDouble_B_ImplicitCast;  // 0x868 (0x868)
	double CallFunc_Less_DoubleDouble_A_ImplicitCast;  // 0x870 (0x870)


}; 
 
 // Function BP_SkeletonArcher_Summoned.BP_SkeletonArcher_Summoned_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 // Function BP_SkeletonArcher_Summoned.BP_SkeletonArcher_Summoned_C.OnSuccess_8D09AD2E484E08C0DD93AA832ABA2A1F
struct FOnSuccess_8D09AD2E484E08C0DD93AA832ABA2A1F
{
	enum class EPathFollowingResult MovementResult;  // 0x0 (0x0)


}; 
 
 