#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_SkeletonWarlord.BP_SkeletonWarlord_C.Combo Reach Calculation
struct FCombo Reach Calculation
{
	double Return;  // 0x0 (0x0)
	double CallFunc_Conv_IntToDouble_ReturnValue;  // 0x8 (0x8)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x10 (0x10)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function BP_SkeletonWarlord.BP_SkeletonWarlord_C.End Combat
struct FEnd Combat
{
	int32_t Temp_int_Array_Index_Variable;  // 0x0 (0x0)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x4 (0x4)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x8 (0x8)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0xC (0xC)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)
	int32_t Temp_int_Array_Index_Variable_3;  // 0x14 (0x14)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x18 (0x18)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x1C (0x1C)
	int32_t Temp_int_Loop_Counter_Variable_3;  // 0x20 (0x20)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_2;  // 0x24 (0x24)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_2 : 1;  // 0x28 (0x28)
	char pad_41[3];  // 0x29 (0x29)
	int32_t Temp_int_Array_Index_Variable_4;  // 0x2C (0x2C)
	int32_t Temp_int_Loop_Counter_Variable_4;  // 0x30 (0x30)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x34 (0x34)
	int32_t Temp_int_Loop_Counter_Variable_5;  // 0x38 (0x38)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x3C (0x3C)
	int32_t Temp_int_Array_Index_Variable_5;  // 0x40 (0x40)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x44 (0x44)
	struct FGameplayTag CallFunc_Array_Get_Item;  // 0x48 (0x48)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x50 (0x50)
	char pad_81_1 : 7;  // 0x51 (0x51)
	bool CallFunc_RemoveGameplayTag_ReturnValue : 1;  // 0x51 (0x51)
	char pad_82[6];  // 0x52 (0x52)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_2;  // 0x58 (0x58)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_3;  // 0x60 (0x60)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue;  // 0x68 (0x68)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_2;  // 0x6C (0x6C)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x70 (0x70)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x74 (0x74)
	char pad_120_1 : 7;  // 0x78 (0x78)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x78 (0x78)
	char pad_121_1 : 7;  // 0x79 (0x79)
	bool CallFunc_Less_IntInt_ReturnValue_3 : 1;  // 0x79 (0x79)
	char pad_122[6];  // 0x7A (0x7A)
	struct TArray<struct FPrimaryAssetId> K2Node_MakeArray_Array;  // 0x80 (0x80)
	struct ADCMonsterBase* CallFunc_Array_Get_Item_4;  // 0x90 (0x90)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x98 (0x98)
	char pad_156[4];  // 0x9C (0x9C)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue;  // 0xA0 (0xA0)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_3;  // 0xB0 (0xB0)
	int32_t CallFunc_Max_ReturnValue;  // 0xB4 (0xB4)
	struct TArray<struct FPrimaryAssetId> K2Node_MakeArray_Array_2;  // 0xB8 (0xB8)
	struct ADCMonsterBase* CallFunc_Array_Get_Item_5;  // 0xC8 (0xC8)
	int32_t CallFunc_Array_Length_ReturnValue_5;  // 0xD0 (0xD0)
	char pad_212[4];  // 0xD4 (0xD4)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue_2;  // 0xD8 (0xD8)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_4;  // 0xE8 (0xE8)
	int32_t CallFunc_Max_ReturnValue_2;  // 0xEC (0xEC)


}; 
 
 // Function BP_SkeletonWarlord.BP_SkeletonWarlord_C.ExecuteUbergraph_BP_SkeletonWarlord
struct FExecuteUbergraph_BP_SkeletonWarlord
{
	int32_t EntryPoint;  // 0x0 (0x0)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x4 (0x4)
	struct AActor* Temp_object_Variable;  // 0x8 (0x8)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x10 (0x10)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	int32_t CallFunc_RandomInteger_ReturnValue;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0x20 (0x7FF7D3428690 (0x16FAD03EBC0))
	struct FGameplayEffectSpecHandle Temp_struct_Variable;  // 0x28 (0x28)
	struct FGameplayTagContainer CallFunc_GetGrantedTag_ReturnValue;  // 0x38 (0x38)
	struct FActiveGameplayEffectHandle Temp_struct_Variable_2;  // 0x58 (0x58)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x60 (0x60)
	int32_t K2Node_Event_InCount;  // 0x7FF7D3428690 (0x16FAD03EBC0) (0x7FF7D3428690 (0x16FAD03EBC0))
	int32_t Temp_int_Loop_Counter_Variable;  // 0x6C (0x6C)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x70 (0x70)
	char pad_113[3];  // 0x71 (0x71)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_2;  // 0x74 (0x74)
	char pad_120_1 : 7;  // 0x78 (0x78)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x78 (0x78)
	char pad_121_1 : 7;  // 0x79 (0x79)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess : 1;  // 0x79 (0x79)
	char pad_122_1 : 7;  // 0x7A (0x7A)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2 : 1;  // 0x7FF7D35967D0 (0x1705D6E0080) (0x7FF7D35967D0 (0x1705D6E0080))
	char pad_123[5];  // 0x7B (0x7B)
	struct TArray<struct FGameplayTag> K2Node_MakeArray_Array;  // 0x80 (0x80)
	struct UAbilityAsync_WaitGameplayEffectApplied* CallFunc_WaitGameplayEffectAppliedToActor_ReturnValue;  // 0x90 (0x90)
	struct FGameplayTagContainer CallFunc_MakeGameplayTagContainerFromArray_ReturnValue;  // 0x98 (0x98)
	char pad_184_1 : 7;  // 0xB8 (0xB8)
	bool CallFunc_EqualEqual_GameplayTagContainer_ReturnValue : 1;  // 0xB8 (0xB8)
	char pad_185_1 : 7;  // 0xB9 (0xB9)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0xB9 (0xB9)
	char pad_186[2];  // 0xBA (0xBA)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0xBC (0xBC)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue;  // 0xC0 (0xC0)
	struct FName CallFunc_MakeLiteralName_ReturnValue;  // 0xC8 (0xC8)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_2;  // 0xD0 (0xD0)
	int32_t CallFunc_Multiply_IntInt_ReturnValue;  // 0xD8 (0xD8)
	char pad_220_1 : 7;  // 0xDC (0xDC)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0xDC (0xDC)
	char pad_221[3];  // 0xDD (0xDD)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0xE0 (0xE0)
	float CallFunc_Conv_IntToFloat_ReturnValue;  // 0xE4 (0xE4)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_3;  // 0xE8 (0xE8)
	struct FName CallFunc_MakeLiteralName_ReturnValue_2;  // 0xF0 (0xF0)
	int32_t Temp_int_Variable;  // 0xF8 (0xF8)
	char CallFunc_GetValueAsEnum_ReturnValue;  // 0xFC (0xFC)
	char pad_253[3];  // 0xFD (0xFD)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_4;  // 0x100 (0x100)
	char CallFunc_GetValidValue_ReturnValue;  // 0x108 (0x108)
	char pad_265_1 : 7;  // 0x109 (0x109)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x109 (0x109)
	char pad_266_1 : 7;  // 0x10A (0x10A)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue : 1;  // 0x10A (0x10A)
	char pad_267[5];  // 0x10B (0x10B)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue;  // 0x110 (0x110)
	char pad_488_1 : 7;  // 0x1E8 (0x1E8)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x1E8 (0x1E8)
	char pad_489[7];  // 0x1E9 (0x1E9)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_5;  // 0x1F0 (0x0 ()
	struct FName CallFunc_MakeLiteralName_ReturnValue_3;  // 0x1F8 (0x1F8)
	struct FTransform CallFunc_GetTransform_ReturnValue;  // 0x200 (0x200)
	struct FVector CallFunc_BreakTransform_Location;  // 0x260 (0x260)
	struct FRotator CallFunc_BreakTransform_Rotation;  // 0x278 (0x278)
	struct FVector CallFunc_BreakTransform_Scale;  // 0x290 (0x290)
	char pad_680[8];  // 0x2A8 (0x2A8)
	struct FTransform CallFunc_GetTransform_ReturnValue_2;  // 0x2B0 (0x2B0)
	struct FVector CallFunc_BreakTransform_Location_2;  // 0x310 (0x310)
	struct FRotator CallFunc_BreakTransform_Rotation_2;  // 0x328 (0x328)
	struct FVector CallFunc_BreakTransform_Scale_2;  // 0x340 (0x340)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x358 (0x358)
	char pad_872_1 : 7;  // 0x368 (0x368)
	bool CallFunc_HasAuthority_ReturnValue_2 : 1;  // 0x368 (0x368)
	char pad_873[3];  // 0x369 (0x369)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x36C (0x36C)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_3;  // 0x370 (0x370)
	int32_t CallFunc_Max_ReturnValue;  // 0x374 (0x374)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x378 (0x378)
	char pad_892[4];  // 0x37C (0x37C)
	double CallFunc_RandomFloatInRange_ReturnValue;  // 0x380 (0x380)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_4;  // 0x388 (0x388)
	char pad_908[4];  // 0x38C (0x38C)
	struct FVector CallFunc_Conv_DoubleToVector_ReturnValue;  // 0x390 (0x390)
	char pad_936_1 : 7;  // 0x3A8 (0x3A8)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_2 : 1;  // 0x3A8 (0x3A8)
	char pad_937[7];  // 0x3A9 (0x3A9)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x3B0 (0x3B0)
	double CallFunc_RandomFloatInRange_ReturnValue_2;  // 0x3C8 (0x3C8)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_2;  // 0x3D0 (0x3D0)
	struct FVector CallFunc_BreakTransform_Location_3;  // 0x3E8 (0x3E8)
	struct FRotator CallFunc_BreakTransform_Rotation_3;  // 0x400 (0x400)
	struct FVector CallFunc_BreakTransform_Scale_3;  // 0x418 (0x418)
	struct FRotator CallFunc_FindLookAtRotation_ReturnValue;  // 0x430 (0x430)
	float CallFunc_BreakRotator_Roll;  // 0x448 (0x448)
	float CallFunc_BreakRotator_Pitch;  // 0x44C (0x44C)
	float CallFunc_BreakRotator_Yaw;  // 0x450 (0x450)
	char pad_1108[4];  // 0x454 (0x454)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue;  // 0x458 (0x458)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x470 (0x470)
	int32_t Temp_int_Array_Index_Variable;  // 0x478 (0x478)
	char pad_1148[4];  // 0x47C (0x47C)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0x480 (0x480)
	double CallFunc_RandomFloatInRange_ReturnValue_3;  // 0x498 (0x498)
	struct FVector CallFunc_GetForwardVector_ReturnValue;  // 0x4A0 (0x4A0)
	struct FVector CallFunc_Multiply_VectorVector_ReturnValue;  // 0x4B8 (0x4B8)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x4D0 (0x4D0)
	double CallFunc_BreakVector_X;  // 0x4E8 (0x4E8)
	double CallFunc_BreakVector_Y;  // 0x4F0 (0x4F0)
	double CallFunc_BreakVector_Z;  // 0x4F8 (0x4F8)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_5;  // 0x500 (0x500)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_6;  // 0x504 (0x504)
	int32_t CallFunc_Divide_IntInt_ReturnValue;  // 0x508 (0x508)
	char pad_1292[4];  // 0x50C (0x50C)
	double CallFunc_Conv_IntToDouble_ReturnValue;  // 0x510 (0x510)
	struct FVector CallFunc_GetCapsuleBottomLocation_ReturnValue;  // 0x518 (0x518)
	double CallFunc_RandomFloatInRange_ReturnValue_4;  // 0x530 (0x530)
	double CallFunc_BreakVector_X_2;  // 0x538 (0x538)
	double CallFunc_BreakVector_Y_2;  // 0x540 (0x540)
	double CallFunc_BreakVector_Z_2;  // 0x548 (0x548)
	struct FVector CallFunc_Conv_DoubleToVector_ReturnValue_2;  // 0x550 (0x550)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0x568 (0x568)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x580 (0x580)
	char pad_1412[12];  // 0x584 (0x584)
	struct FTransform CallFunc_MakeTransform_ReturnValue;  // 0x590 (0x590)
	struct AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue;  // 0x5F0 (0x5F0)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_3;  // 0x5F8 (0x5F8)
	struct ABP_GameSpawner_C* CallFunc_FinishSpawningActor_ReturnValue;  // 0x610 (0x610)
	struct FRotator CallFunc_K2_GetComponentRotation_ReturnValue;  // 0x618 (0x618)
	float CallFunc_BreakRotator_Roll_2;  // 0x630 (0x630)
	float CallFunc_BreakRotator_Pitch_2;  // 0x634 (0x634)
	float CallFunc_BreakRotator_Yaw_2;  // 0x638 (0x638)
	char pad_1596[4];  // 0x63C (0x63C)
	struct AActor* K2Node_CustomEvent_Source;  // 0x640 (0x640)
	struct FGameplayEffectSpecHandle K2Node_CustomEvent_SpecHandle;  // 0x648 (0x648)
	struct FActiveGameplayEffectHandle K2Node_CustomEvent_ActiveHandle;  // 0x658 (0x658)
	struct ADCMonsterBase* CallFunc_SpawnMonster_ReturnValue;  // 0x660 (0x660)
	struct ABP_SkeletonRoyalGuard_C* K2Node_DynamicCast_AsBP_Skeleton_Royal_Guard;  // 0x668 (0x668)
	char pad_1648_1 : 7;  // 0x670 (0x670)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x670 (0x670)
	char pad_1649[3];  // 0x671 (0x671)
	int32_t CallFunc_Array_AddUnique_ReturnValue;  // 0x674 (0x674)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x678 (0x678)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x67C (0x67C)
	char pad_1676[4];  // 0x68C (0x68C)
	struct FVector CallFunc_BreakTransform_Location_4;  // 0x690 (0x690)
	struct FRotator CallFunc_BreakTransform_Rotation_4;  // 0x6A8 (0x6A8)
	struct FVector CallFunc_BreakTransform_Scale_4;  // 0x6C0 (0x6C0)
	struct FHitResult CallFunc_K2_SetActorLocation_SweepHitResult;  // 0x6D8 (0x6D8)
	char pad_1984_1 : 7;  // 0x7C0 (0x7C0)
	bool CallFunc_K2_SetActorLocation_ReturnValue : 1;  // 0x7C0 (0x7C0)
	char pad_1985_1 : 7;  // 0x7C1 (0x7C1)
	bool CallFunc_FilterUnTagedTargets_ReturnValue : 1;  // 0x7C1 (0x7C1)
	char pad_1986[6];  // 0x7C2 (0x7C2)
	struct ADCCharacterBase* CallFunc_PickRandomTarget_ReturnValue;  // 0x7C8 (0x7C8)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x7D0 (0x7D0)
	char pad_2004[4];  // 0x7D4 (0x7D4)
	struct ABP_SkeletonRoyalGuard_C* K2Node_DynamicCast_AsBP_Skeleton_Royal_Guard_2;  // 0x7D8 (0x7D8)
	char pad_2016_1 : 7;  // 0x7E0 (0x7E0)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x7E0 (0x7E0)
	char pad_2017[3];  // 0x7E1 (0x7E1)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_7;  // 0x7E4 (0x7E4)
	char pad_2024_1 : 7;  // 0x7E8 (0x7E8)
	bool CallFunc_AddGameplayTag_ReturnValue : 1;  // 0x7E8 (0x7E8)
	char pad_2025[3];  // 0x7E9 (0x7E9)
	int32_t CallFunc_RandomInteger_ReturnValue_2;  // 0x7EC (0x7EC)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_2;  // 0x7F0 (0x7F0)
	char pad_2040_1 : 7;  // 0x7F8 (0x7F8)
	bool CallFunc_FilterUnTagedTargets_ReturnValue_2 : 1;  // 0x7F8 (0x7F8)
	char pad_2041[7];  // 0x7F9 (0x7F9)
	struct ADCMonsterBase* CallFunc_Array_Get_Item_3;  // 0x800 (0x800)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x808 (0x808)
	char pad_2060_1 : 7;  // 0x80C (0x80C)
	bool CallFunc_AddGameplayTag_ReturnValue_2 : 1;  // 0x80C (0x80C)
	char pad_2061[3];  // 0x80D (0x80D)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_8;  // 0x810 (0x810)
	int32_t Temp_int_Loop_Counter_Variable_3;  // 0x814 (0x814)
	int32_t CallFunc_Max_ReturnValue_2;  // 0x818 (0x818)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_9;  // 0x81C (0x81C)
	char pad_2080_1 : 7;  // 0x820 (0x820)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_3 : 1;  // 0x820 (0x820)
	char pad_2081[3];  // 0x821 (0x821)
	int32_t Temp_int_Variable_2;  // 0x824 (0x824)
	char pad_2088_1 : 7;  // 0x828 (0x828)
	bool CallFunc_HasAuthority_ReturnValue_3 : 1;  // 0x828 (0x828)
	char pad_2089[3];  // 0x829 (0x829)
	int32_t Temp_int_Array_Index_Variable_3;  // 0x82C (0x82C)
	struct ADCMonsterBase* CallFunc_Array_Get_Item_4;  // 0x830 (0x830)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue_2;  // 0x838 (0x838)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x910 (0x910)
	int32_t Temp_int_Variable_3;  // 0x920 (0x920)
	int32_t Temp_int_Variable_4;  // 0x924 (0x924)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_4;  // 0x928 (0x928)
	double CallFunc_Conv_IntToDouble_ReturnValue_2;  // 0x938 (0x938)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x940 (0x940)
	double CallFunc_Add_DoubleDouble_ReturnValue_2;  // 0x948 (0x948)
	char pad_2384_1 : 7;  // 0x950 (0x950)
	bool CallFunc_LessEqual_IntInt_ReturnValue : 1;  // 0x950 (0x950)
	char pad_2385[7];  // 0x951 (0x951)
	double CallFunc_Add_DoubleDouble_ReturnValue_3;  // 0x958 (0x958)
	struct FRotator CallFunc_MakeRotator_ReturnValue_2;  // 0x960 (0x960)
	int32_t CallFunc_Add_IntInt_ReturnValue_4;  // 0x978 (0x978)
	char pad_2428[4];  // 0x97C (0x97C)
	struct FVector CallFunc_GetForwardVector_ReturnValue_2;  // 0x980 (0x980)
	struct FVector CallFunc_Multiply_VectorVector_ReturnValue_2;  // 0x998 (0x998)
	struct FVector CallFunc_Add_VectorVector_ReturnValue_2;  // 0x9B0 (0x9B0)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_5;  // 0x9C8 (0x9C8)
	double CallFunc_BreakVector_X_3;  // 0x9D8 (0x9D8)
	double CallFunc_BreakVector_Y_3;  // 0x9E0 (0x9E0)
	double CallFunc_BreakVector_Z_3;  // 0x9E8 (0x9E8)
	struct FVector CallFunc_MakeVector_ReturnValue_2;  // 0x9F0 (0x9F0)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_4;  // 0xA08 (0xA08)
	struct FTransform CallFunc_MakeTransform_ReturnValue_2;  // 0xA20 (0xA20)
	char pad_2688_1 : 7;  // 0xA80 (0xA80)
	bool CallFunc_IsPointInBox_ReturnValue : 1;  // 0xA80 (0xA80)
	char pad_2689[7];  // 0xA81 (0xA81)
	struct AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2;  // 0xA88 (0xA88)
	struct ABP_GameSpawner_C* CallFunc_FinishSpawningActor_ReturnValue_2;  // 0xA90 (0xA90)
	char pad_2712_1 : 7;  // 0xA98 (0xA98)
	bool K2Node_SwitchInteger_CmpSuccess : 1;  // 0xA98 (0xA98)
	char pad_2713_1 : 7;  // 0xA99 (0xA99)
	bool CallFunc_Get_BB_Target_Actor_Result : 1;  // 0xA99 (0xA99)
	char pad_2714[6];  // 0xA9A (0xA9A)
	struct ADCCharacterBase* CallFunc_Get_BB_Target_Actor_DCCharacterBase;  // 0xAA0 (0xAA0)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_5;  // 0xAA8 (0xAA8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_6;  // 0xAC0 (0xAC0)
	struct FRotator CallFunc_FindLookAtRotation_ReturnValue_2;  // 0xAD0 (0xAD0)
	char pad_2792_1 : 7;  // 0xAE8 (0xAE8)
	bool CallFunc_K2_SetActorRotation_ReturnValue : 1;  // 0xAE8 (0xAE8)
	char pad_2793[7];  // 0xAE9 (0xAE9)
	struct FVector CallFunc_Get_Direction_Vector_Result_Vector;  // 0xAF0 (0xAF0)
	int32_t CallFunc_RandomIntegerInRange_ReturnValue;  // 0xB08 (0xB08)
	char pad_2828[4];  // 0xB0C (0xB0C)
	struct FHitResult CallFunc_K2_SetActorLocation_SweepHitResult_2;  // 0xB10 (0xB10)
	char pad_3064_1 : 7;  // 0xBF8 (0xBF8)
	bool CallFunc_K2_SetActorLocation_ReturnValue_2 : 1;  // 0xBF8 (0xBF8)
	char pad_3065[3];  // 0xBF9 (0xBF9)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_10;  // 0xBFC (0xBFC)
	int32_t CallFunc_Add_IntInt_ReturnValue_5;  // 0xC00 (0xC00)
	char pad_3076_1 : 7;  // 0xC04 (0xC04)
	bool CallFunc_RandomBool_ReturnValue : 1;  // 0xC04 (0xC04)
	char pad_3077[3];  // 0xC05 (0xC05)
	int32_t CallFunc_RandomIntegerInRange_ReturnValue_2;  // 0xC08 (0xC08)
	int32_t Temp_int_Variable_5;  // 0xC0C (0xC0C)
	int32_t CallFunc_Add_IntInt_ReturnValue_6;  // 0xC10 (0xC10)
	char pad_3092_1 : 7;  // 0xC14 (0xC14)
	bool CallFunc_RandomBool_ReturnValue_2 : 1;  // 0xC14 (0xC14)
	char pad_3093[3];  // 0xC15 (0xC15)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_11;  // 0xC18 (0xC18)
	char pad_3100_1 : 7;  // 0xC1C (0xC1C)
	bool CallFunc_EqualEqual_IntInt_ReturnValue : 1;  // 0xC1C (0xC1C)
	char pad_3101[3];  // 0xC1D (0xC1D)
	int32_t CallFunc_RandomIntegerInRange_ReturnValue_3;  // 0xC20 (0xC20)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_12;  // 0xC24 (0xC24)
	char pad_3112_1 : 7;  // 0xC28 (0xC28)
	bool CallFunc_EqualEqual_IntInt_ReturnValue_2 : 1;  // 0xC28 (0xC28)
	char pad_3113[3];  // 0xC29 (0xC29)
	int32_t CallFunc_RandomIntegerInRange_ReturnValue_4;  // 0xC2C (0xC2C)
	int32_t CallFunc_Add_IntInt_ReturnValue_7;  // 0xC30 (0xC30)
	char pad_3124_1 : 7;  // 0xC34 (0xC34)
	bool CallFunc_EqualEqual_IntInt_ReturnValue_3 : 1;  // 0xC34 (0xC34)
	char pad_3125[3];  // 0xC35 (0xC35)
	int32_t CallFunc_RandomInteger_ReturnValue_3;  // 0xC38 (0xC38)
	char pad_3132_1 : 7;  // 0xC3C (0xC3C)
	bool CallFunc_EqualEqual_IntInt_ReturnValue_4 : 1;  // 0xC3C (0xC3C)
	char pad_3133[3];  // 0xC3D (0xC3D)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_7;  // 0xC40 (0xC40)
	char pad_3152_1 : 7;  // 0xC50 (0xC50)
	bool CallFunc_FilterUnTagedTargets_ReturnValue_3 : 1;  // 0xC50 (0xC50)
	char pad_3153[3];  // 0xC51 (0xC51)
	int32_t CallFunc_Array_Length_ReturnValue_5;  // 0xC54 (0xC54)
	struct ADCMonsterBase* CallFunc_Array_Get_Item_5;  // 0xC58 (0xC58)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_13;  // 0xC60 (0xC60)
	char pad_3172[4];  // 0xC64 (0xC64)
	struct ABP_SkeletonRoyalGuard_C* K2Node_DynamicCast_AsBP_Skeleton_Royal_Guard_3;  // 0xC68 (0xC68)
	char pad_3184_1 : 7;  // 0xC70 (0xC70)
	bool K2Node_DynamicCast_bSuccess_3 : 1;  // 0xC70 (0xC70)
	char pad_3185[3];  // 0xC71 (0xC71)
	int32_t CallFunc_Max_ReturnValue_3;  // 0xC74 (0xC74)
	char pad_3192_1 : 7;  // 0xC78 (0xC78)
	bool CallFunc_AddGameplayTag_ReturnValue_3 : 1;  // 0xC78 (0xC78)
	char pad_3193[7];  // 0xC79 (0xC79)
	double CallFunc_Add_DoubleDouble_A_ImplicitCast;  // 0xC80 (0xC80)
	float CallFunc_MakeRotator_Yaw_ImplicitCast;  // 0xC88 (0xC88)
	char pad_3212[4];  // 0xC8C (0xC8C)
	double CallFunc_Add_DoubleDouble_A_ImplicitCast_2;  // 0xC90 (0xC90)
	float CallFunc_MakeRotator_Yaw_ImplicitCast_2;  // 0xC98 (0xC98)


}; 
 
 // Function BP_SkeletonWarlord.BP_SkeletonWarlord_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 // Function BP_SkeletonWarlord.BP_SkeletonWarlord_C.OnApplied_B30537AB4260FD37F0444CBA03F1D53F
struct FOnApplied_B30537AB4260FD37F0444CBA03F1D53F
{
	struct AActor* Source;  // 0x0 (0x0)
	struct FGameplayEffectSpecHandle SpecHandle;  // 0x8 (0x8)
	struct FActiveGameplayEffectHandle ActiveHandle;  // 0x18 (0x18)


}; 
 
 // Function BP_SkeletonWarlord.BP_SkeletonWarlord_C.Set Lv Gameplay Effect
struct FSet Lv Gameplay Effect
{
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x0 (0x0)
	struct FGameplayTag CallFunc_Array_Get_Item;  // 0x4 (0x4)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool CallFunc_AddGameplayTag_ReturnValue : 1;  // 0xC (0xC)


}; 
 
 