#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_SkeletonArcher_Arrow.BP_SkeletonArcher_Arrow_C.ExecuteUbergraph_BP_SkeletonArcher_Arrow
struct FExecuteUbergraph_BP_SkeletonArcher_Arrow
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FDelegate Temp_delegate_Variable;  // 0x4 (0x4)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x14 (0x14)
	int32_t K2Node_Event_InCount;  // 0x1C (0x1C)
	int32_t CallFunc_PostAkEvent_ReturnValue;  // 0x20 (0x20)
	char pad_36_1 : 7;  // 0x24 (0x24)
	bool CallFunc_EqualEqual_IntInt_ReturnValue : 1;  // 0x24 (0x24)
	char pad_37_1 : 7;  // 0x25 (0x25)
	bool CallFunc_MatchesTag_ReturnValue : 1;  // 0x25 (0x25)
	char pad_38_1 : 7;  // 0x26 (0x26)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0x26 (0x26)


}; 
 
 // Function BP_SkeletonArcher_Arrow.BP_SkeletonArcher_Arrow_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 