#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_SkeletonWarlord_RealmOfDomination_Aoe.BP_SkeletonWarlord_RealmOfDomination_Aoe_C.Trigger
// Size: 0x38(Inherited: 0x1F1)
struct FTrigger : FTrigger
{
	struct ADCCharacterBase* InputPin;  // 0x0 (0x0)
	struct ADCPlayerCharacterBase* K2Node_DynamicCast_AsDCPlayer_Character_Base;  // 0x8 (0x8)
	char pad_513_1 : 7;  // 0x201 (0x201)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x10 (0x10)
	int32_t Temp_int_Variable;  // 0x14 (0x14)
	struct APawn* CallFunc_GetInstigator_ReturnValue;  // 0x18 (0x18)
	struct ABP_SkeletonWarlord_C* K2Node_DynamicCast_AsBP_Skeleton_Warlord;  // 0x20 (0x20)
	char pad_534_1 : 7;  // 0x216 (0x216)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x28 (0x28)
	int32_t CallFunc_Map_Find_Value;  // 0x2C (0x2C)
	char pad_539_1 : 7;  // 0x21B (0x21B)
	bool CallFunc_Map_Find_ReturnValue : 1;  // 0x30 (0x30)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x34 (0x34)


}; 
 
 // Function BP_SkeletonWarlord_RealmOfDomination_Aoe.BP_SkeletonWarlord_RealmOfDomination_Aoe_C.Remove
// Size: 0x28(Inherited: 0x2C)
struct FRemove : FRemove
{
	struct ADCCharacterBase* InputPin;  // 0x0 (0x0)
	struct APawn* CallFunc_GetInstigator_ReturnValue;  // 0x8 (0x8)
	struct ABP_SkeletonWarlord_C* K2Node_DynamicCast_AsBP_Skeleton_Warlord;  // 0x10 (0x10)
	char pad_68_1 : 7;  // 0x44 (0x44)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x18 (0x18)
	int32_t CallFunc_Map_Find_Value;  // 0x1C (0x1C)
	char pad_73_1 : 7;  // 0x49 (0x49)
	bool CallFunc_Map_Find_ReturnValue : 1;  // 0x20 (0x20)
	char pad_74_1 : 7;  // 0x4A (0x4A)
	bool CallFunc_Map_Remove_ReturnValue : 1;  // 0x21 (0x21)
	char pad_75_1 : 7;  // 0x4B (0x4B)
	bool CallFunc_LessEqual_IntInt_ReturnValue : 1;  // 0x22 (0x22)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x24 (0x24)


}; 
 
 