#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_SkeletonGuardman_Summoned.BP_SkeletonGuardman_Summoned_C.OnFail_0C22106A422FB7F5993CDF9DAC80D187
struct FOnFail_0C22106A422FB7F5993CDF9DAC80D187
{
	enum class EPathFollowingResult MovementResult;  // 0x0 (0x0)


}; 
 
 // Function BP_SkeletonGuardman_Summoned.BP_SkeletonGuardman_Summoned_C.BndEvt__BP_SkeletonArcher_Summoned_DCGameObjectLink_K2Node_ComponentBoundEvent_2_DCGameObjectLinkComponentUMsgGameLinkerRequest__DelegateSignature
struct FBndEvt__BP_SkeletonArcher_Summoned_DCGameObjectLink_K2Node_ComponentBoundEvent_2_DCGameObjectLinkComponentUMsgGameLinkerRequest__DelegateSignature
{
	struct FObjectLinkRequestEvent RecvEvent;  // 0x0 (0x0)
	struct UObjectLinkMetaDataBlueprint* SendEventParam;  // 0xB0 (0xB0)


}; 
 
 // Function BP_SkeletonGuardman_Summoned.BP_SkeletonGuardman_Summoned_C.ExecuteUbergraph_BP_SkeletonGuardman_Summoned
struct FExecuteUbergraph_BP_SkeletonGuardman_Summoned
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue;  // 0x8 (0x8)
	char CallFunc_MakeLiteralByte_ReturnValue;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool Temp_bool_Variable : 1;  // 0x11 (0x11)
	char pad_18[14];  // 0x12 (0x12)
	struct FTransform CallFunc_GetTransform_ReturnValue;  // 0x20 (0x20)
	struct ADCCharacterBase* K2Node_Event_InInstigator;  // 0x80 (0x80)
	struct AActor* K2Node_Event_InEffectCauser;  // 0x88 (0x88)
	struct ABP_ProjectileActor_C* K2Node_DynamicCast_AsBP_Projectile_Actor;  // 0x90 (0x90)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x98 (0x98)
	char pad_153[7];  // 0x99 (0x99)
	struct AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue;  // 0xA0 (0xA0)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0xA8 (0xA8)
	struct ABP_SkeletonGuardmanShield_C* CallFunc_FinishSpawningActor_ReturnValue;  // 0x158 (0x158)
	struct AActor* K2Node_Event_Interacter_2;  // 0x160 (0x160)
	struct UPrimitiveComponent* K2Node_Event_InteractPart;  // 0x168 (0x168)
	char pad_368_1 : 7;  // 0x170 (0x170)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute : 1;  // 0x170 (0x170)
	char pad_369[3];  // 0x171 (0x171)
	float CallFunc_GetFloatAttribute_ReturnValue;  // 0x174 (0x174)
	struct AActor* K2Node_Event_Interacter;  // 0x178 (0x178)
	char pad_384_1 : 7;  // 0x180 (0x180)
	bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue : 1;  // 0x180 (0x180)
	char pad_385[7];  // 0x181 (0x181)
	double CallFunc_RandomFloatInRange_ReturnValue;  // 0x188 (0x188)
	struct UAbilityAsync_WaitGameplayTagRemoved* CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue;  // 0x190 (0x190)
	char pad_408_1 : 7;  // 0x198 (0x198)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x198 (0x198)
	char pad_409_1 : 7;  // 0x199 (0x199)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // 0x199 (0x199)
	char pad_410_1 : 7;  // 0x19A (0x19A)
	bool CallFunc_Death_ReturnValue : 1;  // 0x19A (0x19A)
	char pad_411[1];  // 0x19B (0x19B)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x19C (0x19C)
	char pad_428_1 : 7;  // 0x1AC (0x1AC)
	bool CallFunc_Set_Target_Provider_Result : 1;  // 0x1AC (0x1AC)
	char pad_429_1 : 7;  // 0x1AD (0x1AD)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x1AD (0x1AD)
	char pad_430_1 : 7;  // 0x1AE (0x1AE)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x1AE (0x1AE)
	char pad_431[1];  // 0x1AF (0x1AF)
	struct TArray<struct FPrimaryAssetId> K2Node_MakeArray_Array;  // 0x1B0 (0x1B0)
	struct FMsgGASAttributeNotify K2Node_Event_InMsg;  // 0x1C0 (0x1C0)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue;  // 0x698 (0x698)
	struct AActor* CallFunc_DCEffectContextGetInstigatorActor_ReturnValue;  // 0x6A8 (0x6A8)
	char pad_1712_1 : 7;  // 0x6B0 (0x6B0)
	bool CallFunc_EqualEqual_GameplayAttributeGameplayAttribute_ReturnValue : 1;  // 0x6B0 (0x6B0)
	char pad_1713_1 : 7;  // 0x6B1 (0x6B1)
	bool CallFunc_IsValid_ReturnValue_4 : 1;  // 0x6B1 (0x6B1)
	char pad_1714_1 : 7;  // 0x6B2 (0x6B2)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2 : 1;  // 0x6B2 (0x6B2)
	char pad_1715[1];  // 0x6B3 (0x6B3)
	float CallFunc_GetFloatAttribute_ReturnValue_2;  // 0x6B4 (0x6B4)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x6B8 (0x6B8)
	int32_t K2Node_Event_InCount;  // 0x6C0 (0x6C0)
	char pad_1732_1 : 7;  // 0x6C4 (0x6C4)
	bool CallFunc_Less_DoubleDouble_ReturnValue : 1;  // 0x6C4 (0x6C4)
	char pad_1733_1 : 7;  // 0x6C5 (0x6C5)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x6C5 (0x6C5)
	char pad_1734_1 : 7;  // 0x6C6 (0x6C6)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess : 1;  // 0x6C6 (0x6C6)
	char pad_1735_1 : 7;  // 0x6C7 (0x6C7)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_2 : 1;  // 0x6C7 (0x6C7)
	char pad_1736_1 : 7;  // 0x6C8 (0x6C8)
	bool CallFunc_Less_DoubleDouble_ReturnValue_2 : 1;  // 0x6C8 (0x6C8)
	char pad_1737_1 : 7;  // 0x6C9 (0x6C9)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue : 1;  // 0x6C9 (0x6C9)
	enum class EPathFollowingResult Temp_byte_Variable;  // 0x6CA (0x6CA)
	char pad_1739_1 : 7;  // 0x6CB (0x6CB)
	bool CallFunc_RemoveGameplayTag_ReturnValue : 1;  // 0x6CB (0x6CB)
	enum class EPathFollowingResult K2Node_CustomEvent_MovementResult;  // 0x6CC (0x6CC)
	char pad_1741[3];  // 0x6CD (0x6CD)
	struct TScriptInterface<IGameplayTagAssetInterface> K2Node_DynamicCast_As_________________;  // 0x6D0 (0x6D0)
	char pad_1760_1 : 7;  // 0x6E0 (0x6E0)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x6E0 (0x6E0)
	char pad_1761_1 : 7;  // 0x6E1 (0x6E1)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_2 : 1;  // 0x6E1 (0x6E1)
	char pad_1762[6];  // 0x6E2 (0x6E2)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_2;  // 0x6E8 (0x6E8)
	char pad_1776_1 : 7;  // 0x6F0 (0x6F0)
	bool CallFunc_IsValid_ReturnValue_5 : 1;  // 0x6F0 (0x6F0)
	char pad_1777[7];  // 0x6F1 (0x6F1)
	struct UAbilityAsync_WaitGameplayTagRemoved* CallFunc_WaitGameplayTagRemoveFromActor_ReturnValue_2;  // 0x6F8 (0x6F8)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;  // 0x700 (0x700)
	char pad_1808_1 : 7;  // 0x710 (0x710)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_3 : 1;  // 0x710 (0x710)
	char pad_1809_1 : 7;  // 0x711 (0x711)
	bool CallFunc_IsValid_ReturnValue_6 : 1;  // 0x711 (0x711)
	char pad_1810[6];  // 0x712 (0x712)
	struct FObjectLinkRequestEvent K2Node_ComponentBoundEvent_RecvEvent;  // 0x718 (0x718)
	struct UObjectLinkMetaDataBlueprint* K2Node_ComponentBoundEvent_SendEventParam;  // 0x7C8 (0x7C8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x7D0 (0x7D0)
	char pad_2016_1 : 7;  // 0x7E0 (0x7E0)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x7E0 (0x7E0)
	char pad_2017_1 : 7;  // 0x7E1 (0x7E1)
	bool CallFunc_EqualEqual_DoubleDouble_ReturnValue : 1;  // 0x7E1 (0x7E1)
	char pad_2018[6];  // 0x7E2 (0x7E2)
	struct ABP_Lich_Common_C* K2Node_DynamicCast_AsBP_Lich_Common;  // 0x7E8 (0x7E8)
	char pad_2032_1 : 7;  // 0x7F0 (0x7F0)
	bool K2Node_DynamicCast_bSuccess_3 : 1;  // 0x7F0 (0x7F0)
	char pad_2033_1 : 7;  // 0x7F1 (0x7F1)
	bool GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_3 : 1;  // 0x7F1 (0x7F1)
	char pad_2034_1 : 7;  // 0x7F2 (0x7F2)
	bool CallFunc_EqualEqual_GameplayTag_ReturnValue : 1;  // 0x7F2 (0x7F2)
	char pad_2035_1 : 7;  // 0x7F3 (0x7F3)
	bool CallFunc_LinkEventBase_Result : 1;  // 0x7F3 (0x7F3)
	char pad_2036_1 : 7;  // 0x7F4 (0x7F4)
	bool CallFunc_AddGameplayTag_ReturnValue : 1;  // 0x7F4 (0x7F4)
	char pad_2037_1 : 7;  // 0x7F5 (0x7F5)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_4 : 1;  // 0x7F5 (0x7F5)
	char pad_2038[2];  // 0x7F6 (0x7F6)
	struct UAnimMontage* CallFunc_GetCurrentMontage_ReturnValue;  // 0x7F8 (0x7F8)
	struct AAIController* CallFunc_GetAIController_ReturnValue;  // 0x800 (0x800)
	struct FHitResult CallFunc_K2_SetActorLocation_SweepHitResult;  // 0x808 (0x808)
	char pad_2288_1 : 7;  // 0x8F0 (0x8F0)
	bool CallFunc_K2_SetActorLocation_ReturnValue : 1;  // 0x8F0 (0x8F0)
	char pad_2289[7];  // 0x8F1 (0x8F1)
	struct UAIAsyncTaskBlueprintProxy* CallFunc_CreateMoveToProxyObject_ReturnValue;  // 0x8F8 (0x8F8)
	char pad_2304_1 : 7;  // 0x900 (0x900)
	bool CallFunc_AddGameplayTag_ReturnValue_2 : 1;  // 0x900 (0x900)
	char pad_2305_1 : 7;  // 0x901 (0x901)
	bool CallFunc_IsValid_ReturnValue_7 : 1;  // 0x901 (0x901)
	char pad_2306_1 : 7;  // 0x902 (0x902)
	bool CallFunc_HasAuthority_ReturnValue_2 : 1;  // 0x902 (0x902)
	enum class EPathFollowingResult K2Node_CustomEvent_MovementResult_2;  // 0x903 (0x903)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x904 (0x904)
	char pad_2324_1 : 7;  // 0x914 (0x914)
	bool CallFunc_IsValid_ReturnValue_8 : 1;  // 0x914 (0x914)
	char pad_2325[3];  // 0x915 (0x915)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_4;  // 0x918 (0x918)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue;  // 0x928 (0x928)
	struct AAIController* CallFunc_GetAIController_ReturnValue_2;  // 0x930 (0x930)
	char pad_2360_1 : 7;  // 0x938 (0x938)
	bool CallFunc_RemoveGameplayTag_ReturnValue_2 : 1;  // 0x938 (0x938)
	char pad_2361[7];  // 0x939 (0x939)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x940 (0x940)
	double CallFunc_Vector_Distance_ReturnValue;  // 0x958 (0x958)
	char pad_2400_1 : 7;  // 0x960 (0x960)
	bool CallFunc_Greater_DoubleDouble_ReturnValue : 1;  // 0x960 (0x960)
	char pad_2401[7];  // 0x961 (0x961)
	struct TArray<struct FPrimaryAssetId> K2Node_MakeArray_Array_2;  // 0x968 (0x968)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue_2;  // 0x978 (0x978)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_5;  // 0x988 (0x988)
	char pad_2456_1 : 7;  // 0x998 (0x998)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_5 : 1;  // 0x998 (0x998)
	char pad_2457_1 : 7;  // 0x999 (0x999)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_6 : 1;  // 0x999 (0x999)
	char pad_2458[2];  // 0x99A (0x99A)
	struct FName CallFunc_MakeLiteralName_ReturnValue;  // 0x99C (0x99C)
	char pad_2468[4];  // 0x9A4 (0x9A4)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue_3;  // 0x9A8 (0x9A8)
	struct FName CallFunc_MakeLiteralName_ReturnValue_2;  // 0x9B0 (0x9B0)
	char CallFunc_GetValueAsEnum_ReturnValue;  // 0x9B8 (0x9B8)
	char CallFunc_GetValidValue_ReturnValue;  // 0x9B9 (0x9B9)
	char pad_2490_1 : 7;  // 0x9BA (0x9BA)
	bool CallFunc_NotEqual_ByteByte_ReturnValue : 1;  // 0x9BA (0x9BA)
	char pad_2491[5];  // 0x9BB (0x9BB)
	double CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast;  // 0x9C0 (0x9C0)
	float CallFunc_Delay_Duration_ImplicitCast;  // 0x9C8 (0x9C8)
	char pad_2508[4];  // 0x9CC (0x9CC)
	double K2Node_VariableSet_Prev_HP_0_ImplicitCast;  // 0x9D0 (0x9D0)
	double K2Node_VariableSet_Prev_HP_0_ImplicitCast_2;  // 0x9D8 (0x9D8)
	double CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;  // 0x9E0 (0x9E0)
	double CallFunc_Less_DoubleDouble_B_ImplicitCast;  // 0x9E8 (0x9E8)
	double CallFunc_Less_DoubleDouble_A_ImplicitCast;  // 0x9F0 (0x9F0)
	double CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;  // 0x9F8 (0x9F8)


}; 
 
 // Function BP_SkeletonGuardman_Summoned.BP_SkeletonGuardman_Summoned_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 // Function BP_SkeletonGuardman_Summoned.BP_SkeletonGuardman_Summoned_C.InteractLost
// Size: 0x8(Inherited: 0x8)
struct FInteractLost : FInteractLost
{
	struct AActor* Interacter;  // 0x0 (0x0)


}; 
 
 // Function BP_SkeletonGuardman_Summoned.BP_SkeletonGuardman_Summoned_C.InteractFound
// Size: 0x10(Inherited: 0x10)
struct FInteractFound : FInteractFound
{
	struct AActor* Interacter;  // 0x0 (0x0)
	struct UPrimitiveComponent* InteractPart;  // 0x8 (0x8)


}; 
 
 // Function BP_SkeletonGuardman_Summoned.BP_SkeletonGuardman_Summoned_C.OnStuckByShield
// Size: 0x10(Inherited: 0x10)
struct FOnStuckByShield : FOnStuckByShield
{
	struct ADCCharacterBase* InInstigator;  // 0x0 (0x0)
	struct AActor* InEffectCauser;  // 0x8 (0x8)


}; 
 
 // Function BP_SkeletonGuardman_Summoned.BP_SkeletonGuardman_Summoned_C.OnSuccess_0C22106A422FB7F5993CDF9DAC80D187
struct FOnSuccess_0C22106A422FB7F5993CDF9DAC80D187
{
	enum class EPathFollowingResult MovementResult;  // 0x0 (0x0)


}; 
 
 // Function BP_SkeletonGuardman_Summoned.BP_SkeletonGuardman_Summoned_C.OnFMsgGASAttributeNotifyBlueprint
// Size: 0x4D8(Inherited: 0x4D8)
struct FOnFMsgGASAttributeNotifyBlueprint : FOnFMsgGASAttributeNotifyBlueprint
{
	struct FMsgGASAttributeNotify InMsg;  // 0x0 (0x0)


}; 
 
 