#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_SkeletonWarlord_BonePrison.BP_SkeletonWarlord_BonePrison_C.ExecuteUbergraph_BP_SkeletonWarlord_BonePrison
struct FExecuteUbergraph_BP_SkeletonWarlord_BonePrison
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FDelegate Temp_delegate_Variable;  // 0x4 (0x4)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool CallFunc_HasAuthority_ReturnValue : 1;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue;  // 0x18 (0x18)
	struct FGameplayTag K2Node_Event_InGameplayTag;  // 0x30 (0x30)
	int32_t K2Node_Event_InCount;  // 0x38 (0x38)
	struct FDelegate Temp_delegate_Variable_2;  // 0x3C (0x3C)
	char pad_76_1 : 7;  // 0x4C (0x4C)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x4C (0x4C)
	char pad_77_1 : 7;  // 0x4D (0x4D)
	bool CallFunc_EqualEqual_GameplayTag_ReturnValue : 1;  // 0x4D (0x4D)
	char pad_78_1 : 7;  // 0x4E (0x4E)
	bool CallFunc_Burrow_ReturnValue : 1;  // 0x4E (0x4E)
	char pad_79[1];  // 0x4F (0x4F)
	int32_t CallFunc_PostEvent_ReturnValue;  // 0x50 (0x50)
	int32_t CallFunc_PostEvent_ReturnValue_2;  // 0x54 (0x54)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue;  // 0x58 (0x58)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue;  // 0x60 (0x60)
	char pad_100_1 : 7;  // 0x64 (0x64)
	bool CallFunc_Array_Contains_ReturnValue : 1;  // 0x64 (0x64)
	char pad_101_1 : 7;  // 0x65 (0x65)
	bool CallFunc_Array_RemoveItem_ReturnValue : 1;  // 0x65 (0x65)


}; 
 
 // Function BP_SkeletonWarlord_BonePrison.BP_SkeletonWarlord_BonePrison_C.GameplayTagUpdated
// Size: 0xC(Inherited: 0xC)
struct FGameplayTagUpdated : FGameplayTagUpdated
{
	struct FGameplayTag InGameplayTag;  // 0x0 (0x0)
	int32_t InCount;  // 0x8 (0x8)


}; 
 
 