#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BP_TrapBase.BP_TrapBase_C.BndEvt__BP_HuntingTrapProp_DCTagCollisionDetector_K2Node_ComponentBoundEvent_3_GameplayTagCollisionDetectedSignature__DelegateSignature
struct FBndEvt__BP_HuntingTrapProp_DCTagCollisionDetector_K2Node_ComponentBoundEvent_3_GameplayTagCollisionDetectedSignature__DelegateSignature
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bDetected : 1;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FAccountDataReplication AccountDataReplication;  // 0x8 (0x8)


}; 
 
 // Function BP_TrapBase.BP_TrapBase_C.ExecuteUbergraph_BP_TrapBase
struct FExecuteUbergraph_BP_TrapBase
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_NotEqual_IntInt_ReturnValue : 1;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool K2Node_ComponentBoundEvent_bDetected : 1;  // 0x5 (0x5)
	char pad_6[2];  // 0x6 (0x6)
	struct FAccountDataReplication K2Node_ComponentBoundEvent_AccountDataReplication;  // 0x8 (0x8)
	char pad_128_1 : 7;  // 0x80 (0x80)
	bool CallFunc_NotEqual_GameplayTag_ReturnValue : 1;  // 0x80 (0x80)
	char pad_129[3];  // 0x81 (0x81)
	int32_t K2Node_Event_DepthValue;  // 0x84 (0x84)


}; 
 
 // Function BP_TrapBase.BP_TrapBase_C.OnTrapDetecting
struct FOnTrapDetecting
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool IsDetecting : 1;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FAccountDataReplication AccountDataReplication;  // 0x8 (0x8)


}; 
 
 // Function BP_TrapBase.BP_TrapBase_C.OnTrapDetectingByInteract
struct FOnTrapDetectingByInteract
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool IsDetecting : 1;  // 0x0 (0x0)


}; 
 
 // Function BP_TrapBase.BP_TrapBase_C.UpdateInteractDepthValue
// Size: 0x4(Inherited: 0x4)
struct FUpdateInteractDepthValue : FUpdateInteractDepthValue
{
	int32_t DepthValue;  // 0x0 (0x0)


}; 
 
 