#pragma once 
#include <BP_TrainingDummy_Armed_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_TrainingDummy_Armed.BP_TrainingDummy_Armed_C
// Size: 0x508(Inherited: 0x4B8)
struct ABP_TrainingDummy_Armed_C : ABP_PropsActorBase_C
{
	struct UBP_DCHitBox_C* BP_DCHitBox_Foot;  // 0x4B8 (0x4B8)
	struct UBP_DCHitBox_C* BP_DCHitBox_Hand_Arm_L;  // 0x4C0 (0x4C0)
	struct UBP_DCHitBox_C* BP_DCHitBox_Hand_Arm_R;  // 0x4C8 (0x4C8)
	struct UBP_DCHitBox_C* BP_DCHitBox_Hand_L;  // 0x4D0 (0x4D0)
	struct UBP_DCHitBox_C* BP_DCHitBox_Hand_R;  // 0x4D8 (0x4D8)
	struct UBP_DCHitBox_C* BP_DCHitBox_Head;  // 0x4E0 (0x4E0)
	struct UBP_DCHitBox_C* BP_DCHitBox_Body;  // 0x4E8 (0x4E8)
	struct UDCDamageIndicatorComponent* DCDamageIndicator;  // 0x4F0 (0x4F0)
	struct UBP_DCHitBox_C* BP_DCHitBox_Leg;  // 0x4F8 (0x4F8)
	struct UStaticMeshComponent* SM_Dummy_A;  // 0x500 (0x500)


}; 
 
 


