#pragma once 
#include <BP_UniqueItemActor_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_UniqueItemActor.BP_UniqueItemActor_C
// Size: 0x5A8(Inherited: 0x580)
struct ABP_UniqueItemActor_C : ABP_DCItemActor_C
{
	struct UNiagaraSystem* Hit FXS;  // 0x580 (0x580)
	char pad_1416_1 : 7;  // 0x588 (0x588)
	bool AttachToCollision : 1;  // 0x588 (0x588)
	char pad_1417[7];  // 0x589 (0x589)
	struct UNiagaraSystem* Kill FXS;  // 0x590 (0x590)
	char pad_1432_1 : 7;  // 0x598 (0x598)
	bool Ground FXS AttachToTarget : 1;  // 0x598 (0x598)
	char pad_1433[7];  // 0x599 (0x599)
	struct UNiagaraSystem* Ground FXS;  // 0x5A0 (0x5A0)


}; 
 
 


