#pragma once 
#include <BP_UndeadKnight_Common_Structs.h>
 
 
 
// BlueprintGeneratedClass BP_UndeadKnight_Common.BP_UndeadKnight_Common_C
// Size: 0x1200(Inherited: 0x11B8)
struct ABP_UndeadKnight_Common_C : ABP_DCMonsterBaseWithOptions_C
{
	struct FPointerToUberGraphFrame UberGraphFrame;  // 0x11B8 (0x11B8)
	struct UBP_DCHitBox_C* BP_DCHitBox9;  // 0x11C0 (0x11C0)
	struct UBP_DCHitBox_C* BP_DCHitBox8;  // 0x11C8 (0x11C8)
	struct UBP_DCHitBox_C* BP_DCHitBox7;  // 0x11D0 (0x11D0)
	struct UBP_DCHitBox_C* BP_DCHitBox6;  // 0x11D8 (0x11D8)
	struct UBP_DCHitBox_C* BP_DCHitBox5;  // 0x11E0 (0x11E0)
	struct UBP_DCHitBox_C* BP_DCHitBox3;  // 0x11E8 (0x11E8)
	struct UBP_DCHitBox_C* BP_DCHitBox1;  // 0x11F0 (0x11F0)
	struct UBP_DCHitBox_C* BP_DCHitBox;  // 0x11F8 (0x11F8)


	void Added_F50AB48B481209DF9DA8D5A43171B136(); // Function BP_UndeadKnight_Common.BP_UndeadKnight_Common_C.Added_F50AB48B481209DF9DA8D5A43171B136
	void Added_E19F842F40DC4892A5519BAE1CE16F59(); // Function BP_UndeadKnight_Common.BP_UndeadKnight_Common_C.Added_E19F842F40DC4892A5519BAE1CE16F59
	void OnSetAI(); // Function BP_UndeadKnight_Common.BP_UndeadKnight_Common_C.OnSetAI
	void ReceiveBeginPlay(); // Function BP_UndeadKnight_Common.BP_UndeadKnight_Common_C.ReceiveBeginPlay
	void OnFMsgGASActorDieNotifyBlueprint(struct FMsgGASActorDieNotify& InMsg); // Function BP_UndeadKnight_Common.BP_UndeadKnight_Common_C.OnFMsgGASActorDieNotifyBlueprint
	void ExecuteUbergraph_BP_UndeadKnight_Common(int32_t EntryPoint); // Function BP_UndeadKnight_Common.BP_UndeadKnight_Common_C.ExecuteUbergraph_BP_UndeadKnight_Common
}; 
 
 


