#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BTD_CheckToRunBehavior.BTD_CheckToRunBehavior_C.Check Conditional Top Priority Action Condition Function
struct FCheck Conditional Top Priority Action Condition Function
{
	struct ABP_DCMonsterBaseWithOptions_C* Monster BP;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)
	int32_t Temp_int_Loop_Counter_Variable;  // 0xC (0xC)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x10 (0x10)
	int32_t Temp_int_Array_Index_Variable;  // 0x14 (0x14)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x18 (0x18)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x1C (0x1C)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x20 (0x20)
	char pad_36_1 : 7;  // 0x24 (0x24)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x24 (0x24)
	char pad_37[3];  // 0x25 (0x25)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x28 (0x28)
	enum class E_BTCheckFloatCondition CallFunc_Array_Get_Item;  // 0x2C (0x2C)
	char pad_45_1 : 7;  // 0x2D (0x2D)
	bool CallFunc_EqualEqual_IntInt_ReturnValue : 1;  // 0x2D (0x2D)
	char pad_46_1 : 7;  // 0x2E (0x2E)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x2E (0x2E)
	char pad_47[1];  // 0x2F (0x2F)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x30 (0x30)
	char pad_52_1 : 7;  // 0x34 (0x34)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x34 (0x34)
	char pad_53[3];  // 0x35 (0x35)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)
	double CallFunc_Array_Get_Item_2;  // 0x40 (0x40)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_3;  // 0x48 (0x48)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool CallFunc_Array_RemoveItem_ReturnValue : 1;  // 0x50 (0x50)
	char pad_81_1 : 7;  // 0x51 (0x51)
	bool CallFunc_Check_Target_Has_State_Tags_To_Lose_From_Array_Result : 1;  // 0x51 (0x51)
	char pad_82[6];  // 0x52 (0x52)
	double CallFunc_RandomFloatInRange_ReturnValue;  // 0x58 (0x58)
	char pad_96_1 : 7;  // 0x60 (0x60)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue : 1;  // 0x60 (0x60)
	char pad_97[7];  // 0x61 (0x61)
	double CallFunc_Array_Get_Item_4;  // 0x68 (0x68)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x70 (0x70)
	char pad_116_1 : 7;  // 0x74 (0x74)
	bool CallFunc_FilterTagedTargets_ReturnValue : 1;  // 0x74 (0x74)
	char pad_117_1 : 7;  // 0x75 (0x75)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x75 (0x75)
	char pad_118_1 : 7;  // 0x76 (0x76)
	bool CallFunc_FilterTargetsWithinDistance_ReturnValue : 1;  // 0x76 (0x76)
	char pad_119_1 : 7;  // 0x77 (0x77)
	bool CallFunc_GetAllTargetArray_ReturnValue : 1;  // 0x77 (0x77)
	char pad_120_1 : 7;  // 0x78 (0x78)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute : 1;  // 0x78 (0x78)
	char pad_121[3];  // 0x79 (0x79)
	float CallFunc_GetFloatAttribute_ReturnValue;  // 0x7C (0x7C)
	char pad_128_1 : 7;  // 0x80 (0x80)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2 : 1;  // 0x80 (0x80)
	char pad_129[3];  // 0x81 (0x81)
	float CallFunc_GetFloatAttribute_ReturnValue_2;  // 0x84 (0x84)
	double CallFunc_Divide_DoubleDouble_ReturnValue;  // 0x88 (0x88)
	double CallFunc_Array_Get_Item_5;  // 0x90 (0x90)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x98 (0x98)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue_2 : 1;  // 0xA0 (0xA0)
	char pad_161_1 : 7;  // 0xA1 (0xA1)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3 : 1;  // 0xA1 (0xA1)
	char pad_162[2];  // 0xA2 (0xA2)
	float CallFunc_GetFloatAttribute_ReturnValue_3;  // 0xA4 (0xA4)
	double CallFunc_Array_Get_Item_6;  // 0xA8 (0xA8)
	char pad_176_1 : 7;  // 0xB0 (0xB0)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue_3 : 1;  // 0xB0 (0xB0)
	char pad_177[3];  // 0xB1 (0xB1)
	float CallFunc_FilterTargetsWithinDistance_Distance_ImplicitCast;  // 0xB4 (0xB4)
	double CallFunc_Divide_DoubleDouble_B_ImplicitCast;  // 0xB8 (0xB8)
	double CallFunc_Divide_DoubleDouble_A_ImplicitCast;  // 0xC0 (0xC0)
	double CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;  // 0xC8 (0xC8)


}; 
 
 // Function BTD_CheckToRunBehavior.BTD_CheckToRunBehavior_C.Check Combat Action Type Function
struct FCheck Combat Action Type Function
{
	struct ABP_DCMonsterBaseWithOptions_C* MonsterBP;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool Return Value : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x9 (0x9)
	char pad_10_1 : 7;  // 0xA (0xA)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0xA (0xA)


}; 
 
 // Function BTD_CheckToRunBehavior.BTD_CheckToRunBehavior_C.Check Conditional Top Priority Action Type Function
struct FCheck Conditional Top Priority Action Type Function
{
	struct ABP_DCMonsterBaseWithOptions_C* Monster BP;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool Return Value : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x9 (0x9)
	char pad_10_1 : 7;  // 0xA (0xA)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue : 1;  // 0xA (0xA)
	char pad_11_1 : 7;  // 0xB (0xB)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_2 : 1;  // 0xB (0xB)


}; 
 
 // Function BTD_CheckToRunBehavior.BTD_CheckToRunBehavior_C.PerformConditionCheckAI
// Size: 0x2D(Inherited: 0x18)
struct FPerformConditionCheckAI : FPerformConditionCheckAI
{
	struct AAIController* OwnerController;  // 0x0 (0x0)
	struct APawn* ControlledPawn;  // 0x8 (0x8)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool ReturnValue : 1;  // 0x10 (0x10)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x18 (0x18)
	char pad_49_1 : 7;  // 0x31 (0x31)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x20 (0x20)
	char pad_50_1 : 7;  // 0x32 (0x32)
	bool CallFunc_Check_Combat_Action_Type_Function_Return_Value : 1;  // 0x21 (0x21)
	char pad_51_1 : 7;  // 0x33 (0x33)
	bool CallFunc_Check_Peace_Action_Type_Function_ReturnValue : 1;  // 0x22 (0x22)
	char pad_52_1 : 7;  // 0x34 (0x34)
	bool CallFunc_Check_Conditional_Top_Priority_Action_Condition_Function_ReturnValue : 1;  // 0x23 (0x23)
	char pad_53_1 : 7;  // 0x35 (0x35)
	bool CallFunc_Check_Conditional_Top_Priority_Action_Type_Function_Return_Value : 1;  // 0x24 (0x24)
	char pad_54_1 : 7;  // 0x36 (0x36)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x25 (0x25)
	char pad_55_1 : 7;  // 0x37 (0x37)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x26 (0x26)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x27 (0x27)
	char pad_57_1 : 7;  // 0x39 (0x39)
	bool CallFunc_IsValid_ReturnValue_4 : 1;  // 0x28 (0x28)
	char pad_58_1 : 7;  // 0x3A (0x3A)
	bool K2Node_SwitchInteger_CmpSuccess : 1;  // 0x29 (0x29)
	char pad_59_1 : 7;  // 0x3B (0x3B)
	bool K2Node_SwitchInteger_CmpSuccess_2 : 1;  // 0x2A (0x2A)
	char pad_60_1 : 7;  // 0x3C (0x3C)
	bool K2Node_SwitchInteger_CmpSuccess_3 : 1;  // 0x2B (0x2B)
	char pad_61_1 : 7;  // 0x3D (0x3D)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x2C (0x2C)


}; 
 
 // Function BTD_CheckToRunBehavior.BTD_CheckToRunBehavior_C.Check Peace Action Type Function
struct FCheck Peace Action Type Function
{
	struct ABP_DCMonsterBaseWithOptions_C* MonsterBP;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x9 (0x9)
	char pad_10_1 : 7;  // 0xA (0xA)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue : 1;  // 0xA (0xA)
	char pad_11_1 : 7;  // 0xB (0xB)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_2 : 1;  // 0xB (0xB)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_3 : 1;  // 0xC (0xC)


}; 
 
 