#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BTD_ProbabilitySuccess.BTD_ProbabilitySuccess_C.PerformConditionCheckAI
// Size: 0x38(Inherited: 0x18)
struct FPerformConditionCheckAI : FPerformConditionCheckAI
{
	struct AAIController* OwnerController;  // 0x0 (0x0)
	struct APawn* ControlledPawn;  // 0x8 (0x8)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_41_1 : 7;  // 0x29 (0x29)
	bool CallFunc_EqualEqual_DoubleDouble_ReturnValue : 1;  // 0x11 (0x11)
	float CallFunc_GetBlackboardValueAsFloat_ReturnValue;  // 0x14 (0x14)
	char pad_46_1 : 7;  // 0x2E (0x2E)
	bool CallFunc_EqualEqual_DoubleDouble_ReturnValue_2 : 1;  // 0x18 (0x18)
	char pad_47_1 : 7;  // 0x2F (0x2F)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue : 1;  // 0x19 (0x19)
	double CallFunc_RandomFloatInRange_ReturnValue;  // 0x20 (0x20)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue_2 : 1;  // 0x28 (0x28)
	double CallFunc_LessEqual_DoubleDouble_B_ImplicitCast;  // 0x30 (0x30)


}; 
 
 