#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function BTT_GetTargetActor.BTT_GetTargetActor_C.Sorting
struct FSorting
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bool : 1;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	int32_t Temp_int_Variable;  // 0x4 (0x4)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x8 (0x8)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0xC (0xC)
	int32_t Temp_int_Variable_2;  // 0x10 (0x10)
	int32_t CallFunc_Add_IntInt_ReturnValue_3;  // 0x14 (0x14)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x18 (0x18)
	char pad_28_1 : 7;  // 0x1C (0x1C)
	bool CallFunc_SortTargetsByDistance_ReturnValue : 1;  // 0x1C (0x1C)
	char pad_29[3];  // 0x1D (0x1D)
	int32_t Temp_int_Variable_3;  // 0x20 (0x20)
	int32_t CallFunc_Add_IntInt_ReturnValue_4;  // 0x24 (0x24)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x28 (0x28)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x2C (0x2C)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x30 (0x30)
	char pad_49_1 : 7;  // 0x31 (0x31)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x31 (0x31)
	char pad_50[2];  // 0x32 (0x32)
	int32_t Temp_int_Variable_4;  // 0x34 (0x34)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x38 (0x38)
	int32_t CallFunc_Add_IntInt_ReturnValue_5;  // 0x3C (0x3C)
	char pad_64_1 : 7;  // 0x40 (0x40)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x40 (0x40)
	char pad_65[3];  // 0x41 (0x41)
	int32_t CallFunc_Add_IntInt_ReturnValue_6;  // 0x44 (0x44)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x48 (0x48)
	char pad_76_1 : 7;  // 0x4C (0x4C)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x4C (0x4C)
	char pad_77[3];  // 0x4D (0x4D)
	int32_t CallFunc_Add_IntInt_ReturnValue_7;  // 0x50 (0x50)
	int32_t Temp_int_Array_Index_Variable;  // 0x54 (0x54)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0x58 (0x58)
	int32_t CallFunc_Add_IntInt_ReturnValue_8;  // 0x60 (0x60)
	char pad_100_1 : 7;  // 0x64 (0x64)
	bool CallFunc_GetAggroPoint_bSuccessfully : 1;  // 0x64 (0x64)
	char pad_101[3];  // 0x65 (0x65)
	float CallFunc_GetAggroPoint_ReturnValue;  // 0x68 (0x68)
	char pad_108[4];  // 0x6C (0x6C)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_2;  // 0x70 (0x70)
	int32_t CallFunc_Add_IntInt_ReturnValue_9;  // 0x78 (0x78)
	char pad_124_1 : 7;  // 0x7C (0x7C)
	bool CallFunc_GetAggroPoint_bSuccessfully_2 : 1;  // 0x7C (0x7C)
	char pad_125[3];  // 0x7D (0x7D)
	float CallFunc_GetAggroPoint_ReturnValue_2;  // 0x80 (0x80)
	char pad_132_1 : 7;  // 0x84 (0x84)
	bool CallFunc_LessEqual_IntInt_ReturnValue : 1;  // 0x84 (0x84)
	char pad_133_1 : 7;  // 0x85 (0x85)
	bool CallFunc_EqualEqual_DoubleDouble_ReturnValue : 1;  // 0x85 (0x85)
	char pad_134[2];  // 0x86 (0x86)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_3;  // 0x88 (0x88)
	int32_t CallFunc_Array_Length_ReturnValue_5;  // 0x90 (0x90)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x94 (0x94)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_2;  // 0x98 (0x98)
	char pad_156_1 : 7;  // 0x9C (0x9C)
	bool CallFunc_LessEqual_IntInt_ReturnValue_2 : 1;  // 0x9C (0x9C)
	char pad_157_1 : 7;  // 0x9D (0x9D)
	bool CallFunc_LessEqual_IntInt_ReturnValue_3 : 1;  // 0x9D (0x9D)
	char pad_158_1 : 7;  // 0x9E (0x9E)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute : 1;  // 0x9E (0x9E)
	char pad_159[1];  // 0x9F (0x9F)
	float CallFunc_GetFloatAttribute_ReturnValue;  // 0xA0 (0xA0)
	char pad_164[4];  // 0xA4 (0xA4)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_4;  // 0xA8 (0xA8)
	char pad_176_1 : 7;  // 0xB0 (0xB0)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2 : 1;  // 0xB0 (0xB0)
	char pad_177[3];  // 0xB1 (0xB1)
	float CallFunc_GetFloatAttribute_ReturnValue_2;  // 0xB4 (0xB4)
	char pad_184_1 : 7;  // 0xB8 (0xB8)
	bool CallFunc_Greater_DoubleDouble_ReturnValue : 1;  // 0xB8 (0xB8)
	char pad_185_1 : 7;  // 0xB9 (0xB9)
	bool CallFunc_Less_DoubleDouble_ReturnValue : 1;  // 0xB9 (0xB9)
	char pad_186_1 : 7;  // 0xBA (0xBA)
	bool K2Node_SwitchEnum_CmpSuccess_2 : 1;  // 0xBA (0xBA)
	char pad_187[1];  // 0xBB (0xBB)
	int32_t CallFunc_Array_Length_ReturnValue_6;  // 0xBC (0xBC)
	char pad_192_1 : 7;  // 0xC0 (0xC0)
	bool Temp_bool_True_if_break_was_hit_Variable : 1;  // 0xC0 (0xC0)
	char pad_193_1 : 7;  // 0xC1 (0xC1)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_2 : 1;  // 0xC1 (0xC1)
	char pad_194_1 : 7;  // 0xC2 (0xC2)
	bool CallFunc_Not_PreBool_ReturnValue : 1;  // 0xC2 (0xC2)
	char pad_195_1 : 7;  // 0xC3 (0xC3)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0xC3 (0xC3)
	char pad_196[4];  // 0xC4 (0xC4)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_5;  // 0xC8 (0xC8)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_6;  // 0xD0 (0xD0)
	char pad_216_1 : 7;  // 0xD8 (0xD8)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3 : 1;  // 0xD8 (0xD8)
	char pad_217[3];  // 0xD9 (0xD9)
	float CallFunc_GetFloatAttribute_ReturnValue_3;  // 0xDC (0xDC)
	char pad_224_1 : 7;  // 0xE0 (0xE0)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_4 : 1;  // 0xE0 (0xE0)
	char pad_225[3];  // 0xE1 (0xE1)
	float CallFunc_GetFloatAttribute_ReturnValue_4;  // 0xE4 (0xE4)
	char pad_232_1 : 7;  // 0xE8 (0xE8)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_5 : 1;  // 0xE8 (0xE8)
	char pad_233[3];  // 0xE9 (0xE9)
	float CallFunc_GetFloatAttribute_ReturnValue_5;  // 0xEC (0xEC)
	double CallFunc_Divide_DoubleDouble_ReturnValue;  // 0xF0 (0xF0)
	char pad_248_1 : 7;  // 0xF8 (0xF8)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_6 : 1;  // 0xF8 (0xF8)
	char pad_249[3];  // 0xF9 (0xF9)
	float CallFunc_GetFloatAttribute_ReturnValue_6;  // 0xFC (0xFC)
	int32_t Temp_int_Variable_5;  // 0x100 (0x100)
	char pad_260[4];  // 0x104 (0x104)
	double CallFunc_Divide_DoubleDouble_ReturnValue_2;  // 0x108 (0x108)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_7;  // 0x110 (0x110)
	char pad_280_1 : 7;  // 0x118 (0x118)
	bool CallFunc_Greater_DoubleDouble_ReturnValue_2 : 1;  // 0x118 (0x118)
	char pad_281[3];  // 0x119 (0x119)
	int32_t CallFunc_Array_AddUnique_ReturnValue;  // 0x11C (0x11C)
	char pad_288_1 : 7;  // 0x120 (0x120)
	bool CallFunc_Less_DoubleDouble_ReturnValue_2 : 1;  // 0x120 (0x120)
	char pad_289_1 : 7;  // 0x121 (0x121)
	bool CallFunc_LessEqual_IntInt_ReturnValue_4 : 1;  // 0x121 (0x121)
	char pad_290[2];  // 0x122 (0x122)
	int32_t CallFunc_Add_IntInt_ReturnValue_10;  // 0x124 (0x124)
	int32_t CallFunc_Array_Length_ReturnValue_7;  // 0x128 (0x128)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_3;  // 0x12C (0x12C)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_4;  // 0x130 (0x130)
	char pad_308_1 : 7;  // 0x134 (0x134)
	bool CallFunc_LessEqual_IntInt_ReturnValue_5 : 1;  // 0x134 (0x134)
	char pad_309_1 : 7;  // 0x135 (0x135)
	bool CallFunc_LessEqual_IntInt_ReturnValue_6 : 1;  // 0x135 (0x135)
	char pad_310_1 : 7;  // 0x136 (0x136)
	bool CallFunc_SortTargetsByAggro_ReturnValue : 1;  // 0x136 (0x136)
	char pad_311_1 : 7;  // 0x137 (0x137)
	bool CallFunc_SortTargetsByDistance_ReturnValue_2 : 1;  // 0x137 (0x137)
	char pad_312_1 : 7;  // 0x138 (0x138)
	bool K2Node_SwitchEnum_CmpSuccess_3 : 1;  // 0x138 (0x138)
	char pad_313[7];  // 0x139 (0x139)
	double CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;  // 0x140 (0x140)
	double CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast;  // 0x148 (0x148)
	double CallFunc_Less_DoubleDouble_B_ImplicitCast;  // 0x150 (0x150)
	double CallFunc_Greater_DoubleDouble_B_ImplicitCast;  // 0x158 (0x158)
	double CallFunc_Less_DoubleDouble_A_ImplicitCast;  // 0x160 (0x160)
	double CallFunc_Greater_DoubleDouble_A_ImplicitCast;  // 0x168 (0x168)
	double CallFunc_Divide_DoubleDouble_B_ImplicitCast;  // 0x170 (0x170)
	double CallFunc_Divide_DoubleDouble_A_ImplicitCast;  // 0x178 (0x178)
	double CallFunc_Divide_DoubleDouble_B_ImplicitCast_2;  // 0x180 (0x180)
	double CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;  // 0x188 (0x188)


}; 
 
 // Function BTT_GetTargetActor.BTT_GetTargetActor_C.FilterHP
struct FFilterHP
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bool : 1;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	int32_t Temp_int_Array_Index_Variable;  // 0x4 (0x4)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x8 (0x8)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0xC (0xC)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x14 (0x14)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x18 (0x18)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_2;  // 0x1C (0x1C)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_2 : 1;  // 0x20 (0x20)
	char pad_33[3];  // 0x21 (0x21)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x24 (0x24)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_3 : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0x30 (0x30)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x38 (0x38)
	char pad_60_1 : 7;  // 0x3C (0x3C)
	bool CallFunc_Array_RemoveItem_ReturnValue : 1;  // 0x3C (0x3C)
	char pad_61[3];  // 0x3D (0x3D)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_3;  // 0x40 (0x40)
	char pad_68_1 : 7;  // 0x44 (0x44)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute : 1;  // 0x44 (0x44)
	char pad_69[3];  // 0x45 (0x45)
	float CallFunc_GetFloatAttribute_ReturnValue;  // 0x48 (0x48)
	int32_t CallFunc_Max_ReturnValue;  // 0x4C (0x4C)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2 : 1;  // 0x50 (0x50)
	char pad_81[3];  // 0x51 (0x51)
	float CallFunc_GetFloatAttribute_ReturnValue_2;  // 0x54 (0x54)
	double CallFunc_Divide_DoubleDouble_ReturnValue;  // 0x58 (0x58)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x60 (0x60)
	char pad_104_1 : 7;  // 0x68 (0x68)
	bool CallFunc_Greater_DoubleDouble_ReturnValue : 1;  // 0x68 (0x68)
	char pad_105[7];  // 0x69 (0x69)
	struct ADCCharacterBase* CallFunc_Array_Get_Item_2;  // 0x70 (0x70)
	char pad_120_1 : 7;  // 0x78 (0x78)
	bool CallFunc_Array_RemoveItem_ReturnValue_2 : 1;  // 0x78 (0x78)
	char pad_121_1 : 7;  // 0x79 (0x79)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3 : 1;  // 0x79 (0x79)
	char pad_122[2];  // 0x7A (0x7A)
	float CallFunc_GetFloatAttribute_ReturnValue_3;  // 0x7C (0x7C)
	char pad_128_1 : 7;  // 0x80 (0x80)
	bool CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_4 : 1;  // 0x80 (0x80)
	char pad_129[3];  // 0x81 (0x81)
	float CallFunc_GetFloatAttribute_ReturnValue_4;  // 0x84 (0x84)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x88 (0x88)
	char pad_140[4];  // 0x8C (0x8C)
	double CallFunc_Divide_DoubleDouble_ReturnValue_2;  // 0x90 (0x90)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_4;  // 0x98 (0x98)
	char pad_156[4];  // 0x9C (0x9C)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_2;  // 0xA0 (0xA0)
	int32_t CallFunc_Max_ReturnValue_2;  // 0xA8 (0xA8)
	char pad_172_1 : 7;  // 0xAC (0xAC)
	bool CallFunc_Less_DoubleDouble_ReturnValue : 1;  // 0xAC (0xAC)
	char pad_173[3];  // 0xAD (0xAD)
	double CallFunc_Divide_DoubleDouble_B_ImplicitCast;  // 0xB0 (0xB0)
	double CallFunc_Divide_DoubleDouble_A_ImplicitCast;  // 0xB8 (0xB8)
	double CallFunc_Divide_DoubleDouble_B_ImplicitCast_2;  // 0xC0 (0xC0)
	double CallFunc_Divide_DoubleDouble_A_ImplicitCast_2;  // 0xC8 (0xC8)


}; 
 
 // Function BTT_GetTargetActor.BTT_GetTargetActor_C.ClearVariables
struct FClearVariables
{
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x4 (0x4)


}; 
 
 // Function BTT_GetTargetActor.BTT_GetTargetActor_C.TargetingType
struct FTargetingType
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bool : 1;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x8 (0x8)


}; 
 
 // Function BTT_GetTargetActor.BTT_GetTargetActor_C.ExecuteUbergraph_BTT_GetTargetActor
struct FExecuteUbergraph_BTT_GetTargetActor
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_EqualEqual_ObjectObject_ReturnValue : 1;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool CallFunc_TargetingType_Bool : 1;  // 0x5 (0x5)
	char pad_6_1 : 7;  // 0x6 (0x6)
	bool CallFunc_FilterTags_Bool : 1;  // 0x6 (0x6)
	char pad_7_1 : 7;  // 0x7 (0x7)
	bool CallFunc_FilterRange_Bool : 1;  // 0x7 (0x7)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool CallFunc_Sorting_Bool : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)
	struct ADCCharacterBase* CallFunc_PickTarget_ReturnValue;  // 0x10 (0x10)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x18 (0x18)
	char pad_25_1 : 7;  // 0x19 (0x19)
	bool CallFunc_EqualEqual_IntInt_ReturnValue : 1;  // 0x19 (0x19)
	char pad_26[6];  // 0x1A (0x1A)
	struct ADCCharacterBase* CallFunc_PickRandomTarget_ReturnValue;  // 0x20 (0x20)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)
	struct AAIController* K2Node_Event_OwnerController;  // 0x30 (0x30)
	struct APawn* K2Node_Event_ControlledPawn;  // 0x38 (0x38)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x40 (0x40)
	char pad_72_1 : 7;  // 0x48 (0x48)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x48 (0x48)
	char pad_73[7];  // 0x49 (0x49)
	struct UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue;  // 0x50 (0x50)
	struct UAIPerceptionComponent* CallFunc_GetAIPerceptionComponent_ReturnValue;  // 0x58 (0x58)
	char pad_96_1 : 7;  // 0x60 (0x60)
	bool CallFunc_FilterHP_Bool : 1;  // 0x60 (0x60)
	char pad_97[3];  // 0x61 (0x61)
	int32_t Temp_int_Array_Index_Variable;  // 0x64 (0x64)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x68 (0x68)
	char pad_128_1 : 7;  // 0x80 (0x80)
	bool CallFunc_Filter_Target_From_Spawn_Location_Return_Value : 1;  // 0x80 (0x80)
	char pad_129[7];  // 0x81 (0x81)
	struct TArray<struct ADCCharacterBase*> CallFunc_Filter_Target_From_Spawn_Location_Result;  // 0x88 (0x88)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_2;  // 0x98 (0x98)
	char pad_176_1 : 7;  // 0xB0 (0xB0)
	bool CallFunc_Get_Target_Array_Return_Value : 1;  // 0xB0 (0xB0)
	char pad_177[7];  // 0xB1 (0xB1)
	struct TArray<struct ADCCharacterBase*> CallFunc_Get_Target_Array_TargetArray;  // 0xB8 (0xB8)
	char pad_200_1 : 7;  // 0xC8 (0xC8)
	bool CallFunc_Filter_Target_From_Spawn_Location_Return_Value_2 : 1;  // 0xC8 (0xC8)
	char pad_201[7];  // 0xC9 (0xC9)
	struct TArray<struct ADCCharacterBase*> CallFunc_Filter_Target_From_Spawn_Location_Result_2;  // 0xD0 (0xD0)
	char pad_224_1 : 7;  // 0xE0 (0xE0)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0xE0 (0xE0)
	char pad_225[7];  // 0xE1 (0xE1)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0xE8 (0xE8)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0xF0 (0xF0)
	int32_t CallFunc_Array_AddUnique_ReturnValue;  // 0xF4 (0xF4)
	int32_t Temp_int_Loop_Counter_Variable;  // 0xF8 (0xF8)
	char pad_252_1 : 7;  // 0xFC (0xFC)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0xFC (0xFC)
	char pad_253[3];  // 0xFD (0xFD)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x100 (0x100)


}; 
 
 // Function BTT_GetTargetActor.BTT_GetTargetActor_C.FilterRange
struct FFilterRange
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bool : 1;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool CallFunc_Get_Max_Distance_From_Perception_Result : 1;  // 0x1 (0x1)
	char pad_2[6];  // 0x2 (0x2)
	double CallFunc_Get_Max_Distance_From_Perception_Return_Value;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_Get_Max_Distance_From_Perception_Result_2 : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	double CallFunc_Get_Max_Distance_From_Perception_Return_Value_2;  // 0x18 (0x18)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x20 (0x20)
	char pad_33_1 : 7;  // 0x21 (0x21)
	bool CallFunc_FilterTargetsOverDistance_ReturnValue : 1;  // 0x21 (0x21)
	char pad_34_1 : 7;  // 0x22 (0x22)
	bool CallFunc_FilterTargetsOverXYRange_ReturnValue : 1;  // 0x22 (0x22)
	char pad_35_1 : 7;  // 0x23 (0x23)
	bool CallFunc_EqualEqual_DoubleDouble_ReturnValue : 1;  // 0x23 (0x23)
	char pad_36_1 : 7;  // 0x24 (0x24)
	bool CallFunc_FilterTargetsWithinXYRange_ReturnValue : 1;  // 0x24 (0x24)
	char pad_37_1 : 7;  // 0x25 (0x25)
	bool CallFunc_FilterTargetsWithinDistance_ReturnValue : 1;  // 0x25 (0x25)
	char pad_38_1 : 7;  // 0x26 (0x26)
	bool CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_ReturnValue : 1;  // 0x26 (0x26)
	char pad_39[1];  // 0x27 (0x27)
	float CallFunc_GetVisionAngle_ReturnValue;  // 0x28 (0x28)
	char pad_44_1 : 7;  // 0x2C (0x2C)
	bool CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_ReturnValue_2 : 1;  // 0x2C (0x2C)
	char pad_45_1 : 7;  // 0x2D (0x2D)
	bool K2Node_SwitchEnum_CmpSuccess_2 : 1;  // 0x2D (0x2D)
	char pad_46[2];  // 0x2E (0x2E)
	float CallFunc_FilterTargetsOverDistance_Distance_ImplicitCast;  // 0x30 (0x30)
	float CallFunc_FilterTargetsOverXYRange_XYRange_ImplicitCast;  // 0x34 (0x34)
	float CallFunc_FilterTargetsWithinXYRange_XYRange_ImplicitCast;  // 0x38 (0x38)
	float CallFunc_FilterTargetsWithinDistance_Distance_ImplicitCast;  // 0x3C (0x3C)
	float CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_AllowedAngle_ImplicitCast;  // 0x40 (0x40)
	float CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_DirectionalAngle_ImplicitCast;  // 0x44 (0x44)
	float CallFunc_FilterTargetsWithinDirectionAngleAndAllowedAngle_DirectionalAngle_ImplicitCast_2;  // 0x48 (0x48)


}; 
 
 // Function BTT_GetTargetActor.BTT_GetTargetActor_C.FilterTags
struct FFilterTags
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bool : 1;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x4 (0x4)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x8 (0x8)
	int32_t Temp_int_Array_Index_Variable;  // 0xC (0xC)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x10 (0x10)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x14 (0x14)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x18 (0x18)
	char pad_25_1 : 7;  // 0x19 (0x19)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x19 (0x19)
	char pad_26[2];  // 0x1A (0x1A)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x1C (0x1C)
	int32_t CallFunc_Array_Length_ReturnValue_3;  // 0x20 (0x20)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x24 (0x24)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool CallFunc_Less_IntInt_ReturnValue_3 : 1;  // 0x28 (0x28)
	char pad_41[3];  // 0x29 (0x29)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x2C (0x2C)
	struct FGameplayTag CallFunc_Array_Get_Item;  // 0x30 (0x30)
	int32_t CallFunc_Array_Length_ReturnValue_4;  // 0x38 (0x38)
	char pad_60_1 : 7;  // 0x3C (0x3C)
	bool CallFunc_FilterUnTagedTargets_ReturnValue : 1;  // 0x3C (0x3C)
	char pad_61_1 : 7;  // 0x3D (0x3D)
	bool CallFunc_Less_IntInt_ReturnValue_4 : 1;  // 0x3D (0x3D)
	char pad_62[2];  // 0x3E (0x3E)
	struct FGameplayTag CallFunc_Array_Get_Item_2;  // 0x40 (0x40)
	int32_t CallFunc_Array_Length_ReturnValue_5;  // 0x48 (0x48)
	char pad_76_1 : 7;  // 0x4C (0x4C)
	bool CallFunc_FilterTagedTargets_ReturnValue : 1;  // 0x4C (0x4C)
	char pad_77_1 : 7;  // 0x4D (0x4D)
	bool CallFunc_Less_IntInt_ReturnValue_5 : 1;  // 0x4D (0x4D)
	char pad_78[2];  // 0x4E (0x4E)
	int32_t CallFunc_Array_Length_ReturnValue_6;  // 0x50 (0x50)
	char pad_84_1 : 7;  // 0x54 (0x54)
	bool CallFunc_Less_IntInt_ReturnValue_6 : 1;  // 0x54 (0x54)


}; 
 
 // Function BTT_GetTargetActor.BTT_GetTargetActor_C.ReceiveExecuteAI
// Size: 0x10(Inherited: 0x10)
struct FReceiveExecuteAI : FReceiveExecuteAI
{
	struct AAIController* OwnerController;  // 0x0 (0x0)
	struct APawn* ControlledPawn;  // 0x8 (0x8)


}; 
 
 