#pragma once 
#include <DungeonCrawler_Structs.h>
 
 
 
// Class DungeonCrawler.SkillComponent
// Size: 0x128(Inherited: 0xA0)
struct USkillComponent : UActorComponent
{
	char pad_160[88];  // 0xA0 (0xA0)
	struct TArray<struct ASkillActor*> SkillActors;  // 0xF8 (0xF8)
	struct TArray<struct FSkillDataInfo> CurSkillDataList;  // 0x108 (0x108)
	char pad_280[8];  // 0x118 (0x118)
	struct UAsyncTaskEffectStackChanged* EffectStackAsyncTask;  // 0x120 (0x120)


	bool UpdateSkillCount(struct FGameplayTag SkillTag, int32_t Count); // Function DungeonCrawler.SkillComponent.UpdateSkillCount
	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.SkillComponent.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.SkillComponent.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.SkillComponent.TerminateBase
	void SetCooldownForDebug_Server(bool bNoCooldownTime); // Function DungeonCrawler.SkillComponent.SetCooldownForDebug_Server
	void OnRep_SkillDataList(struct TArray<struct FSkillDataInfo>& OldSkillDataList); // Function DungeonCrawler.SkillComponent.OnRep_SkillDataList
	void OnRep_SkillActorList(struct TArray<struct ASkillActor*>& OldSkillActors); // Function DungeonCrawler.SkillComponent.OnRep_SkillActorList
	void InitSkillData(); // Function DungeonCrawler.SkillComponent.InitSkillData
	void HandleSkillInput(struct FGameplayTag InputTag); // Function DungeonCrawler.SkillComponent.HandleSkillInput
	struct FSkillData GetSkillDataByTriggerTag(struct FGameplayTag TriggerTag); // Function DungeonCrawler.SkillComponent.GetSkillDataByTriggerTag
	struct FSkillData GetSkillDataByIndex(uint8_t SkillIndex); // Function DungeonCrawler.SkillComponent.GetSkillDataByIndex
	void GetSkillAllCurrentSkillData(struct TArray<struct FSkillData>& SkillDataList, struct TArray<float>& MaxDurationList, struct TArray<float>& RemainDurationList); // Function DungeonCrawler.SkillComponent.GetSkillAllCurrentSkillData
	struct ASkillActor* GetSkillActor(struct FGameplayTag SkillTag); // Function DungeonCrawler.SkillComponent.GetSkillActor
	uint8_t GetSkillActivatabilityByTriggerTag(struct FGameplayTag TriggerTag); // Function DungeonCrawler.SkillComponent.GetSkillActivatabilityByTriggerTag
	void GameplayEffectStackChanged(struct FGameplayTag EffectGameplayTag, struct FActiveGameplayEffectHandle EffectHandle, int32_t NewStackCount, int32_t PreviousStackCount); // Function DungeonCrawler.SkillComponent.GameplayEffectStackChanged
	bool CheckSkillReduceCount(struct FGameplayTag SkillTag, float ReduceCount); // Function DungeonCrawler.SkillComponent.CheckSkillReduceCount
	float CalSkillCooldownRemainTime(float StartTime, float RemainDuration, float MaxDuration); // Function DungeonCrawler.SkillComponent.CalSkillCooldownRemainTime
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.SkillComponent.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.GA_ProjectileCollision
// Size: 0x578(Inherited: 0x558)
struct UGA_ProjectileCollision : UDCGameplayAbilityBase
{
	struct ADCGATA_LineCollision* TargetActor;  // 0x558 (0x558)
	struct FGameplayTag GameplayCueOnStuckStaticObject;  // 0x560 (0x560)
	struct FGameplayTag GameplayCueOnStuckCharacter;  // 0x568 (0x568)
	struct FGameplayTag GameplayCueOnStuckShield;  // 0x570 (0x570)


	void UpdateIgnoreActors(struct AActor* InCheckActor); // Function DungeonCrawler.GA_ProjectileCollision.UpdateIgnoreActors
	void TargetDataReceived(struct FHitResult& Hit); // Function DungeonCrawler.GA_ProjectileCollision.TargetDataReceived
	void ReceivedTargetData(struct FGameplayAbilityTargetDataHandle& Data); // Function DungeonCrawler.GA_ProjectileCollision.ReceivedTargetData
	void AbilityActivated(struct FGameplayEventData TriggerEventData); // Function DungeonCrawler.GA_ProjectileCollision.AbilityActivated
}; 
 
 


// Class DungeonCrawler.DCAbilityInteractableActorBase
// Size: 0x310(Inherited: 0x300)
struct ADCAbilityInteractableActorBase : ADCInteractableActorBase
{
	char pad_768[8];  // 0x300 (0x300)
	struct UAbilitySystemComponent* AbilitySystemComponent;  // 0x308 (0x308)


}; 
 
 


// Class DungeonCrawler.DCLobbyEmoteShopDataAsset
// Size: 0xA8(Inherited: 0x78)
struct UDCLobbyEmoteShopDataAsset : UDCShopDataAsset
{
	struct TSoftObjectPtr<UDCLobbyEmoteDataAsset> StockData;  // 0x78 (0x78)


}; 
 
 


// Class DungeonCrawler.ArtDataAoe
// Size: 0x40(Inherited: 0x38)
struct UArtDataAoe : UDCDataAssetBase
{
	struct UBehaviorTree* BehaviorTree;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.DCMerchantStatWidget
// Size: 0x288(Inherited: 0x278)
struct UDCMerchantStatWidget : UUserWidget
{
	int32_t Faction;  // 0x278 (0x278)
	char pad_636[4];  // 0x27C (0x27C)
	struct FTimespan RemainTime;  // 0x280 (0x280)


}; 
 
 


// Class DungeonCrawler.LobbyGroupTradeChannelWidget
// Size: 0x480(Inherited: 0x470)
struct ULobbyGroupTradeChannelWidget : ULobbyGroupWidgetBase
{
	struct UTopTitleWidgetBase* TopTitle;  // 0x470 (0x470)
	struct UDCTradeInventoryWidget* TradeUserInventory;  // 0x478 (0x478)


	void OnReadRulesButtonClicked(); // Function DungeonCrawler.LobbyGroupTradeChannelWidget.OnReadRulesButtonClicked
	void OnLeaveChannelButtonClicked(); // Function DungeonCrawler.LobbyGroupTradeChannelWidget.OnLeaveChannelButtonClicked
}; 
 
 


// Class DungeonCrawler.GA_MonsterRangedAttackBase
// Size: 0x6B0(Inherited: 0x5C0)
struct UGA_MonsterRangedAttackBase : UGA_RangedAttackBase
{
	struct FGameplayTag CancleGameplayTag;  // 0x5C0 (0x5C0)
	uint8_t HitBoxType;  // 0x5C8 (0x5C8)
	char pad_1481[3];  // 0x5C9 (0x5C9)
	int32_t RandomRate;  // 0x5CC (0x5CC)
	float RandomRange;  // 0x5D0 (0x5D0)
	float DefaultFirePower;  // 0x5D4 (0x5D4)
	float MinimumDistance;  // 0x5D8 (0x5D8)
	int32_t MultiShotCount;  // 0x5DC (0x5DC)
	float MultiShotAngle;  // 0x5E0 (0x5E0)
	char pad_1508[28];  // 0x5E4 (0x5E4)
	struct FGameplayEventData GameplayEventData;  // 0x600 (0x600)


}; 
 
 


// Class DungeonCrawler.DCDataAssetBase
// Size: 0x38(Inherited: 0x30)
struct UDCDataAssetBase : UPrimaryDataAsset
{
	struct FPrimaryAssetType AssetType;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.DCLogEventManager
// Size: 0xE0(Inherited: 0x30)
struct UDCLogEventManager : UDCUserInfoManagerBase
{
	char pad_48[176];  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.CharacterCreateWidget
// Size: 0x4E8(Inherited: 0x440)
struct UCharacterCreateWidget : UDCCommonActivatableWidgetBase
{
	uint8_t SelectedCharacterClass;  // 0x440 (0x440)
	uint8_t SelectedGender;  // 0x441 (0x441)
	char pad_1090_1 : 7;  // 0x442 (0x442)
	bool bCanCreate : 1;  // 0x442 (0x442)
	char pad_1091[5];  // 0x443 (0x443)
	struct FText SelectedCharacterClassName;  // 0x448 (0x448)
	struct FText SelectedCharacterClassDialog;  // 0x460 (0x460)
	struct FText SelectedCharacterClassInfo;  // 0x478 (0x478)
	int32_t AccountBluestoneShardValue;  // 0x490 (0x490)
	int32_t AccountRedstoneShardValue;  // 0x494 (0x494)
	struct UTexture2D* SelectedCharacterIllustration;  // 0x498 (0x498)
	struct UTileView* ClassSelectTileView;  // 0x4A0 (0x4A0)
	struct UTileView* ClassAttributeTileView;  // 0x4A8 (0x4A8)
	struct UEditableTextBox* NickNameTextBox;  // 0x4B0 (0x4B0)
	struct UDCCaptureStudioWidget* CaptureStudioWidget;  // 0x4B8 (0x4B8)
	struct UCommonButtonLWidget* WB_Btn_Purchase;  // 0x4C0 (0x4C0)
	struct UDCCommonButtonBase* WB_Btn_LaunchShopURL;  // 0x4C8 (0x4C8)
	struct FDCClassPackageShopItemInfo SelectedShopInfo;  // 0x4D0 (0x4D0)


	void OnTextChangedNickName(struct FText& InNickName); // Function DungeonCrawler.CharacterCreateWidget.OnTextChangedNickName
	void OnPurchaseButtonClicked(); // Function DungeonCrawler.CharacterCreateWidget.OnPurchaseButtonClicked
	void OnLaunchShopURLButtonClicked(); // Function DungeonCrawler.CharacterCreateWidget.OnLaunchShopURLButtonClicked
	void OnGenderClicked(uint8_t Gender); // Function DungeonCrawler.CharacterCreateWidget.OnGenderClicked
	void OnClassSelectTileViewItemSelectionChanged(struct UObject* InItem); // Function DungeonCrawler.CharacterCreateWidget.OnClassSelectTileViewItemSelectionChanged
	void HandleExitButtonClicked(); // Function DungeonCrawler.CharacterCreateWidget.HandleExitButtonClicked
	void HandleConfirmButtonClicked(); // Function DungeonCrawler.CharacterCreateWidget.HandleConfirmButtonClicked
	int32_t GetPrice(); // Function DungeonCrawler.CharacterCreateWidget.GetPrice
	int32_t GetCashPrice(); // Function DungeonCrawler.CharacterCreateWidget.GetCashPrice
	uint8_t GetCannotCreateVisibility(); // Function DungeonCrawler.CharacterCreateWidget.GetCannotCreateVisibility
	uint8_t GetCanCreateVisibility(); // Function DungeonCrawler.CharacterCreateWidget.GetCanCreateVisibility
	bool CanLaunchRedstoneShardShop(); // Function DungeonCrawler.CharacterCreateWidget.CanLaunchRedstoneShardShop
}; 
 
 


// Class DungeonCrawler.DCMerchantPageWidget
// Size: 0x4D8(Inherited: 0x470)
struct UDCMerchantPageWidget : ULobbyGroupWidgetBase
{
	struct UButton* ButtonBack;  // 0x470 (0x470)
	struct UDCBagWidget* InventorySale;  // 0x478 (0x478)
	struct UDCBagWidget* InventoryWish;  // 0x480 (0x480)
	struct UDCBagWidget* InventoryCraft;  // 0x488 (0x488)
	struct UDCInventorySetWidget* PlayerInventorySet;  // 0x490 (0x490)
	struct UDCMerchantDealTablePurchaseWidget* DealTableBuyWidget;  // 0x498 (0x498)
	struct UDCMerchantDealTableSellWidget* DealTableSellWidget;  // 0x4A0 (0x4A0)
	struct UDCMerchantDealTablePurchaseWidget* DealTableCraftWidget;  // 0x4A8 (0x4A8)
	struct UDCBoxInventory* DummyInventory;  // 0x4B0 (0x4B0)
	struct UDCTabListWidgetBase* MerchantTabList;  // 0x4B8 (0x4B8)
	struct UDCTabListWidgetBase* TradeTabList;  // 0x4C0 (0x4C0)
	struct UDCTabListWidgetBase* ServiceTabList;  // 0x4C8 (0x4C8)
	struct UDCTabListWidgetBase* QuestTabList;  // 0x4D0 (0x4D0)


	void OnServiceTypeChanged(uint8_t ServiceType); // Function DungeonCrawler.DCMerchantPageWidget.OnServiceTypeChanged
	void OnServiceTabSelected(struct FName TabId); // Function DungeonCrawler.DCMerchantPageWidget.OnServiceTabSelected
	void OnCategoryTabSelected(struct FName TabId); // Function DungeonCrawler.DCMerchantPageWidget.OnCategoryTabSelected
	void OnButtonBack(); // Function DungeonCrawler.DCMerchantPageWidget.OnButtonBack
}; 
 
 


// Class DungeonCrawler.AccountLink
// Size: 0x2D0(Inherited: 0x28)
struct UAccountLink : UObject
{
	char pad_40[680];  // 0x28 (0x28)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.AccountLink.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.AccountLink.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.AccountLink.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.AccountLink.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.ArtDataPlayerCharacter
// Size: 0x70(Inherited: 0x38)
struct UArtDataPlayerCharacter : UDCDataAssetBase
{
	struct UTexture2D* PlayerCharacterIconTexture;  // 0x38 (0x38)
	struct UTexture2D* PlayerCharacterImageTexture;  // 0x40 (0x40)
	struct UTexture2D* PlayerCharacterManIllustImageTexture;  // 0x48 (0x48)
	struct UTexture2D* PlayerCharacterWomanIllustImageTexture;  // 0x50 (0x50)
	struct UTexture2D* Icon;  // 0x58 (0x58)
	struct UTexture2D* Portrait;  // 0x60 (0x60)
	struct UTexture2D* Illustration;  // 0x68 (0x68)


}; 
 
 


// Class DungeonCrawler.GameMiniMapWidget
// Size: 0x398(Inherited: 0x300)
struct UGameMiniMapWidget : UDCWidgetBase
{
	struct UAccountLink* AccountLink;  // 0x300 (0x300)
	struct APawn* LinkedPawn;  // 0x308 (0x308)
	char pad_784[136];  // 0x310 (0x310)


	void OnMiniMapName(struct FString NewMiniMapName, struct FString OldMiniMapName); // Function DungeonCrawler.GameMiniMapWidget.OnMiniMapName
	void OnMiniMapDeathSwarmData(struct FMiniMapDeathSwarmData& NewValue, struct FMiniMapDeathSwarmData& OldValue); // Function DungeonCrawler.GameMiniMapWidget.OnMiniMapDeathSwarmData
}; 
 
 


// Class DungeonCrawler.AccountLinkAll
// Size: 0xD8(Inherited: 0x28)
struct UAccountLinkAll : UObject
{
	char pad_40[176];  // 0x28 (0x28)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.AccountLinkAll.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.AccountLinkAll.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.AccountLinkAll.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.AccountLinkAll.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCGiftCodeRewardPopupData
// Size: 0x40(Inherited: 0x30)
struct UDCGiftCodeRewardPopupData : UPopupDataBase
{
	struct TArray<struct FDCGiftCodeRewardInfo> RewardInfoArray;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.GameMusicPlayBarWidget
// Size: 0x500(Inherited: 0x300)
struct UGameMusicPlayBarWidget : UDCShowingKeyWidgetBase
{
	struct UTextBlock* PlayText;  // 0x300 (0x300)
	struct UTextBlock* ChannelingText;  // 0x308 (0x308)
	struct UTextBlock* ChannelingTimer;  // 0x310 (0x310)
	struct USlider* PlaySlider;  // 0x318 (0x318)
	struct UProgressBar* PlayGauge;  // 0x320 (0x320)
	struct TArray<struct UWidget*> SectionWidgets;  // 0x328 (0x328)
	struct UHorizontalBox* HorizontalBox;  // 0x338 (0x338)
	struct UHorizontalBox* HorizontalBox_Perfect;  // 0x340 (0x340)
	struct USizeBox* SizeBox_Channeling;  // 0x348 (0x348)
	struct FSlateBrush GoodJudgeAreaBrush;  // 0x350 (0x350)
	struct FSlateBrush PerfectJudgeAreaBrush;  // 0x420 (0x420)
	char pad_1264[16];  // 0x4F0 (0x4F0)


	void OnMusicPlaySucceed(uint8_t Judge); // Function DungeonCrawler.GameMusicPlayBarWidget.OnMusicPlaySucceed
	void OnMusicPlayStart(); // Function DungeonCrawler.GameMusicPlayBarWidget.OnMusicPlayStart
	void OnMusicPlayEnd(); // Function DungeonCrawler.GameMusicPlayBarWidget.OnMusicPlayEnd
	void OnMusicJudgeNotify(uint8_t Judge, float PastSectionRatio, float NextSectionRatio, float JudgePositionRatio); // Function DungeonCrawler.GameMusicPlayBarWidget.OnMusicJudgeNotify
	void OnMusicChannelingStart(uint8_t Judge); // Function DungeonCrawler.GameMusicPlayBarWidget.OnMusicChannelingStart
	void OnMusicChannelingEnd(); // Function DungeonCrawler.GameMusicPlayBarWidget.OnMusicChannelingEnd
}; 
 
 


// Class DungeonCrawler.BTD_RandomCooldown
// Size: 0x78(Inherited: 0x68)
struct UBTD_RandomCooldown : UBTDecorator
{
	float MinCoolDownTime;  // 0x68 (0x68)
	float MaxCoolDownTime;  // 0x6C (0x6C)
	float InitCoolDownTime;  // 0x70 (0x70)
	char pad_116[4];  // 0x74 (0x74)


}; 
 
 


// Class DungeonCrawler.InteractableTargetComponent
// Size: 0x168(Inherited: 0xA0)
struct UInteractableTargetComponent : UActorComponent
{
	char pad_160[88];  // 0xA0 (0xA0)
	struct TMap<struct FGameplayTag, struct FInteractionData> InteractableDataByStateMap;  // 0xF8 (0xF8)
	struct TArray<struct AActor*> Interacters;  // 0x148 (0x148)
	struct UPrimitiveComponent* CurrentInteractPart;  // 0x158 (0x158)
	char pad_352[8];  // 0x160 (0x160)


	void UnregisterInteracter(struct AActor* InteractingActor); // Function DungeonCrawler.InteractableTargetComponent.UnregisterInteracter
	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.InteractableTargetComponent.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.InteractableTargetComponent.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.InteractableTargetComponent.TerminateBase
	bool ShouldCancelOthersWhenInteractSucceed(struct FGameplayTag StateTag); // Function DungeonCrawler.InteractableTargetComponent.ShouldCancelOthersWhenInteractSucceed
	void SetInteractionData(struct FDesignDataPropsInteract& InteractionData); // Function DungeonCrawler.InteractableTargetComponent.SetInteractionData
	void RegisterInteracter(struct AActor* InteractingActor); // Function DungeonCrawler.InteractableTargetComponent.RegisterInteracter
	bool IsDetectable(struct AActor* Interacter); // Function DungeonCrawler.InteractableTargetComponent.IsDetectable
	void InteractSucceed(struct AActor* InteractingActor, struct FGameplayTag TriggerTag, struct FGameplayTag StateTag, struct FHitResult HitResult); // Function DungeonCrawler.InteractableTargetComponent.InteractSucceed
	void InteractFailed(struct AActor* InteractingActor, struct FGameplayTag TriggerTag); // Function DungeonCrawler.InteractableTargetComponent.InteractFailed
	struct FGameplayTag GetStateTag(struct FGameplayTag TriggerTag); // Function DungeonCrawler.InteractableTargetComponent.GetStateTag
	struct FInteractTargetData GetInteractTargetData(); // Function DungeonCrawler.InteractableTargetComponent.GetInteractTargetData
	struct TMap<struct FGameplayTag, struct FInteractionData> GetInteractableDataByStateMap(); // Function DungeonCrawler.InteractableTargetComponent.GetInteractableDataByStateMap
	uint8_t GetInteractability(struct AActor* Interacter); // Function DungeonCrawler.InteractableTargetComponent.GetInteractability
	struct FInteractionData GetData(struct FGameplayTag StateTag); // Function DungeonCrawler.InteractableTargetComponent.GetData
	bool CanInteract(); // Function DungeonCrawler.InteractableTargetComponent.CanInteract
	void CancelAllInteractions(); // Function DungeonCrawler.InteractableTargetComponent.CancelAllInteractions
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.InteractableTargetComponent.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DesignDataAssetItemContainer
// Size: 0x50(Inherited: 0x38)
struct UDesignDataAssetItemContainer : UDCDesignDataAssetBase
{
	struct FDesignDataItemContainer Item;  // 0x38 (0x38)
	char pad_76[4];  // 0x4C (0x4C)


}; 
 
 


// Class DungeonCrawler.AccountSession
// Size: 0x178(Inherited: 0x28)
struct UAccountSession : UObject
{
	char pad_40[88];  // 0x28 (0x28)
	struct UBaseObject* BaseObject;  // 0x80 (0x80)
	char pad_136[240];  // 0x88 (0x88)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.AccountSession.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.AccountSession.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.AccountSession.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.AccountSession.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCMerchantDataAsset
// Size: 0xA8(Inherited: 0x38)
struct UDCMerchantDataAsset : UDCTableDataAsset
{
	struct FText Name;  // 0x38 (0x38)
	struct FText GreetingText;  // 0x50 (0x50)
	struct TSoftObjectPtr<UArtDataMerchant> ArtData;  // 0x68 (0x68)
	struct TArray<uint8_t> ServiceTypes;  // 0x98 (0x98)


}; 
 
 


// Class DungeonCrawler.DCMonsterAISystemBlueprintLibrary
// Size: 0x28(Inherited: 0x28)
struct UDCMonsterAISystemBlueprintLibrary : UBlueprintFunctionLibrary
{


	bool SubAggro(struct ADCMonsterBase*& DCMonsterBase, struct ADCCharacterBase*& Target, float Point); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.SubAggro
	struct ADCCharacterBase* SpawnSlave(struct ADCMonsterBase*& DCMonsterBase, ADCMonsterBase* SlaveClass, float XYRange, bool& bSuccessfully); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.SpawnSlave
	bool SortTargetsByZRange(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, uint8_t MonsterFilterSortingType); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.SortTargetsByZRange
	bool SortTargetsByXYRange(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, uint8_t MonsterFilterSortingType); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.SortTargetsByXYRange
	struct ADCCharacterBase* SortTargetsByDistanceAndPickTarget(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, uint8_t MonsterFilterSortingType, int32_t Index); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.SortTargetsByDistanceAndPickTarget
	bool SortTargetsByDistance(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, uint8_t MonsterFilterSortingType); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.SortTargetsByDistance
	bool SortTargetsByAggro(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, uint8_t MonsterFilterSortingType); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.SortTargetsByAggro
	bool SetAggroRate(struct ADCCharacterBase*& DCCharacterBase, float Time, float Rate); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.SetAggroRate
	bool SetAggro(struct ADCMonsterBase*& DCMonsterBase, struct ADCCharacterBase*& Target, float Point); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.SetAggro
	bool RemoveAggroAll(struct ADCCharacterBase* DCCharacterBase); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.RemoveAggroAll
	bool RemoveAggro(struct ADCMonsterBase*& DCMonsterBase, struct ADCCharacterBase*& Target); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.RemoveAggro
	struct ADCCharacterBase* PickTopAggroTarget(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.PickTopAggroTarget
	struct ADCCharacterBase* PickTarget(struct TArray<struct ADCCharacterBase*>& TargetArray, int32_t Index); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.PickTarget
	struct ADCCharacterBase* PickRandomTarget(struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.PickRandomTarget
	bool MulAggro(struct ADCMonsterBase*& DCMonsterBase, struct ADCCharacterBase*& Target, float Point); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.MulAggro
	bool JumpToLocation(struct ADCCharacterBase*& DCCharacterBase, struct FVector DstLocation, float Power, bool bFavorHighArc); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.JumpToLocation
	bool JumpToActor(struct ADCCharacterBase*& DCCharacterBase, struct AActor*& DstActor, float Power, bool bFavorHighArc); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.JumpToActor
	bool IsAvailablePath(struct ADCMonsterBase*& DCMonsterBase, struct FVector DstLocation); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.IsAvailablePath
	int32_t GetSlaveCount(struct ADCMonsterBase*& DCMonsterBase); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.GetSlaveCount
	bool GetSightTargetArray(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.GetSightTargetArray
	bool GetHearingTargetArray(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.GetHearingTargetArray
	bool GetDamageTargetArray(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.GetDamageTargetArray
	float GetCurrentAttributeValue(struct ADCCharacterBase*& DCCharacterBase, struct FGameplayAttribute GameplayAttribute, bool& bSuccessfully); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.GetCurrentAttributeValue
	float GetBaseAttributeValue(struct ADCCharacterBase*& DCCharacterBase, struct FGameplayAttribute GameplayAttribute, bool& bSuccessfully); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.GetBaseAttributeValue
	bool GetAllTargetArray(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.GetAllTargetArray
	float GetAggroPoint(struct ADCMonsterBase*& DCMonsterBase, struct ADCCharacterBase*& Target, bool& bSuccessfully); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.GetAggroPoint
	bool GetAggroMonster(struct ADCCharacterBase* DCCharacterBase, struct TArray<struct ADCMonsterBase*>& TargetArray); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.GetAggroMonster
	bool FilterUnTagedTargets(struct TArray<struct ADCCharacterBase*>& TargetArray, struct FGameplayTag GameplayTag); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterUnTagedTargets
	bool FilterTargetsWithinZRange(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float ZRange); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTargetsWithinZRange
	bool FilterTargetsWithinXYRangeAndZRangeAndDirectionalAngleAndAllowedAngle(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float XYRange, float ZRange, float DirectionalAngle, float AllowedAngle); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTargetsWithinXYRangeAndZRangeAndDirectionalAngleAndAllowedAngle
	bool FilterTargetsWithinXYRange(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float XYRange); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTargetsWithinXYRange
	bool FilterTargetsWithinDistanceAndDirectionalAngleAndAllowedAngle(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float Distance, float DirectionalAngle, float AllowedAngle); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTargetsWithinDistanceAndDirectionalAngleAndAllowedAngle
	bool FilterTargetsWithinDistance(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float Distance); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTargetsWithinDistance
	bool FilterTargetsWithinDirectionAngleAndAllowedAngle(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float DirectionalAngle, float AllowedAngle); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTargetsWithinDirectionAngleAndAllowedAngle
	bool FilterTargetsOverZRange(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float ZRange); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTargetsOverZRange
	bool FilterTargetsOverXYRange(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float XYRange); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTargetsOverXYRange
	bool FilterTargetsOverDistance(struct ADCMonsterBase*& DCMonsterBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float Distance); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTargetsOverDistance
	bool FilterTagedTargets(struct TArray<struct ADCCharacterBase*>& TargetArray, struct FGameplayTag GameplayTag); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterTagedTargets
	void FilterPlayerCharacterTargets(struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterPlayerCharacterTargets
	bool FilterMonsterTargetsByID(struct TArray<struct ADCCharacterBase*>& TargetArray, struct FPrimaryAssetId ID); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterMonsterTargetsByID
	void FilterMonsterTargets(struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.FilterMonsterTargets
	bool AddAggro(struct ADCMonsterBase*& DCMonsterBase, struct ADCCharacterBase*& Target, float Point); // Function DungeonCrawler.DCMonsterAISystemBlueprintLibrary.AddAggro
}; 
 
 


// Class DungeonCrawler.BTTask_DCGameFloorRule
// Size: 0x140(Inherited: 0xE0)
struct UBTTask_DCGameFloorRule : UBTTask_DCGameBase
{
	struct UDCFloorRuleDataAsset* RuleData;  // 0xE0 (0xE0)
	float WarmupDuration;  // 0xE8 (0xE8)
	char pad_236[4];  // 0xEC (0xEC)
	struct ADeathSwarmBase* DeathSwarm;  // 0xF0 (0xF0)
	struct FDCFloorRuleManager FloorRuleManager;  // 0xF8 (0xF8)
	char pad_304[16];  // 0x130 (0x130)


}; 
 
 


// Class DungeonCrawler.GameMusicSlotWidget
// Size: 0x400(Inherited: 0x400)
struct UGameMusicSlotWidget : UMusicSlotWidgetBase
{


	void SelectionChange(bool bIsSelected); // Function DungeonCrawler.GameMusicSlotWidget.SelectionChange
	void OnSelectionChanged(bool bIsSelected); // Function DungeonCrawler.GameMusicSlotWidget.OnSelectionChanged
}; 
 
 


// Class DungeonCrawler.ArtDataMisc
// Size: 0x80(Inherited: 0x80)
struct UArtDataMisc : UArtDataItem
{


}; 
 
 


// Class DungeonCrawler.ArtDataProps
// Size: 0x38(Inherited: 0x38)
struct UArtDataProps : UDCDataAssetBase
{


}; 
 
 


// Class DungeonCrawler.DCCustomizeComponent
// Size: 0x1B0(Inherited: 0xA0)
struct UDCCustomizeComponent : UActorComponent
{
	char pad_160[272];  // 0xA0 (0xA0)


}; 
 
 


// Class DungeonCrawler.DCEquipInventory
// Size: 0x170(Inherited: 0x170)
struct UDCEquipInventory : UDCInventoryBase
{


}; 
 
 


// Class DungeonCrawler.DCSkillDataAsset
// Size: 0x180(Inherited: 0x38)
struct UDCSkillDataAsset : UDCTableDataAsset
{
	struct FText Name;  // 0x38 (0x38)
	struct TSoftObjectPtr<UDescData> DescData;  // 0x50 (0x50)
	char pad_128_1 : 7;  // 0x80 (0x80)
	bool CanUse : 1;  // 0x80 (0x80)
	char pad_129[7];  // 0x81 (0x81)
	struct TArray<struct FPrimaryAssetId> Classes;  // 0x88 (0x88)
	struct FGameplayTag SkillType;  // 0x98 (0x98)
	int32_t SkillTier;  // 0xA0 (0xA0)
	char pad_164_1 : 7;  // 0xA4 (0xA4)
	bool CanRecharge : 1;  // 0xA4 (0xA4)
	char pad_165[3];  // 0xA5 (0xA5)
	int32_t MaxCount;  // 0xA8 (0xA8)
	float CastingTime;  // 0xAC (0xAC)
	float ChannelingDuration;  // 0xB0 (0xB0)
	float ChannelingInterval;  // 0xB4 (0xB4)
	int32_t Range;  // 0xB8 (0xB8)
	char pad_188_1 : 7;  // 0xBC (0xBC)
	bool UseMoving : 1;  // 0xBC (0xBC)
	char pad_189_1 : 7;  // 0xBD (0xBD)
	bool NeedAimTarget : 1;  // 0xBD (0xBD)
	char pad_190[2];  // 0xBE (0xBE)
	struct FGameplayTag SkillTag;  // 0xC0 (0xC0)
	struct FGameplayTag SkillCooldownTag;  // 0xC8 (0xC8)
	struct TSoftObjectPtr<UDCGameplayEffectDataAsset> SkillCooldownEffect;  // 0xD0 (0xD0)
	struct TSoftObjectPtr<UArtDataSkill> ArtData;  // 0x100 (0x100)
	struct TSoftObjectPtr<USoundData> SoundData;  // 0x130 (0x130)
	struct TArray<struct TSoftObjectPtr<UDCGameplayAbilityDataAsset>> Abilities;  // 0x160 (0x160)
	struct TArray<struct TSoftObjectPtr<UDCGameplayEffectDataAsset>> Effects;  // 0x170 (0x170)


}; 
 
 


// Class DungeonCrawler.ActorStatusUIData
// Size: 0x40(Inherited: 0x38)
struct UActorStatusUIData : UDCDataAssetBase
{
	struct UTexture2D* IconTexture;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.ChatSetWidgetBase
// Size: 0x3B8(Inherited: 0x300)
struct UChatSetWidgetBase : UDCWidgetBase
{
	struct UListView* ChatListView;  // 0x300 (0x300)
	struct UChatEditWidgetBase* ChatEditWidget;  // 0x308 (0x308)
	struct UAccountLink* AccountLink;  // 0x310 (0x310)
	char pad_792[144];  // 0x318 (0x318)
	struct TArray<struct UChatWidgetData*> ChatWidgetDataArray;  // 0x3A8 (0x3A8)


	void SetChatKeyboardFocus(); // Function DungeonCrawler.ChatSetWidgetBase.SetChatKeyboardFocus
	void OnChatEditFocus(bool InbFocus); // Function DungeonCrawler.ChatSetWidgetBase.OnChatEditFocus
	bool OnChatDataCommitted(struct FChatData& InChatData); // Function DungeonCrawler.ChatSetWidgetBase.OnChatDataCommitted
	void OnChatDataChanged(struct FText& InText); // Function DungeonCrawler.ChatSetWidgetBase.OnChatDataChanged
	void ChatScrollToBottom(); // Function DungeonCrawler.ChatSetWidgetBase.ChatScrollToBottom
	void AddSystemChatItemLinkDesc(); // Function DungeonCrawler.ChatSetWidgetBase.AddSystemChatItemLinkDesc
}; 
 
 


// Class DungeonCrawler.DCCustomizeActionSkinListWidget
// Size: 0x328(Inherited: 0x300)
struct UDCCustomizeActionSkinListWidget : UDCWidgetBase
{
	char pad_768[24];  // 0x300 (0x300)
	struct UTileView* TileView_ActionSkinList;  // 0x318 (0x318)
	uint8_t ActionSkinType;  // 0x320 (0x320)
	char pad_801[7];  // 0x321 (0x321)


	void OnSetActionSkinInfoArray(struct TArray<struct FDCActionSkinInfo> ActionSkinInfoArray); // Function DungeonCrawler.DCCustomizeActionSkinListWidget.OnSetActionSkinInfoArray
}; 
 
 


// Class DungeonCrawler.ArtDataMonster
// Size: 0x40(Inherited: 0x38)
struct UArtDataMonster : UDCDataAssetBase
{
	struct UBehaviorTree* BehaviorTree;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.SpellSlotWidgetBase
// Size: 0x428(Inherited: 0x300)
struct USpellSlotWidgetBase : UDCWidgetBase
{
	struct FSpellData SpellData;  // 0x300 (0x300)
	char pad_828[4];  // 0x33C (0x33C)
	struct FDesignDataSpell DesignDataSpell;  // 0x340 (0x340)
	struct TArray<struct FText> DescTextArray;  // 0x408 (0x408)
	struct UArtDataSpell* ArtData;  // 0x418 (0x418)
	int32_t SlotIndex;  // 0x420 (0x420)
	char pad_1060[4];  // 0x424 (0x424)


	void SetSpellData(struct FSpellData& InSpellData, struct FDesignDataSpell& InDesignDataSpell); // Function DungeonCrawler.SpellSlotWidgetBase.SetSpellData
	void Reset(); // Function DungeonCrawler.SpellSlotWidgetBase.Reset
	void OnSpellDataChanged(struct FSpellData& InSpellData, struct FDesignDataSpell& InDesignDataSpell); // Function DungeonCrawler.SpellSlotWidgetBase.OnSpellDataChanged
	void OnSetSpellArtData(struct UArtDataSpell* InArtSpellData); // Function DungeonCrawler.SpellSlotWidgetBase.OnSetSpellArtData
	void OnReset(); // Function DungeonCrawler.SpellSlotWidgetBase.OnReset
}; 
 
 


// Class DungeonCrawler.GameMenuOptionsWidget
// Size: 0x470(Inherited: 0x440)
struct UGameMenuOptionsWidget : UDCCommonActivatableWidgetBase
{
	struct UCheckBox* ControlsCheckBox;  // 0x440 (0x440)
	struct UCheckBox* GameplayCheckBox;  // 0x448 (0x448)
	struct UCheckBox* AudioCheckBox;  // 0x450 (0x450)
	struct UCheckBox* VideoCheckBox;  // 0x458 (0x458)
	struct UCheckBox* InputCheckBox;  // 0x460 (0x460)
	struct UWidgetSwitcher* GameMenuOptionsWidgetSwitcher;  // 0x468 (0x468)


	void OnWidgetToggleNotify(uint8_t Invisibility); // Function DungeonCrawler.GameMenuOptionsWidget.OnWidgetToggleNotify
	void OnVideoButtonChecked(bool bIsChecked); // Function DungeonCrawler.GameMenuOptionsWidget.OnVideoButtonChecked
	void OnToggled(uint8_t Invisibility); // Function DungeonCrawler.GameMenuOptionsWidget.OnToggled
	void OnInputButtonChecked(bool bIsChecked); // Function DungeonCrawler.GameMenuOptionsWidget.OnInputButtonChecked
	void OnGameplayButtonChecked(bool bIsChecked); // Function DungeonCrawler.GameMenuOptionsWidget.OnGameplayButtonChecked
	void OnControlsButtonChecked(bool bIsChecked); // Function DungeonCrawler.GameMenuOptionsWidget.OnControlsButtonChecked
	void OnAudioButtonChecked(bool bIsChecked); // Function DungeonCrawler.GameMenuOptionsWidget.OnAudioButtonChecked
}; 
 
 


// Class DungeonCrawler.DCLobbyEmoteArtData
// Size: 0x40(Inherited: 0x38)
struct UDCLobbyEmoteArtData : UDCDataAssetBase
{
	struct UTexture2D* LobbyEmoteIconTexture;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.InteractData
// Size: 0x70(Inherited: 0x38)
struct UInteractData : UDCDataAssetBase
{
	struct UAnimMontage* MontageToPlayBothHandEquipped;  // 0x38 (0x38)
	struct UAnimMontage* MontageToPlayPrimaryEquipped;  // 0x40 (0x40)
	struct UAnimMontage* MontageToPlaySecondaryEquipped;  // 0x48 (0x48)
	struct UAnimMontage* MontageToPlayPrimaryEquippedInstant;  // 0x50 (0x50)
	struct UAnimMontage* MontageToPlaySecondaryEquippedInstant;  // 0x58 (0x58)
	struct TArray<struct FGameplayTag> IgnoreTypeArray;  // 0x60 (0x60)


}; 
 
 


// Class DungeonCrawler.ArtDataItem
// Size: 0x80(Inherited: 0x38)
struct UArtDataItem : UDCDataAssetBase
{
	uint8_t ItemType;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)
	struct UTexture2D* ItemIconTexture;  // 0x40 (0x40)
	struct USkeletalMesh* ItemSkeletalMesh;  // 0x48 (0x48)
	struct TArray<struct FItemMaterialInfo> ItemSkeletalMeshMaterialInfoArray;  // 0x50 (0x50)
	struct UStaticMesh* ItemStaticMesh;  // 0x60 (0x60)
	struct TArray<struct FItemMaterialInfo> ItemStaticMeshMaterialInfoArray;  // 0x68 (0x68)
	UAnimInstance* ItemAnimInstanceClass;  // 0x78 (0x78)


}; 
 
 


// Class DungeonCrawler.DCTableDataAsset
// Size: 0x38(Inherited: 0x38)
struct UDCTableDataAsset : UDCDataAsset
{


}; 
 
 


// Class DungeonCrawler.ArtDataAnimatedItem
// Size: 0x118(Inherited: 0x80)
struct UArtDataAnimatedItem : UArtDataItem
{
	struct FAnimationSet AnimationSet;  // 0x80 (0x80)
	struct TMap<struct FGameplayTag, struct FAnimationSet> ConditionalAnimationSet;  // 0xB8 (0xB8)
	struct FName EquipmentSocket;  // 0x108 (0x108)
	struct FName SheathSocket;  // 0x110 (0x110)


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationSpellCapacity
// Size: 0x100(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationSpellCapacity : UGameplayModMagnitudeCalculation
{
	char pad_64[192];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCMetaGameSession
// Size: 0x3F0(Inherited: 0x3F0)
struct ADCMetaGameSession : ADCGameSession
{


}; 
 
 


// Class DungeonCrawler.DCAkAcousticPortal
// Size: 0x2D8(Inherited: 0x2D8)
struct ADCAkAcousticPortal : AAkAcousticPortal
{


}; 
 
 


// Class DungeonCrawler.DCGATA_GroundTraceWithMaxHeight
// Size: 0x420(Inherited: 0x420)
struct ADCGATA_GroundTraceWithMaxHeight : AGameplayAbilityTargetActor_GroundTrace
{
	float MaxHeight;  // 0x418 (0x418)


}; 
 
 


// Class DungeonCrawler.DCCommonActivatableWidgetBase
// Size: 0x440(Inherited: 0x3C8)
struct UDCCommonActivatableWidgetBase : UCommonActivatableWidget
{
	char pad_968[88];  // 0x3C8 (0x3C8)
	struct UBaseObject* BaseObject;  // 0x420 (0x420)
	struct FDataTableRowHandle VirtualCursorModeInputActionData;  // 0x428 (0x428)
	char pad_1080[8];  // 0x438 (0x438)


	void UnbindMsgOwner(struct UScriptStruct* InMsgType); // Function DungeonCrawler.DCCommonActivatableWidgetBase.UnbindMsgOwner
	void UnbindMsgAllOwner(); // Function DungeonCrawler.DCCommonActivatableWidgetBase.UnbindMsgAllOwner
	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCCommonActivatableWidgetBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCCommonActivatableWidgetBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCCommonActivatableWidgetBase.TerminateBase
	bool IsSpectating(); // Function DungeonCrawler.DCCommonActivatableWidgetBase.IsSpectating
	struct TScriptInterface<IBaseInterface> GetOwningBaseInterfaceBlueprint(); // Function DungeonCrawler.DCCommonActivatableWidgetBase.GetOwningBaseInterfaceBlueprint
	void EnableVirtualCursor(); // Function DungeonCrawler.DCCommonActivatableWidgetBase.EnableVirtualCursor
	void DisableVirtualCursor(); // Function DungeonCrawler.DCCommonActivatableWidgetBase.DisableVirtualCursor
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCCommonActivatableWidgetBase.BroadcastMsgBlueprint
	void BindMsgOwner(struct UScriptStruct* InMsgType, struct UBindMsgNode* InMsgDynamicDelegate); // Function DungeonCrawler.DCCommonActivatableWidgetBase.BindMsgOwner
}; 
 
 


// Class DungeonCrawler.ArtDataWeapon
// Size: 0x118(Inherited: 0x118)
struct UArtDataWeapon : UArtDataAnimatedItem
{


}; 
 
 


// Class DungeonCrawler.BTD_CheckGameplayTagsOnActorAbortObservers
// Size: 0xD8(Inherited: 0xC8)
struct UBTD_CheckGameplayTagsOnActorAbortObservers : UBTDecorator_CheckGameplayTagsOnActor
{
	char pad_200[16];  // 0xC8 (0xC8)


}; 
 
 


// Class DungeonCrawler.ArtDataArmor
// Size: 0x90(Inherited: 0x80)
struct UArtDataArmor : UArtDataItem
{
	struct TArray<uint8_t> MorphTargets;  // 0x80 (0x80)


}; 
 
 


// Class DungeonCrawler.DCLoadingScreenWidget
// Size: 0x280(Inherited: 0x278)
struct UDCLoadingScreenWidget : UUserWidget
{
	int32_t ImageIndex;  // 0x278 (0x278)
	int32_t DescIndex;  // 0x27C (0x27C)


	void OnUpdated(); // Function DungeonCrawler.DCLoadingScreenWidget.OnUpdated
	int32_t GetNumImages(); // Function DungeonCrawler.DCLoadingScreenWidget.GetNumImages
	int32_t GetNumDescs(); // Function DungeonCrawler.DCLoadingScreenWidget.GetNumDescs
}; 
 
 


// Class DungeonCrawler.ContainerInventoryGroupWidget
// Size: 0x3C0(Inherited: 0x300)
struct UContainerInventoryGroupWidget : UDCWidgetBase
{
	struct UAccountLink* AccountLink;  // 0x300 (0x300)
	struct FString LinkedAccountId;  // 0x308 (0x308)
	struct FString CheckTargetAccountId;  // 0x318 (0x318)
	struct TArray<struct TWeakObjectPtr<UInventoryComponent>> InventoryArray;  // 0x328 (0x328)
	char pad_824[24];  // 0x338 (0x338)
	struct UPanelWidget* ContainerInventoryParent;  // 0x350 (0x350)
	struct TSoftClassPtr<UObject> ItemCountSelectWidgetClass;  // 0x358 (0x358)
	struct TArray<struct UContainerInventoryWidget*> ContainerInventoryWidgetArray;  // 0x388 (0x388)
	UContainerInventoryWidget* ContainerInventoryWidgetClass;  // 0x398 (0x398)
	UContainerInventoryWidget* ReadOnlyContainerInventoryWidgetClass;  // 0x3A0 (0x3A0)
	uint8_t InventoryGroupType;  // 0x3A8 (0x3A8)
	char pad_937[7];  // 0x3A9 (0x3A9)
	struct FMulticastInlineDelegate OnInventoryCountChanged;  // 0x3B0 (0x3B0)


	void ResetContainerInventoryWidgets(); // Function DungeonCrawler.ContainerInventoryGroupWidget.ResetContainerInventoryWidgets
	void OnPopItemSelectWidget(struct FItemData& ItemData, struct FVector2D& DropScreenPos, struct AActor* OldOwnerActor); // Function DungeonCrawler.ContainerInventoryGroupWidget.OnPopItemSelectWidget
	void OnItemDropDetected(struct FItemData& ItemData, struct FVector2D& DropScreenPos, struct AActor* OldOwnerActor); // Function DungeonCrawler.ContainerInventoryGroupWidget.OnItemDropDetected
}; 
 
 


// Class DungeonCrawler.VoipPartyMemberSettingWidget
// Size: 0x308(Inherited: 0x300)
struct UVoipPartyMemberSettingWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)


}; 
 
 


// Class DungeonCrawler.ArtDataUtility
// Size: 0x118(Inherited: 0x118)
struct UArtDataUtility : UArtDataAnimatedItem
{


}; 
 
 


// Class DungeonCrawler.ClassIconGroupWidget
// Size: 0x318(Inherited: 0x300)
struct UClassIconGroupWidget : UDCWidgetBase
{
	struct UCommonTileView* ClassIconCommonTileView;  // 0x300 (0x300)
	struct FMulticastInlineDelegate ClassIconSelectedDelegate;  // 0x308 (0x308)


}; 
 
 


// Class DungeonCrawler.BTDecorator_DCGameBlackboard
// Size: 0x120(Inherited: 0xC0)
struct UBTDecorator_DCGameBlackboard : UBTDecorator_Blackboard
{
	char pad_192[96];  // 0xC0 (0xC0)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.BTDecorator_DCGameBlackboard.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.BTDecorator_DCGameBlackboard.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.BTDecorator_DCGameBlackboard.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.BTDecorator_DCGameBlackboard.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.ArtDataAccessory
// Size: 0x80(Inherited: 0x80)
struct UArtDataAccessory : UArtDataItem
{


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationAgility
// Size: 0xC0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationAgility : UGameplayModMagnitudeCalculation
{
	char pad_64[128];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.FloorPortalScrollBase
// Size: 0x3F0(Inherited: 0x3E0)
struct AFloorPortalScrollBase : APropsActorBase
{
	uint8_t PortalScrollType;  // 0x3E0 (0x3E0)
	char pad_993[15];  // 0x3E1 (0x3E1)


	void ClosePortalScroll(struct ADCPlayerCharacterBase* Character); // Function DungeonCrawler.FloorPortalScrollBase.ClosePortalScroll
}; 
 
 


// Class DungeonCrawler.DesignDataAssetItemProperty
// Size: 0x48(Inherited: 0x38)
struct UDesignDataAssetItemProperty : UDCDesignDataAssetBase
{
	struct FDesignDataItemProperty Item;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.ArtDataProjectile
// Size: 0x40(Inherited: 0x38)
struct UArtDataProjectile : UDCDataAssetBase
{
	float DestroyTime;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)


}; 
 
 


// Class DungeonCrawler.DCRedstoneShardShopListWidgetBase
// Size: 0x330(Inherited: 0x300)
struct UDCRedstoneShardShopListWidgetBase : UDCWidgetBase
{
	char pad_768[24];  // 0x300 (0x300)
	struct UPanelWidget* ShopItemListWidget;  // 0x318 (0x318)
	char pad_800[16];  // 0x320 (0x320)


}; 
 
 


// Class DungeonCrawler.CharacterCreateAttributeWidgetData
// Size: 0x38(Inherited: 0x28)
struct UCharacterCreateAttributeWidgetData : UObject
{
	struct FGameplayEffectDescData AttrributeEffectDescData;  // 0x28 (0x28)
	char pad_52[4];  // 0x34 (0x34)


}; 
 
 


// Class DungeonCrawler.DCLootComponent
// Size: 0xF0(Inherited: 0xA0)
struct UDCLootComponent : UActorComponent
{
	struct AActor* LootTargetActor;  // 0xA0 (0xA0)
	char pad_168[72];  // 0xA8 (0xA8)


}; 
 
 


// Class DungeonCrawler.GA_ReversibleChangeIdle
// Size: 0x560(Inherited: 0x558)
struct UGA_ReversibleChangeIdle : UDCGameplayAbilityBase
{
	struct UAnimMontage* MontageToPlay;  // 0x558 (0x558)


	void OnCompleted(struct FGameplayTag EventTag, struct FGameplayEventData EventData); // Function DungeonCrawler.GA_ReversibleChangeIdle.OnCompleted
	void OnBlendOut(struct FGameplayTag EventTag, struct FGameplayEventData EventData); // Function DungeonCrawler.GA_ReversibleChangeIdle.OnBlendOut
	void AbilityActivated(struct FGameplayEventData TriggerEventData); // Function DungeonCrawler.GA_ReversibleChangeIdle.AbilityActivated
}; 
 
 


// Class DungeonCrawler.GameplayTagSoundConditionData
// Size: 0x80(Inherited: 0x30)
struct UGameplayTagSoundConditionData : UDataAsset
{
	struct TMap<struct FGameplayTag, struct FGameplayTagQuery> GameplayTagSoundConditionData;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.ArtDataSkill
// Size: 0x60(Inherited: 0x38)
struct UArtDataSkill : UDCDataAssetBase
{
	struct UTexture2D* SkillIconTexture;  // 0x38 (0x38)
	struct UNiagaraSystem* CastStart;  // 0x40 (0x40)
	struct UNiagaraSystem* CastReady;  // 0x48 (0x48)
	struct UNiagaraSystem* CastFire;  // 0x50 (0x50)
	struct UNiagaraSystem* ChannelingStart;  // 0x58 (0x58)


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationWill
// Size: 0xC0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationWill : UGameplayModMagnitudeCalculation
{
	char pad_64[128];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationMoveSpeed
// Size: 0x1C0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationMoveSpeed : UGameplayModMagnitudeCalculation
{
	char pad_64[384];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCShopConfirmPurchasePopupData
// Size: 0x68(Inherited: 0x30)
struct UDCShopConfirmPurchasePopupData : UPopupDataBase
{
	uint8_t CurrencyType;  // 0x30 (0x30)
	char pad_49[3];  // 0x31 (0x31)
	int32_t Price;  // 0x34 (0x34)
	uint8_t ShopType;  // 0x38 (0x38)
	char pad_57[3];  // 0x39 (0x39)
	struct FPrimaryAssetId ShopItemAssetId;  // 0x3C (0x3C)
	char pad_76[4];  // 0x4C (0x4C)
	struct FText ShopItemName;  // 0x50 (0x50)


}; 
 
 


// Class DungeonCrawler.ArtDataSpell
// Size: 0x68(Inherited: 0x38)
struct UArtDataSpell : UDCDataAssetBase
{
	struct UTexture2D* SpellIconTexture;  // 0x38 (0x38)
	struct UNiagaraSystem* CastStart;  // 0x40 (0x40)
	struct UNiagaraSystem* CastReady;  // 0x48 (0x48)
	struct UNiagaraSystem* CastFire;  // 0x50 (0x50)
	struct UNiagaraSystem* ChannelingStart;  // 0x58 (0x58)
	struct UNiagaraSystem* ChannelingStartOnCharacter;  // 0x60 (0x60)


}; 
 
 


// Class DungeonCrawler.DCDataComponent
// Size: 0xD0(Inherited: 0xA0)
struct UDCDataComponent : UActorComponent
{
	char pad_160[24];  // 0xA0 (0xA0)
	struct FPrimaryAssetId AssetId;  // 0xB8 (0xB8)
	struct UDCDataAssetBase* DataAsset;  // 0xC8 (0xC8)


	void OnRep_AssetId(struct FPrimaryAssetId PrevAssetId); // Function DungeonCrawler.DCDataComponent.OnRep_AssetId
}; 
 
 


// Class DungeonCrawler.DCDesignDataAssetBase
// Size: 0x38(Inherited: 0x38)
struct UDCDesignDataAssetBase : UDCDataAssetBase
{


}; 
 
 


// Class DungeonCrawler.DCCharacterLobbyCapture
// Size: 0x840(Inherited: 0x6B0)
struct ADCCharacterLobbyCapture : ADCCharacterV2
{
	char pad_1712[88];  // 0x6B0 (0x6B0)
	struct UBaseObject* BaseObject;  // 0x708 (0x708)
	struct FGameplayAbilitySpecHandle LobbyPoseAbilitySpecHandle;  // 0x710 (0x710)
	uint8_t PartyUserLocate;  // 0x714 (0x714)
	char pad_1813[163];  // 0x715 (0x715)
	struct UAccountLink* AccountLink;  // 0x7B8 (0x7B8)
	struct TArray<struct FPrimaryAssetId> OwnedPerkIdArray;  // 0x7C0 (0x7C0)
	struct TMap<int64_t, struct AActor*> ContainingActorMap;  // 0x7D0 (0x7D0)
	struct TArray<struct FItemData> ContainingItemDataArray;  // 0x820 (0x820)
	struct TWeakObjectPtr<UEquipmentInventoryComponent> LinkedEquipmentComponent;  // 0x830 (0x830)
	char pad_2104[8];  // 0x838 (0x838)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCCharacterLobbyCapture.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCCharacterLobbyCapture.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCCharacterLobbyCapture.TerminateBase
	void OnLobbyPoseSkinChanged(struct UDCActionSkinDataAsset* ActionSkinData, bool bIsEquipped); // Function DungeonCrawler.DCCharacterLobbyCapture.OnLobbyPoseSkinChanged
	uint8_t GetPartyLocation(); // Function DungeonCrawler.DCCharacterLobbyCapture.GetPartyLocation
	struct FNickname GetNickname(); // Function DungeonCrawler.DCCharacterLobbyCapture.GetNickname
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCCharacterLobbyCapture.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCAT_WaitForInputAction
// Size: 0xC8(Inherited: 0x80)
struct UDCAT_WaitForInputAction : UAbilityTask
{
	struct FMulticastInlineDelegate InputActionStarted;  // 0x80 (0x80)
	struct FMulticastInlineDelegate InputActionCompleted;  // 0x90 (0x90)
	struct UInputAction* InputAction;  // 0xA0 (0xA0)
	char pad_168[32];  // 0xA8 (0xA8)


	struct UDCAT_WaitForInputAction* WaitForInputAction(struct UGameplayAbility* OwningAbility, struct UInputAction* InInputAction, bool OnlyTriggerOnce); // Function DungeonCrawler.DCAT_WaitForInputAction.WaitForInputAction
}; 
 
 


// Class DungeonCrawler.ArtDataMusic
// Size: 0xA0(Inherited: 0x38)
struct UArtDataMusic : UDCDataAssetBase
{
	struct UTexture2D* MusicIconTexture;  // 0x38 (0x38)
	struct UNiagaraSystem* PlayStart;  // 0x40 (0x40)
	struct UNiagaraSystem* PlayStartOnCharacter;  // 0x48 (0x48)
	struct UNiagaraSystem* PlayReady;  // 0x50 (0x50)
	struct UNiagaraSystem* PlayReadyOnCharacter;  // 0x58 (0x58)
	struct UNiagaraSystem* PlayFire;  // 0x60 (0x60)
	struct UNiagaraSystem* PlayFireOnCharacter;  // 0x68 (0x68)
	struct UNiagaraSystem* ChannelingStart;  // 0x70 (0x70)
	struct UNiagaraSystem* ChannelingStartOnCharacter;  // 0x78 (0x78)
	struct UNiagaraSystem* MusicParticleSystemOnTarget;  // 0x80 (0x80)
	struct FName MusicParticleSystemOnTargetAttachBoneName;  // 0x88 (0x88)
	struct UNiagaraSystem* MusicNoteSystemOnTarget;  // 0x90 (0x90)
	struct UMaterialInterface* MusicNoteSystemMaterial;  // 0x98 (0x98)


}; 
 
 


// Class DungeonCrawler.DCAT_TargetActorRadius
// Size: 0xA0(Inherited: 0x80)
struct UDCAT_TargetActorRadius : UAbilityTask
{
	struct FMulticastInlineDelegate OnTargetActorOverlap;  // 0x80 (0x80)
	char pad_144[16];  // 0x90 (0x90)


	struct UDCAT_TargetActorRadius* TargetActorRadius(struct UGameplayAbility* OwningAbility, float Radius, enum class ECollisionChannel CollisionChannel, UObject* TargetingClass); // Function DungeonCrawler.DCAT_TargetActorRadius.TargetActorRadius
}; 
 
 


// Class DungeonCrawler.CharacterSelectCharSlotWidget
// Size: 0x3A0(Inherited: 0x300)
struct UCharacterSelectCharSlotWidget : UDCWidgetBase
{
	char pad_768[160];  // 0x300 (0x300)


	void OnFMsgWidgetStreamingModeNotifyBlueprint(struct FMsgWidgetStreamingModeNotify& InMsg); // Function DungeonCrawler.CharacterSelectCharSlotWidget.OnFMsgWidgetStreamingModeNotifyBlueprint
	void OnCharacterSlot(struct FCharacterSlot& NewValue, struct FCharacterSlot& OldValue); // Function DungeonCrawler.CharacterSelectCharSlotWidget.OnCharacterSlot
	bool CanSelect(); // Function DungeonCrawler.CharacterSelectCharSlotWidget.CanSelect
}; 
 
 


// Class DungeonCrawler.ClassSelectPerkItemWidget
// Size: 0x308(Inherited: 0x300)
struct UClassSelectPerkItemWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)


}; 
 
 


// Class DungeonCrawler.BTTask_DCGameCheckGameStart
// Size: 0xE0(Inherited: 0xE0)
struct UBTTask_DCGameCheckGameStart : UBTTask_DCGameBase
{


}; 
 
 


// Class DungeonCrawler.ArtDataPerk
// Size: 0x40(Inherited: 0x38)
struct UArtDataPerk : UDCDataAssetBase
{
	struct UTexture2D* PerkIconTexture;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.DCAIPerceptionComponent
// Size: 0x180(Inherited: 0x180)
struct UDCAIPerceptionComponent : UAIPerceptionComponent
{


}; 
 
 


// Class DungeonCrawler.DCGameObjectLinkComponent
// Size: 0xB8(Inherited: 0xA0)
struct UDCGameObjectLinkComponent : UActorComponent
{
	char pad_160[8];  // 0xA0 (0xA0)
	struct FGameplayTag TypeTag;  // 0xA8 (0xA8)
	struct FMulticastSparseDelegate OnGameObjectLinkEvent;  // 0xB0 (0xB0)
	char pad_177[7];  // 0xB1 (0xB1)


	struct TArray<struct FObjectLinkResponeEvent> RequestToLinkers(struct FObjectLinkRequestEvent& ObjectLinkRequestEvent); // Function DungeonCrawler.DCGameObjectLinkComponent.RequestToLinkers
}; 
 
 


// Class DungeonCrawler.DCUpdateRateOptimizeManagerComponent
// Size: 0x118(Inherited: 0xA0)
struct UDCUpdateRateOptimizeManagerComponent : UActorComponent
{
	char pad_160[120];  // 0xA0 (0xA0)


	void SetFreezeIdle(bool bInFreezeIdle); // Function DungeonCrawler.DCUpdateRateOptimizeManagerComponent.SetFreezeIdle
}; 
 
 


// Class DungeonCrawler.ArtDataMerchant
// Size: 0x40(Inherited: 0x38)
struct UArtDataMerchant : UDCDataAssetBase
{
	struct UTexture2D* MerchantIconTexture;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.MetaKarmaComponent
// Size: 0x100(Inherited: 0x100)
struct UMetaKarmaComponent : UMetaComponentBase
{


}; 
 
 


// Class DungeonCrawler.BTT_BlueprintBase
// Size: 0xA8(Inherited: 0xA8)
struct UBTT_BlueprintBase : UBTTask_BlueprintBase
{


	void OnTaskFinished(struct AAIController* OwnerController, struct APawn* ControlledPawn, enum class EBTNodeResult TaskResult); // Function DungeonCrawler.BTT_BlueprintBase.OnTaskFinished
}; 
 
 


// Class DungeonCrawler.ClassMusicListWidget
// Size: 0x4A0(Inherited: 0x4A0)
struct UClassMusicListWidget : UMusicListWidgetBase
{


	void OnShowEquippableSlot(); // Function DungeonCrawler.ClassMusicListWidget.OnShowEquippableSlot
	void OnHideEquippableSlot(); // Function DungeonCrawler.ClassMusicListWidget.OnHideEquippableSlot
}; 
 
 


// Class DungeonCrawler.DCAT_WaitDelayPausable
// Size: 0xB0(Inherited: 0x80)
struct UDCAT_WaitDelayPausable : UAbilityTask
{
	struct FMulticastInlineDelegate OnFinish;  // 0x80 (0x80)
	struct FMulticastInlineDelegate OnCancelled;  // 0x90 (0x90)
	char pad_160[16];  // 0xA0 (0xA0)


	struct UDCAT_WaitDelayPausable* WaitDelay(struct UGameplayAbility* OwningAbility, float Duration); // Function DungeonCrawler.DCAT_WaitDelayPausable.WaitDelay
	void ResumeTimer(); // Function DungeonCrawler.DCAT_WaitDelayPausable.ResumeTimer
	void PauseTimer(); // Function DungeonCrawler.DCAT_WaitDelayPausable.PauseTimer
	float GetElapsedTime(); // Function DungeonCrawler.DCAT_WaitDelayPausable.GetElapsedTime
	void AddTimerElapsedTimeRatio(float AdditionalRatio); // Function DungeonCrawler.DCAT_WaitDelayPausable.AddTimerElapsedTimeRatio
}; 
 
 


// Class DungeonCrawler.DCAnimNotify_PreReduceAmmoCountOnSourceObject
// Size: 0x40(Inherited: 0x38)
struct UDCAnimNotify_PreReduceAmmoCountOnSourceObject : UAnimNotify
{
	int32_t ReduceCount;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)


}; 
 
 


// Class DungeonCrawler.NickNameWidgetBase
// Size: 0x338(Inherited: 0x300)
struct UNickNameWidgetBase : UDCWidgetBase
{
	struct FNickNameWidgetData WidgetData;  // 0x300 (0x300)
	char pad_784[40];  // 0x310 (0x310)


	void SetNickName(struct FNickname& InNickName); // Function DungeonCrawler.NickNameWidgetBase.SetNickName
	void OnNickNameStr(struct FString NewValue, struct FString OldValue); // Function DungeonCrawler.NickNameWidgetBase.OnNickNameStr
}; 
 
 


// Class DungeonCrawler.BTTask_DCGameKillAllPlayer
// Size: 0xE0(Inherited: 0xE0)
struct UBTTask_DCGameKillAllPlayer : UBTTask_DCGameBase
{


}; 
 
 


// Class DungeonCrawler.DCPlayerCharacterBase
// Size: 0x9A0(Inherited: 0x8B0)
struct ADCPlayerCharacterBase : ADCCharacterBase
{
	char pad_2224[8];  // 0x8B0 (0x8B0)
	struct USkeletalMeshComponent* PartHead;  // 0x8B8 (0x8B8)
	struct USkeletalMeshComponent* PartHelmet;  // 0x8C0 (0x8C0)
	struct USkeletalMeshComponent* PartGloves;  // 0x8C8 (0x8C8)
	struct USkeletalMeshComponent* PartChest;  // 0x8D0 (0x8D0)
	struct USkeletalMeshComponent* PartPants;  // 0x8D8 (0x8D8)
	struct USkeletalMeshComponent* PartBoots;  // 0x8E0 (0x8E0)
	struct USkeletalMeshComponent* PartBack;  // 0x8E8 (0x8E8)
	struct TArray<struct FPrimaryAssetId> OwnedPerkIdArray;  // 0x8F0 (0x8F0)
	struct TArray<struct FPrimaryAssetId> OwnedSkillIdArray;  // 0x900 (0x900)
	char pad_2320[8];  // 0x910 (0x910)
	struct UDCCharacterDataComponent* DataComponent;  // 0x918 (0x918)
	struct UDCCharacterPartsComponent* PartsComponent;  // 0x920 (0x920)
	struct UDCPerkDataComponent* PerkDataComponent;  // 0x928 (0x928)
	char pad_2352[32];  // 0x930 (0x930)
	struct TMap<struct FGameplayTag, UDCPlayerCharacterClassComponent*> CharacterClassComponentMap;  // 0x950 (0x950)


	void ShowHitDirectionUIMessage(struct AActor* SourceActor, struct FVector HitDirection); // Function DungeonCrawler.DCPlayerCharacterBase.ShowHitDirectionUIMessage
	void OnRep_OwnedSkillIdArray(); // Function DungeonCrawler.DCPlayerCharacterBase.OnRep_OwnedSkillIdArray
	void OnRep_OwnedPerkIdArray(); // Function DungeonCrawler.DCPlayerCharacterBase.OnRep_OwnedPerkIdArray
	void OnActionSkinChanged(struct UDCActionSkinDataAsset* ActionSkinData, bool bIsEquipped); // Function DungeonCrawler.DCPlayerCharacterBase.OnActionSkinChanged
	void InitInventory_Server(); // Function DungeonCrawler.DCPlayerCharacterBase.InitInventory_Server
	struct UDCPerkDataComponent* GetPerkDataComponent(); // Function DungeonCrawler.DCPlayerCharacterBase.GetPerkDataComponent
	uint8_t GetGender(); // Function DungeonCrawler.DCPlayerCharacterBase.GetGender
	void ClientShowSystemMessage(struct FText MessageText); // Function DungeonCrawler.DCPlayerCharacterBase.ClientShowSystemMessage
	void ChangeGender_Server(uint8_t Gender); // Function DungeonCrawler.DCPlayerCharacterBase.ChangeGender_Server
}; 
 
 


// Class DungeonCrawler.SpellComponent
// Size: 0x148(Inherited: 0xA0)
struct USpellComponent : UDCPlayerCharacterClassComponent
{
	char pad_160[136];  // 0xA0 (0xA0)
	struct TArray<struct ASpellActor*> SpellActors;  // 0x128 (0x128)
	struct FGameplayTag CurrentSpellTag;  // 0x138 (0x138)
	float SpellCurrentCapacity;  // 0x140 (0x140)
	char pad_324[4];  // 0x144 (0x144)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.SpellComponent.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.SpellComponent.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.SpellComponent.TerminateBase
	void ServerSetCurrentSpell(struct FGameplayTag SpellTag); // Function DungeonCrawler.SpellComponent.ServerSetCurrentSpell
	void OnRep_SpellActors(struct TArray<struct ASpellActor*>& OldASpellActors); // Function DungeonCrawler.SpellComponent.OnRep_SpellActors
	void OnRep_CurrentSpellTag(); // Function DungeonCrawler.SpellComponent.OnRep_CurrentSpellTag
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.SpellComponent.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.ArtDataEmote
// Size: 0x40(Inherited: 0x38)
struct UArtDataEmote : UDCDataAssetBase
{
	struct UTexture2D* EmoteIconTexture;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.DCDungeonGameMode
// Size: 0x528(Inherited: 0x4C8)
struct ADCDungeonGameMode : ADCIngameGameMode
{
	float WarmupDuration;  // 0x4C8 (0x4C8)
	char pad_1228[4];  // 0x4CC (0x4CC)
	struct ADeathSwarmBase* DeathSwarm;  // 0x4D0 (0x4D0)
	struct FDCFloorRuleManager FloorRuleManager;  // 0x4D8 (0x4D8)
	char pad_1296[24];  // 0x510 (0x510)


}; 
 
 


// Class DungeonCrawler.DCMetaInventoryComponent
// Size: 0x180(Inherited: 0x180)
struct UDCMetaInventoryComponent : UDCLobbySimpleInventoryComponent
{


}; 
 
 


// Class DungeonCrawler.DCBagItemWidget
// Size: 0x508(Inherited: 0x500)
struct UDCBagItemWidget : UDCItemCommonWidget
{
	struct USizeBox* ItemSizeBox;  // 0x500 (0x500)


	bool IsGold(); // Function DungeonCrawler.DCBagItemWidget.IsGold
}; 
 
 


// Class DungeonCrawler.BTService_DCGameBase
// Size: 0xD0(Inherited: 0x70)
struct UBTService_DCGameBase : UBTService
{
	char pad_112[96];  // 0x70 (0x70)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.BTService_DCGameBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.BTService_DCGameBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.BTService_DCGameBase.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.BTService_DCGameBase.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.AsyncTaskAttributeChanged
// Size: 0x90(Inherited: 0x30)
struct UAsyncTaskAttributeChanged : UBlueprintAsyncActionBase
{
	struct FMulticastInlineDelegate OnAttributeChanged;  // 0x30 (0x30)
	struct UAbilitySystemComponent* ASC;  // 0x40 (0x40)
	char pad_72[72];  // 0x48 (0x48)


	struct UAsyncTaskAttributeChanged* ListenForAttributesChange(struct UAbilitySystemComponent* AbilitySystemComponent, struct TArray<struct FGameplayAttribute> Attributes); // Function DungeonCrawler.AsyncTaskAttributeChanged.ListenForAttributesChange
	struct UAsyncTaskAttributeChanged* ListenForAttributeChange(struct UAbilitySystemComponent* AbilitySystemComponent, struct FGameplayAttribute Attribute); // Function DungeonCrawler.AsyncTaskAttributeChanged.ListenForAttributeChange
	void EndTask(); // Function DungeonCrawler.AsyncTaskAttributeChanged.EndTask
}; 
 
 


// Class DungeonCrawler.GA_ItemInstallBase
// Size: 0x650(Inherited: 0x558)
struct UGA_ItemInstallBase : UDCGameplayAbilityBase
{
	struct UAnimMontage* MontageToPlay;  // 0x558 (0x558)
	APropsActorBase* ActorClassToInstall;  // 0x560 (0x560)
	struct FText ConsumeText;  // 0x568 (0x568)
	float ConsumeDuration;  // 0x580 (0x580)
	char pad_1412[4];  // 0x584 (0x584)
	struct FItemData ItemData;  // 0x588 (0x588)
	struct FVector TargetLocation;  // 0x628 (0x628)
	struct FPrimaryAssetId InstallPropId;  // 0x640 (0x640)


	void OnVelocityChange(); // Function DungeonCrawler.GA_ItemInstallBase.OnVelocityChange
	void OnNetSync(); // Function DungeonCrawler.GA_ItemInstallBase.OnNetSync
	void OnFinishConsume(); // Function DungeonCrawler.GA_ItemInstallBase.OnFinishConsume
	void OnDistanceChanged(); // Function DungeonCrawler.GA_ItemInstallBase.OnDistanceChanged
	void OnAimDirectionChange(); // Function DungeonCrawler.GA_ItemInstallBase.OnAimDirectionChange
	void EventReceived(struct FGameplayTag EventTag, struct FGameplayEventData EventData); // Function DungeonCrawler.GA_ItemInstallBase.EventReceived
}; 
 
 


// Class DungeonCrawler.AsyncTaskCooldownChanged
// Size: 0x80(Inherited: 0x30)
struct UAsyncTaskCooldownChanged : UBlueprintAsyncActionBase
{
	struct FMulticastInlineDelegate OnCooldownBegin;  // 0x30 (0x30)
	struct FMulticastInlineDelegate OnCooldownEnd;  // 0x40 (0x40)
	struct UAbilitySystemComponent* ASC;  // 0x50 (0x50)
	char pad_88[40];  // 0x58 (0x58)


	struct UAsyncTaskCooldownChanged* ListenForCooldownChange(struct UAbilitySystemComponent* AbilitySystemComponent, struct FGameplayTagContainer CooldownTags, bool UseServerCooldown); // Function DungeonCrawler.AsyncTaskCooldownChanged.ListenForCooldownChange
	void EndTask(); // Function DungeonCrawler.AsyncTaskCooldownChanged.EndTask
}; 
 
 


// Class DungeonCrawler.AsyncTaskEffectInhibitionChanged
// Size: 0x50(Inherited: 0x30)
struct UAsyncTaskEffectInhibitionChanged : UBlueprintAsyncActionBase
{
	struct FMulticastInlineDelegate OnGameplayEffectInhibitionChange;  // 0x30 (0x30)
	struct UAbilitySystemComponent* ASC;  // 0x40 (0x40)
	char pad_72[8];  // 0x48 (0x48)


	struct UAsyncTaskEffectInhibitionChanged* ListenForGameplayInhibitionChange(struct UAbilitySystemComponent* AbilitySystemComponent, struct FGameplayTag EffectGameplayTag); // Function DungeonCrawler.AsyncTaskEffectInhibitionChanged.ListenForGameplayInhibitionChange
	void EndTask(); // Function DungeonCrawler.AsyncTaskEffectInhibitionChanged.EndTask
}; 
 
 


// Class DungeonCrawler.DCCustomizeEmoteRadialWidget
// Size: 0x3C0(Inherited: 0x300)
struct UDCCustomizeEmoteRadialWidget : UDCWidgetBase
{
	struct UDCCustomizeEmoteRadialSlotWidget* EmoteRadialSlotWidget_2;  // 0x300 (0x300)
	struct UDCCustomizeEmoteRadialSlotWidget* EmoteRadialSlotWidget_3;  // 0x308 (0x308)
	struct UDCCustomizeEmoteRadialSlotWidget* EmoteRadialSlotWidget_4;  // 0x310 (0x310)
	struct UDCCustomizeEmoteRadialSlotWidget* EmoteRadialSlotWidget_5;  // 0x318 (0x318)
	struct UDCCustomizeEmoteRadialSlotWidget* EmoteRadialSlotWidget_6;  // 0x320 (0x320)
	struct UDCCustomizeEmoteRadialSlotWidget* EmoteRadialSlotWidget_7;  // 0x328 (0x328)
	struct UDCCustomizeEmoteRadialSlotWidget* EmoteRadialSlotWidget_8;  // 0x330 (0x330)
	struct UDCCustomizeEmoteRadialSlotWidget* EmoteRadialSlotWidget_9;  // 0x338 (0x338)
	char pad_832[128];  // 0x340 (0x340)


}; 
 
 


// Class DungeonCrawler.DCMonsterAnimInstanceBase
// Size: 0x510(Inherited: 0x4E0)
struct UDCMonsterAnimInstanceBase : UDCCharacterAnimInstanceBase
{
	struct FVector ForwardVector;  // 0x4D8 (0x4D8)
	char pad_1272_1 : 7;  // 0x4F8 (0x4F8)
	bool bIsStaggered : 1;  // 0x4F0 (0x4F0)
	char pad_1273_1 : 7;  // 0x4F9 (0x4F9)
	bool bShouldPlayHitReaction : 1;  // 0x4F1 (0x4F1)
	char pad_1274_1 : 7;  // 0x4FA (0x4FA)
	bool bShouldPlayHitReactionFlipFlop : 1;  // 0x4F2 (0x4F2)
	char pad_1275_1 : 7;  // 0x4FB (0x4FB)
	bool bMontagePlayingOrHorizontalSpeed : 1;  // 0x4F3 (0x4F3)
	char pad_1276_1 : 7;  // 0x4FC (0x4FC)
	bool bShouldPlayStaggered : 1;  // 0x4F4 (0x4F4)
	char pad_1277_1 : 7;  // 0x4FD (0x4FD)
	bool bStateAnimationNone : 1;  // 0x4F5 (0x4F5)
	char pad_1278_1 : 7;  // 0x4FE (0x4FE)
	bool bStateAnimationIdleEmpty : 1;  // 0x4F6 (0x4F6)
	char pad_1279_1 : 7;  // 0x4FF (0x4FF)
	bool bStateAnimationIdleDeath : 1;  // 0x4F7 (0x4F7)
	char pad_1280_1 : 7;  // 0x500 (0x500)
	bool bStateAnimationIdleReloaded : 1;  // 0x4F8 (0x4F8)
	char pad_1281_1 : 7;  // 0x501 (0x501)
	bool bStateAnimationIdleSpawn : 1;  // 0x4F9 (0x4F9)
	char pad_1282_1 : 7;  // 0x502 (0x502)
	bool bStateAnimationIdleDeactivate : 1;  // 0x4FA (0x4FA)
	char pad_1283_1 : 7;  // 0x503 (0x503)
	bool bStateAnimationIdleActivate : 1;  // 0x4FB (0x4FB)
	char pad_1284_1 : 7;  // 0x504 (0x504)
	bool bStateAnimationIdle : 1;  // 0x4FC (0x4FC)
	char pad_1285_1 : 7;  // 0x505 (0x505)
	bool bStateAnimationIdleClose : 1;  // 0x4FD (0x4FD)
	char pad_1286_1 : 7;  // 0x506 (0x506)
	bool bStateAnimationIdleOpen : 1;  // 0x4FE (0x4FE)
	char pad_1287_1 : 7;  // 0x507 (0x507)
	bool bStateAnimationIdleOpenForward : 1;  // 0x4FF (0x4FF)
	char pad_1288_1 : 7;  // 0x508 (0x508)
	bool bStateAnimationIdleOpenBackward : 1;  // 0x500 (0x500)
	char pad_1289_1 : 7;  // 0x509 (0x509)
	bool bStateAnimationIdleOn : 1;  // 0x501 (0x501)
	char pad_1290_1 : 7;  // 0x50A (0x50A)
	bool bStateAnimationIdleDisarm : 1;  // 0x502 (0x502)
	char pad_1291_1 : 7;  // 0x50B (0x50B)
	bool bStateAnimationIdleRemove : 1;  // 0x503 (0x503)
	char pad_1292[4];  // 0x50C (0x50C)


}; 
 
 


// Class DungeonCrawler.TopTitleWidgetBase
// Size: 0x318(Inherited: 0x300)
struct UTopTitleWidgetBase : UDCWidgetBase
{
	struct UTextBlock* Text_Title;  // 0x300 (0x300)
	struct UDCCommonButtonBase* Btn_Left;  // 0x308 (0x308)
	struct UDCCommonButtonBase* Btn_Right;  // 0x310 (0x310)


	void SetTitleText(struct FText& TitleText); // Function DungeonCrawler.TopTitleWidgetBase.SetTitleText
	void SetRightButtonText(struct FText& ButtonText); // Function DungeonCrawler.TopTitleWidgetBase.SetRightButtonText
	void SetLeftButtonText(struct FText& ButtonText); // Function DungeonCrawler.TopTitleWidgetBase.SetLeftButtonText
}; 
 
 


// Class DungeonCrawler.DCItemActor
// Size: 0x3B0(Inherited: 0x290)
struct ADCItemActor : AActor
{
	struct FDCItemInfo ItemInfo;  // 0x290 (0x290)
	struct USkeletalMeshComponent* ItemMeshComponent;  // 0x3A8 (0x3A8)


	void OnRep_ItemInfo(); // Function DungeonCrawler.DCItemActor.OnRep_ItemInfo
}; 
 
 


// Class DungeonCrawler.AsyncTaskEffectStackChanged
// Size: 0x50(Inherited: 0x30)
struct UAsyncTaskEffectStackChanged : UBlueprintAsyncActionBase
{
	struct FMulticastInlineDelegate OnGameplayEffectStackChange;  // 0x30 (0x30)
	struct UAbilitySystemComponent* ASC;  // 0x40 (0x40)
	char pad_72[8];  // 0x48 (0x48)


	struct UAsyncTaskEffectStackChanged* ListenForGameplayEffectStackChange(struct UAbilitySystemComponent* AbilitySystemComponent, struct FGameplayTag EffectGameplayTag); // Function DungeonCrawler.AsyncTaskEffectStackChanged.ListenForGameplayEffectStackChange
	void EndTask(); // Function DungeonCrawler.AsyncTaskEffectStackChanged.EndTask
}; 
 
 


// Class DungeonCrawler.AsyncTaskWaitGAActivated
// Size: 0xF8(Inherited: 0x38)
struct UAsyncTaskWaitGAActivated : UAbilityAsync
{
	char pad_56[160];  // 0x38 (0x38)
	struct FMulticastInlineDelegate OnActivate;  // 0xD8 (0xD8)
	char pad_232[16];  // 0xE8 (0xE8)


	struct UAsyncTaskWaitGAActivated* WaitForAbilityActivateWithTagRequirements(struct AActor* TargetActor, struct FGameplayTagRequirements TagRequirements, bool IncludeTriggeredAbilities, bool TriggerOnce); // Function DungeonCrawler.AsyncTaskWaitGAActivated.WaitForAbilityActivateWithTagRequirements
	struct UAsyncTaskWaitGAActivated* WaitForAbilityActivate_Query(struct AActor* TargetActor, struct FGameplayTagQuery Query, bool IncludeTriggeredAbilities, bool TriggerOnce); // Function DungeonCrawler.AsyncTaskWaitGAActivated.WaitForAbilityActivate_Query
	struct UAsyncTaskWaitGAActivated* WaitForAbilityActivate(struct AActor* TargetActor, struct FGameplayTag WithTag, struct FGameplayTag WithoutTag, bool IncludeTriggeredAbilities, bool TriggerOnce); // Function DungeonCrawler.AsyncTaskWaitGAActivated.WaitForAbilityActivate
	void OnAbilityActivate(struct UGameplayAbility* ActivatedAbility); // Function DungeonCrawler.AsyncTaskWaitGAActivated.OnAbilityActivate
}; 
 
 


// Class DungeonCrawler.AsyncTaskWaitGAEnded
// Size: 0xF8(Inherited: 0x38)
struct UAsyncTaskWaitGAEnded : UAbilityAsync
{
	char pad_56[160];  // 0x38 (0x38)
	struct FMulticastInlineDelegate OnAbilityEndedDelegate;  // 0xD8 (0xD8)
	char pad_232[16];  // 0xE8 (0xE8)


	struct UAsyncTaskWaitGAEnded* WaitForAbilityEndWithTagRequirements(struct AActor* TargetActor, struct FGameplayTagRequirements TagRequirements, bool TriggerOnce); // Function DungeonCrawler.AsyncTaskWaitGAEnded.WaitForAbilityEndWithTagRequirements
	struct UAsyncTaskWaitGAEnded* WaitForAbilityEnd_Query(struct AActor* TargetActor, struct FGameplayTagQuery Query, bool TriggerOnce); // Function DungeonCrawler.AsyncTaskWaitGAEnded.WaitForAbilityEnd_Query
	struct UAsyncTaskWaitGAEnded* WaitForAbilityEnd(struct AActor* TargetActor, struct FGameplayTag WithTag, struct FGameplayTag WithoutTag, bool TriggerOnce); // Function DungeonCrawler.AsyncTaskWaitGAEnded.WaitForAbilityEnd
	void OnAbilityEnded(struct FAbilityEndedData& AbilityEndedData); // Function DungeonCrawler.AsyncTaskWaitGAEnded.OnAbilityEnded
}; 
 
 


// Class DungeonCrawler.AsyncTaskWaitGameplayEvent
// Size: 0x60(Inherited: 0x38)
struct UAsyncTaskWaitGameplayEvent : UAbilityAsync
{
	struct FMulticastInlineDelegate EventReceived;  // 0x38 (0x38)
	char pad_72[24];  // 0x48 (0x48)


	struct UAsyncTaskWaitGameplayEvent* WaitGameplayEventToActor(struct AActor* TargetActor, struct FGameplayTag EventTag, bool OnlyTriggerOnce, bool OnlyMatchExact); // Function DungeonCrawler.AsyncTaskWaitGameplayEvent.WaitGameplayEventToActor
	void EventReceivedDelegate__DelegateSignature(struct FGameplayEventData Payload); // DelegateFunction DungeonCrawler.AsyncTaskWaitGameplayEvent.EventReceivedDelegate__DelegateSignature
}; 
 
 


// Class DungeonCrawler.DCResource
// Size: 0x328(Inherited: 0x28)
struct UDCResource : UObject
{
	struct TMap<uint8_t, struct UDCCharacterPartsArtData*> CharacterPartsDataMap;  // 0x28 (0x28)
	struct TMap<struct FDCPlayerCharacterKey, struct FDCPlayerCharacterData> PlayerCharacterDataMap;  // 0x78 (0x78)
	struct TMap<uint8_t, struct TSoftObjectPtr<USoundData>> CharacterSounds;  // 0xC8 (0xC8)
	struct UDCInputConfigData* InputConfigData;  // 0x118 (0x118)
	struct TArray<struct FMappableConfigPair> MappableConfigPairs;  // 0x120 (0x120)
	UDCContextMenuWidget* ContextMenuWidgetClass;  // 0x130 (0x130)
	struct TMap<struct FGameplayAttribute, struct FText> AttributeDisplayNameMap;  // 0x138 (0x138)
	struct FDCMerchantAssetManager MerchantAssetManager;  // 0x188 (0x188)
	struct TMap<uint8_t, struct TSoftObjectPtr<UWorld>> WaitingMaps;  // 0x2C8 (0x2C8)
	struct UCurveTable* LuckGradeCurveTable;  // 0x318 (0x318)
	ADCCharacterV2* ResurrectionCharacterClass;  // 0x320 (0x320)


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationItemArmorRating
// Size: 0xC0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationItemArmorRating : UGameplayModMagnitudeCalculation
{
	char pad_64[128];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.GA_CharacterJump
// Size: 0x558(Inherited: 0x558)
struct UGA_CharacterJump : UDCGameplayAbilityBase
{


	void OnMovementModeChange(enum class EMovementMode MovementMode); // Function DungeonCrawler.GA_CharacterJump.OnMovementModeChange
	void EventReceived(struct FGameplayEventData EventData); // Function DungeonCrawler.GA_CharacterJump.EventReceived
}; 
 
 


// Class DungeonCrawler.DCWidgetBase
// Size: 0x300(Inherited: 0x2A0)
struct UDCWidgetBase : UCommonUserWidget
{
	char pad_672[88];  // 0x2A0 (0x2A0)
	struct UBaseObject* BaseObject;  // 0x2F8 (0x2F8)


	void UnbindMsgOwner(struct UScriptStruct* InMsgType); // Function DungeonCrawler.DCWidgetBase.UnbindMsgOwner
	void UnbindMsgAllOwner(); // Function DungeonCrawler.DCWidgetBase.UnbindMsgAllOwner
	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCWidgetBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCWidgetBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCWidgetBase.TerminateBase
	bool IsSpectating(); // Function DungeonCrawler.DCWidgetBase.IsSpectating
	struct TScriptInterface<IBaseInterface> GetOwningBaseInterfaceBlueprint(); // Function DungeonCrawler.DCWidgetBase.GetOwningBaseInterfaceBlueprint
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCWidgetBase.BroadcastMsgBlueprint
	void BindMsgOwner(struct UScriptStruct* InMsgType, struct UBindMsgNode* InMsgDynamicDelegate); // Function DungeonCrawler.DCWidgetBase.BindMsgOwner
}; 
 
 


// Class DungeonCrawler.DCAT_WaitDistChangeFromView
// Size: 0x130(Inherited: 0x80)
struct UDCAT_WaitDistChangeFromView : UAbilityTask
{
	struct FMulticastInlineDelegate OnDistanceChange;  // 0x80 (0x80)
	char pad_144[160];  // 0x90 (0x90)


	struct UDCAT_WaitDistChangeFromView* WaitDistanceChange(struct UGameplayAbility* OwningAbility, struct AActor* TargetActor, struct FVector TargetLocation, float MaximumDistance, float CollisionRadius, enum class ECollisionChannel CollisionChannel); // Function DungeonCrawler.DCAT_WaitDistChangeFromView.WaitDistanceChange
}; 
 
 


// Class DungeonCrawler.AttackInputManagerComponent
// Size: 0x108(Inherited: 0xA0)
struct UAttackInputManagerComponent : UActorComponent
{
	struct UAsyncTaskWaitGameplayEvent* AsyncGameplayEventWaitTask;  // 0xA0 (0xA0)
	struct UAsyncTaskWaitGAActivated* AsyncGAActivateTask;  // 0xA8 (0xA8)
	struct UAsyncTaskWaitGAEnded* AsyncGAEndTask;  // 0xB0 (0xB0)
	struct TMap<struct FGameplayTag, struct FGameplayTag> CurrentTriggerMap;  // 0xB8 (0xB8)


	void SetAttackEnabled(bool bIsAttackEnabled); // Function DungeonCrawler.AttackInputManagerComponent.SetAttackEnabled
	void OnAbilityEnded(struct FAbilityEndedData& AbilityEndedData); // Function DungeonCrawler.AttackInputManagerComponent.OnAbilityEnded
	void OnAbilityActivate(struct UGameplayAbility* ActivatedAbility); // Function DungeonCrawler.AttackInputManagerComponent.OnAbilityActivate
	void HandleAttackInput(struct FGameplayTag InputTag); // Function DungeonCrawler.AttackInputManagerComponent.HandleAttackInput
	struct FGameplayTag GetCurrentTriggerTag(struct FGameplayTag TriggerTag); // Function DungeonCrawler.AttackInputManagerComponent.GetCurrentTriggerTag
	void EventReceived(struct FGameplayEventData EventData); // Function DungeonCrawler.AttackInputManagerComponent.EventReceived
}; 
 
 


// Class DungeonCrawler.DCCharacterSkinListEntryWidget
// Size: 0x400(Inherited: 0x3F0)
struct UDCCharacterSkinListEntryWidget : UDCCharacterSkinWidget
{
	char pad_1008[16];  // 0x3F0 (0x3F0)


	void OnRightClicked(); // Function DungeonCrawler.DCCharacterSkinListEntryWidget.OnRightClicked
}; 
 
 


// Class DungeonCrawler.BTDecorator_DCGameCheckGameState
// Size: 0x128(Inherited: 0x120)
struct UBTDecorator_DCGameCheckGameState : UBTDecorator_DCGameBlackboard
{
	uint8_t PrevGameStateType;  // 0x120 (0x120)
	char pad_289[7];  // 0x121 (0x121)


}; 
 
 


// Class DungeonCrawler.BTTask_DCGameBase
// Size: 0xE0(Inherited: 0x70)
struct UBTTask_DCGameBase : UBTTaskNode
{
	char pad_112[88];  // 0x70 (0x70)
	enum class EBTNodeResult Result;  // 0xC8 (0xC8)
	char pad_201[3];  // 0xC9 (0xC9)
	struct FIntervalCountdown TickInterval;  // 0xCC (0xCC)
	char pad_212[12];  // 0xD4 (0xD4)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.BTTask_DCGameBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.BTTask_DCGameBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.BTTask_DCGameBase.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.BTTask_DCGameBase.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.BTTask_DCGameAnnounce
// Size: 0x178(Inherited: 0xE0)
struct UBTTask_DCGameAnnounce : UBTTask_DCGameBase
{
	struct FGameAnnounceInfo GameAnnounceInfo;  // 0xE0 (0xE0)


}; 
 
 


// Class DungeonCrawler.DCEquipmentSlotWidget
// Size: 0x530(Inherited: 0x500)
struct UDCEquipmentSlotWidget : UDCItemCommonWidget
{
	char pad_1280_1 : 7;  // 0x500 (0x500)
	bool bCanEquip : 1;  // 0x500 (0x500)
	char pad_1281_1 : 7;  // 0x501 (0x501)
	bool bPairSlot : 1;  // 0x501 (0x501)
	char pad_1282_1 : 7;  // 0x502 (0x502)
	bool bDropPreview : 1;  // 0x502 (0x502)
	char pad_1283[5];  // 0x503 (0x503)
	struct UImage* DropPreviewImage;  // 0x508 (0x508)
	float WearingDurationTime;  // 0x510 (0x510)
	float WearingRemainTime;  // 0x514 (0x514)
	struct USizeBox* ItemSizeBox;  // 0x518 (0x518)
	struct USizeBox* DropPreviewSizeBox;  // 0x520 (0x520)
	uint8_t EquipSlot;  // 0x528 (0x528)
	char pad_1321[7];  // 0x529 (0x529)


	bool IsWeapon(); // Function DungeonCrawler.DCEquipmentSlotWidget.IsWeapon
	bool IsTwoHandedWeapon(); // Function DungeonCrawler.DCEquipmentSlotWidget.IsTwoHandedWeapon
	bool IsPairSlot(); // Function DungeonCrawler.DCEquipmentSlotWidget.IsPairSlot
}; 
 
 


// Class DungeonCrawler.BTTask_DCGameAnnounceArray
// Size: 0xF8(Inherited: 0xE0)
struct UBTTask_DCGameAnnounceArray : UBTTask_DCGameBase
{
	struct TArray<struct FGameAnnounceInfo> GameAnnounceInfoArray;  // 0xE0 (0xE0)
	char pad_240[8];  // 0xF0 (0xF0)


}; 
 
 


// Class DungeonCrawler.BTTask_DCGameExecuteGameResult
// Size: 0xE0(Inherited: 0xE0)
struct UBTTask_DCGameExecuteGameResult : UBTTask_DCGameBase
{


}; 
 
 


// Class DungeonCrawler.BTTask_DCGameExitAllPlayer
// Size: 0xE0(Inherited: 0xE0)
struct UBTTask_DCGameExitAllPlayer : UBTTask_DCGameBase
{


}; 
 
 


// Class DungeonCrawler.ChatWidgetData
// Size: 0xB8(Inherited: 0x28)
struct UChatWidgetData : UObject
{
	int64_t ChatIndex;  // 0x28 (0x28)
	uint8_t ChatWidgetType;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)
	struct FDateTime DateTime;  // 0x38 (0x38)
	struct FString AccountId;  // 0x40 (0x40)
	struct FString CharacterId;  // 0x50 (0x50)
	struct FNickname Nickname;  // 0x60 (0x60)
	struct FString PartyId;  // 0x88 (0x88)
	struct TArray<struct FChatDataPiece> ChatDataPieceArray;  // 0x98 (0x98)
	struct TArray<uint8_t> ContextOptionArray;  // 0xA8 (0xA8)


}; 
 
 


// Class DungeonCrawler.BTTask_DCGameServerTravel
// Size: 0xF0(Inherited: 0xE0)
struct UBTTask_DCGameServerTravel : UBTTask_DCGameBase
{
	struct FString ServerTravelURL;  // 0xE0 (0xE0)


}; 
 
 


// Class DungeonCrawler.BTTask_DCGameState
// Size: 0xE8(Inherited: 0xE0)
struct UBTTask_DCGameState : UBTTask_DCGameBase
{
	uint8_t GameState;  // 0xE0 (0xE0)
	char pad_225[7];  // 0xE1 (0xE1)


}; 
 
 


// Class DungeonCrawler.BTT_CustomRunBehavior
// Size: 0x78(Inherited: 0x78)
struct UBTT_CustomRunBehavior : UBTTask_RunBehavior
{


}; 
 
 


// Class DungeonCrawler.DCPerkDataComponent
// Size: 0xF8(Inherited: 0xA0)
struct UDCPerkDataComponent : UActorComponent
{
	struct FGameplayTagContainer WearableWeaponList;  // 0xA0 (0xA0)
	struct FGameplayTagContainer RestrictedItemList;  // 0xC0 (0xC0)
	char pad_224[24];  // 0xE0 (0xE0)


	void RemoveWearableWeaponList(struct FGameplayTagContainer& InWeaponList); // Function DungeonCrawler.DCPerkDataComponent.RemoveWearableWeaponList
	void RemoveRestrictedItemList(struct FGameplayTagContainer& InItemList); // Function DungeonCrawler.DCPerkDataComponent.RemoveRestrictedItemList
	void AddWearableWeaponList(struct FGameplayTagContainer& InWeaponList); // Function DungeonCrawler.DCPerkDataComponent.AddWearableWeaponList
	void AddRestrictedItemList(struct FGameplayTagContainer& InItemList); // Function DungeonCrawler.DCPerkDataComponent.AddRestrictedItemList
}; 
 
 


// Class DungeonCrawler.DCIdTagGroupItemDataAsset
// Size: 0x48(Inherited: 0x38)
struct UDCIdTagGroupItemDataAsset : UDCTableDataAsset
{
	struct TArray<struct FDCIdTagGroupItemData> IdTagGroupItemArray;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.CharacterCreateAttributeWidget
// Size: 0x308(Inherited: 0x300)
struct UCharacterCreateAttributeWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)


}; 
 
 


// Class DungeonCrawler.CharacterCreateClassItemWidgetData
// Size: 0x30(Inherited: 0x28)
struct UCharacterCreateClassItemWidgetData : UObject
{
	uint8_t CharacterClass;  // 0x28 (0x28)
	uint8_t Gender;  // 0x29 (0x29)
	char pad_42_1 : 7;  // 0x2A (0x2A)
	bool bSelected : 1;  // 0x2A (0x2A)
	char pad_43_1 : 7;  // 0x2B (0x2B)
	bool bIsOwned : 1;  // 0x2B (0x2B)
	char pad_44[4];  // 0x2C (0x2C)


}; 
 
 


// Class DungeonCrawler.DCEditableText
// Size: 0x520(Inherited: 0x4E0)
struct UDCEditableText : UEditableText
{
	char pad_1248[64];  // 0x4E0 (0x4E0)


}; 
 
 


// Class DungeonCrawler.CharacterCreateClassItemWidget
// Size: 0x338(Inherited: 0x300)
struct UCharacterCreateClassItemWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)
	struct FText Title;  // 0x308 (0x308)
	struct UTexture2D* Icon;  // 0x320 (0x320)
	struct UTexture2D* Portrait;  // 0x328 (0x328)
	char pad_816_1 : 7;  // 0x330 (0x330)
	bool bSelected : 1;  // 0x330 (0x330)
	char pad_817_1 : 7;  // 0x331 (0x331)
	bool bCanCreate : 1;  // 0x331 (0x331)
	char pad_818_1 : 7;  // 0x332 (0x332)
	bool bExperimental : 1;  // 0x332 (0x332)
	char pad_819_1 : 7;  // 0x333 (0x333)
	bool bIsOwned : 1;  // 0x333 (0x333)
	char pad_820[4];  // 0x334 (0x334)


}; 
 
 


// Class DungeonCrawler.DCAT_WaitGenericGameplayTagEvent
// Size: 0xC0(Inherited: 0x80)
struct UDCAT_WaitGenericGameplayTagEvent : UAbilityTask
{
	struct FMulticastInlineDelegate Added;  // 0x80 (0x80)
	struct FMulticastInlineDelegate Removed;  // 0x90 (0x90)
	char pad_160[8];  // 0xA0 (0xA0)
	struct UAbilitySystemComponent* OptionalExternalTarget;  // 0xA8 (0xA8)
	char pad_176[16];  // 0xB0 (0xB0)


	struct UDCAT_WaitGenericGameplayTagEvent* WaitGenericGameplayTagEvent(struct UGameplayAbility* OwningAbility, struct AActor* InOptionalExternalTarget); // Function DungeonCrawler.DCAT_WaitGenericGameplayTagEvent.WaitGenericGameplayTagEvent
}; 
 
 


// Class DungeonCrawler.DCItemTooltipWidget
// Size: 0x510(Inherited: 0x4C8)
struct UDCItemTooltipWidget : UDCItemWidgetBase
{
	struct UDCItemTooltipNameWidget* NameWidget;  // 0x4C8 (0x4C8)
	struct UDCItemTooltipStatWidget* StatWidget;  // 0x4D0 (0x4D0)
	struct UDCItemTooltipAbilityWidget* AbilityWidget;  // 0x4D8 (0x4D8)
	struct UDCItemTooltipRequirementWidget* RequirementWidget;  // 0x4E0 (0x4E0)
	struct UDCItemTooltipInfoWidget* InfoWidget;  // 0x4E8 (0x4E8)
	struct UListView* PriceListWidget;  // 0x4F0 (0x4F0)
	struct UTextBlock* DescTextBlock;  // 0x4F8 (0x4F8)
	struct TArray<struct UDCItemWidgetBase*> ChildWidgets;  // 0x500 (0x500)


}; 
 
 


// Class DungeonCrawler.CharacterCreatePerkItemWidget
// Size: 0x300(Inherited: 0x300)
struct UCharacterCreatePerkItemWidget : UDCWidgetBase
{


}; 
 
 


// Class DungeonCrawler.CharacterSelectCharListWidget
// Size: 0x330(Inherited: 0x300)
struct UCharacterSelectCharListWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)
	struct UListView* CharacterSlotListView;  // 0x308 (0x308)
	int32_t CurrentPageIndex;  // 0x310 (0x310)
	int32_t MaxCharacterCount;  // 0x314 (0x314)
	int32_t MaxPageIndex;  // 0x318 (0x318)
	char pad_796[20];  // 0x31C (0x31C)


	void OnSelectedCharacterId(struct FString CharacterId); // Function DungeonCrawler.CharacterSelectCharListWidget.OnSelectedCharacterId
	void OnPageNumber(int32_t CurrentPage, int32_t MaxPage); // Function DungeonCrawler.CharacterSelectCharListWidget.OnPageNumber
	void OnListRightButtonClicked(); // Function DungeonCrawler.CharacterSelectCharListWidget.OnListRightButtonClicked
	void OnListLeftButtonClicked(); // Function DungeonCrawler.CharacterSelectCharListWidget.OnListLeftButtonClicked
	void OnCharacterSlotListViewItemClicked(struct UObject* Obj); // Function DungeonCrawler.CharacterSelectCharListWidget.OnCharacterSlotListViewItemClicked
	void OnCharacterSlotData(struct FCharacterSlotData& NewValue, struct FCharacterSlotData& OldValue); // Function DungeonCrawler.CharacterSelectCharListWidget.OnCharacterSlotData
	void HandleCharacterDeleteClicked(); // Function DungeonCrawler.CharacterSelectCharListWidget.HandleCharacterDeleteClicked
	void HandleCharacterCreateClicked(); // Function DungeonCrawler.CharacterSelectCharListWidget.HandleCharacterCreateClicked
	struct UCharacterSelectCharacterSlotWidgetData* GetSelectedCharacterWidgetData(); // Function DungeonCrawler.CharacterSelectCharListWidget.GetSelectedCharacterWidgetData
	uint8_t GetPageArrowVisibility(); // Function DungeonCrawler.CharacterSelectCharListWidget.GetPageArrowVisibility
}; 
 
 


// Class DungeonCrawler.DCEntryGameMode
// Size: 0x3A0(Inherited: 0x3A0)
struct ADCEntryGameMode : ADCGameModeBase
{


}; 
 
 


// Class DungeonCrawler.DCCharacterDataComponent
// Size: 0xF0(Inherited: 0xD0)
struct UDCCharacterDataComponent : UDCDataComponent
{
	char pad_208[32];  // 0xD0 (0xD0)


}; 
 
 


// Class DungeonCrawler.InjectionItemListEntryWidgetData
// Size: 0x38(Inherited: 0x28)
struct UInjectionItemListEntryWidgetData : UObject
{
	struct UDCItemDataAsset* ItemData;  // 0x28 (0x28)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool bIsSelected : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)


}; 
 
 


// Class DungeonCrawler.DCCharacterPartsComponent
// Size: 0x250(Inherited: 0xA0)
struct UDCCharacterPartsComponent : UActorComponent
{
	struct UDCCharacterPartsArtData* Data;  // 0xA0 (0xA0)
	struct TMap<uint8_t, struct USkeletalMeshComponent*> BodyParts;  // 0xA8 (0xA8)
	struct TMap<uint8_t, struct USkeletalMeshComponent*> ArmorParts;  // 0xF8 (0xF8)
	struct TMap<uint8_t, struct FPrimaryAssetId> ArmorItems;  // 0x148 (0x148)
	struct TMap<struct FDCItemId, struct FDCItemInfo> ArmorItemInfos;  // 0x198 (0x198)
	char pad_488[104];  // 0x1E8 (0x1E8)


	void OnItemUnequipEvent(struct FDCItemId ItemId); // Function DungeonCrawler.DCCharacterPartsComponent.OnItemUnequipEvent
	void OnItemEquipEvent(struct FDCItemInfo& ItemInfo); // Function DungeonCrawler.DCCharacterPartsComponent.OnItemEquipEvent
}; 
 
 


// Class DungeonCrawler.DCLootDropRateDataAsset
// Size: 0x48(Inherited: 0x38)
struct UDCLootDropRateDataAsset : UDCTableDataAsset
{
	struct TArray<struct FDCLootDropRateItemData> LootDropRateItemArray;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.GameHeadupAccountWidget
// Size: 0x370(Inherited: 0x308)
struct UGameHeadupAccountWidget : UGameHeadupWidget
{
	char pad_776[16];  // 0x308 (0x308)
	struct FNickname Nickname;  // 0x318 (0x318)
	struct UTexture2D* CharacterIconTexture;  // 0x340 (0x340)
	char pad_840_1 : 7;  // 0x348 (0x348)
	bool bVisible : 1;  // 0x348 (0x348)
	char pad_841[39];  // 0x349 (0x349)


	void OnRefreshNickname(); // Function DungeonCrawler.GameHeadupAccountWidget.OnRefreshNickname
}; 
 
 


// Class DungeonCrawler.DCReportPlayerChecklistSlotWidget
// Size: 0x2D8(Inherited: 0x278)
struct UDCReportPlayerChecklistSlotWidget : UUserWidget
{
	char pad_632[24];  // 0x278 (0x278)
	struct UCheckBox* ReportCheckBox;  // 0x290 (0x290)
	char pad_664[8];  // 0x298 (0x298)
	struct FText ReportCategoryTitleText;  // 0x2A0 (0x2A0)
	struct FText ReportCategoryDetailText;  // 0x2B8 (0x2B8)
	char pad_720[8];  // 0x2D0 (0x2D0)


	void HandleChangedCheckState(bool bNewState); // Function DungeonCrawler.DCReportPlayerChecklistSlotWidget.HandleChangedCheckState
	uint8_t GetReportedCategoryVisibility(); // Function DungeonCrawler.DCReportPlayerChecklistSlotWidget.GetReportedCategoryVisibility
}; 
 
 


// Class DungeonCrawler.DCChatRoomDataAsset
// Size: 0x90(Inherited: 0x38)
struct UDCChatRoomDataAsset : UDCTableDataAsset
{
	struct FText Name;  // 0x38 (0x38)
	int32_t Order;  // 0x50 (0x50)
	uint8_t ChatRoomCategoryType;  // 0x54 (0x54)
	char pad_85[3];  // 0x55 (0x55)
	struct TArray<struct FGameplayTag> AllowedItemLinkTypes;  // 0x58 (0x58)
	struct TArray<struct FPrimaryAssetId> AllowedItemLinkClassIds;  // 0x68 (0x68)
	struct FText AllowedAllowedItemLinkDesc;  // 0x78 (0x78)


}; 
 
 


// Class DungeonCrawler.CharacterSelectCharacterListWidgetData
// Size: 0x38(Inherited: 0x28)
struct UCharacterSelectCharacterListWidgetData : UObject
{
	struct FCharacterSlotData CharacterSlotData;  // 0x28 (0x28)


}; 
 
 


// Class DungeonCrawler.DCGlitterComponent
// Size: 0x128(Inherited: 0xA0)
struct UDCGlitterComponent : UActorComponent
{
	char pad_160[88];  // 0xA0 (0xA0)
	float DurationSeconds;  // 0xF8 (0xF8)
	float IntervalSeconds;  // 0xFC (0xFC)
	float StartPos;  // 0x100 (0x100)
	char pad_260_1 : 7;  // 0x104 (0x104)
	bool bIsEnabled : 1;  // 0x104 (0x104)
	char pad_261[3];  // 0x105 (0x105)
	struct TArray<struct UMaterialInstanceDynamic*> DynamicMaterials;  // 0x108 (0x108)
	char pad_280[16];  // 0x118 (0x118)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCGlitterComponent.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCGlitterComponent.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCGlitterComponent.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCGlitterComponent.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.GA_MusicBase
// Size: 0x6D0(Inherited: 0x558)
struct UGA_MusicBase : UDCGameplayAbilityBase
{
	struct FGameplayEventData CurrentTriggerData;  // 0x558 (0x558)
	struct FGameplayTag GameplayCueTagOnTarget;  // 0x608 (0x608)
	struct FDesignDataMusic DesignDataMusic;  // 0x610 (0x610)


	void OnApplied(struct AActor* InTarget); // Function DungeonCrawler.GA_MusicBase.OnApplied
	float GetRange(); // Function DungeonCrawler.GA_MusicBase.GetRange
	void ApplyToTarget(struct FHitResult& HitResult); // Function DungeonCrawler.GA_MusicBase.ApplyToTarget
	void ApplyToSelf(); // Function DungeonCrawler.GA_MusicBase.ApplyToSelf
	void AbilityActivated(struct FGameplayEventData TriggerEventData); // Function DungeonCrawler.GA_MusicBase.AbilityActivated
}; 
 
 


// Class DungeonCrawler.CharacterSelectCharacterSlotWidgetData
// Size: 0xC8(Inherited: 0x28)
struct UCharacterSelectCharacterSlotWidgetData : UObject
{
	struct FCharacterSlot CharacterSlot;  // 0x28 (0x28)
	char pad_192_1 : 7;  // 0xC0 (0xC0)
	bool bCanSelect : 1;  // 0xC0 (0xC0)
	char pad_193[7];  // 0xC1 (0xC1)


}; 
 
 


// Class DungeonCrawler.CharacterSelectGroupWidgetBase
// Size: 0x320(Inherited: 0x300)
struct UCharacterSelectGroupWidgetBase : UDCWidgetBase
{
	uint8_t WidgetCharacterSelectGroupType;  // 0x300 (0x300)
	char pad_769[7];  // 0x301 (0x301)
	struct TArray<uint8_t> NonCoexistWidgetCharacterSelectGroupTypeArray;  // 0x308 (0x308)
	char pad_792[8];  // 0x318 (0x318)


}; 
 
 


// Class DungeonCrawler.CannotMoveGameplayTagData
// Size: 0x50(Inherited: 0x30)
struct UCannotMoveGameplayTagData : UDataAsset
{
	struct FGameplayTagContainer TagContainer;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.CommonButtonXLWidget
// Size: 0x1580(Inherited: 0x1580)
struct UCommonButtonXLWidget : UDCCommonButtonBase
{


	void SetAllText(struct FText TextTitle); // Function DungeonCrawler.CommonButtonXLWidget.SetAllText
}; 
 
 


// Class DungeonCrawler.DCPlayerCharMovementComponent
// Size: 0xF50(Inherited: 0xF40)
struct UDCPlayerCharMovementComponent : UDCCharacterMovementComponent
{
	char pad_3904[16];  // 0xF40 (0xF40)


}; 
 
 


// Class DungeonCrawler.DescDataAbility
// Size: 0x50(Inherited: 0x50)
struct UDescDataAbility : UDescData
{


}; 
 
 


// Class DungeonCrawler.CharacterSelectWidget
// Size: 0x488(Inherited: 0x440)
struct UCharacterSelectWidget : UDCCommonActivatableWidgetBase
{
	struct UCharacterSelectCharListWidget* CharacterSelectCharListWidget;  // 0x440 (0x440)
	int32_t AccountBluestoneShardValue;  // 0x448 (0x448)
	int32_t AccountRedstoneShardValue;  // 0x44C (0x44C)
	struct UCommonButtonLWidget* WB_Btn_Purchase;  // 0x450 (0x450)
	struct UDCCommonButtonBase* WB_Btn_LaunchShopURL;  // 0x458 (0x458)
	uint8_t SelectedCharacterClass;  // 0x460 (0x460)
	char pad_1121[7];  // 0x461 (0x461)
	struct FDCClassPackageShopItemInfo SelectedShopInfo;  // 0x468 (0x468)
	char pad_1152[8];  // 0x480 (0x480)


	void OnPurchaseButtonClicked(); // Function DungeonCrawler.CharacterSelectWidget.OnPurchaseButtonClicked
	void OnLaunchShopURLButtonClicked(); // Function DungeonCrawler.CharacterSelectWidget.OnLaunchShopURLButtonClicked
	bool IsNeedPurchase(); // Function DungeonCrawler.CharacterSelectWidget.IsNeedPurchase
	void HandleOptionButtonClicked(); // Function DungeonCrawler.CharacterSelectWidget.HandleOptionButtonClicked
	void HandleLobbyButtonClicked(); // Function DungeonCrawler.CharacterSelectWidget.HandleLobbyButtonClicked
	void HandleExitButtonClicked(); // Function DungeonCrawler.CharacterSelectWidget.HandleExitButtonClicked
	int32_t GetPrice(); // Function DungeonCrawler.CharacterSelectWidget.GetPrice
	int32_t GetCashPrice(); // Function DungeonCrawler.CharacterSelectWidget.GetCashPrice
	bool CanLaunchRedstoneShardShop(); // Function DungeonCrawler.CharacterSelectWidget.CanLaunchRedstoneShardShop
	bool CanEnterLobby(); // Function DungeonCrawler.CharacterSelectWidget.CanEnterLobby
}; 
 
 


// Class DungeonCrawler.DCClassPackageShopDataAsset
// Size: 0xA8(Inherited: 0x78)
struct UDCClassPackageShopDataAsset : UDCShopDataAsset
{
	struct TSoftObjectPtr<UDCPlayerCharacterDataAsset> StockData;  // 0x78 (0x78)


}; 
 
 


// Class DungeonCrawler.CharacterStatusDetailWidget
// Size: 0xC38(Inherited: 0x300)
struct UCharacterStatusDetailWidget : UDCWidgetBase
{
	struct FCharacterStatusDetailWidgetData WidgetData;  // 0x300 (0x300)
	struct UAccountLink* AccountLink;  // 0xA88 (0xA88)
	char pad_2704[336];  // 0xA90 (0xA90)
	struct FString LinkedAccountId;  // 0xBE0 (0xBE0)
	struct FString CheckTargetAccountId;  // 0xBF0 (0xBF0)
	struct UCurveTable* CurveTablePhysicalPower;  // 0xC00 (0xC00)
	struct UCurveTable* CurveTableArmorRating;  // 0xC08 (0xC08)
	struct UCurveTable* CurveTableMagicalPower;  // 0xC10 (0xC10)
	struct UCurveTable* CurveTableMagicResistance;  // 0xC18 (0xC18)
	char pad_3104[24];  // 0xC20 (0xC20)


	void OnWill(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWill
	void OnWeightLimitMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWeightLimitMod
	void OnWeightLimitBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWeightLimitBase
	void OnWeightLimitAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWeightLimitAdd
	void OnWeightLimit(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWeightLimit
	void OnWeight(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWeight
	void OnWaterMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWaterMagicResistance
	void OnWaterMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWaterMagicalReductionMod
	void OnWaterMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWaterMagicalReductionMagicResistance
	void OnWaterMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnWaterMagicalReduction
	void OnUtilityEffectivenessMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnUtilityEffectivenessMod
	void OnUtilityEffectivenessBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnUtilityEffectivenessBase
	void OnUtilityEffectivenessAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnUtilityEffectivenessAdd
	void OnUtilityEffectiveness(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnUtilityEffectiveness
	void OnStrength(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnStrength
	void OnSpiritMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpiritMagicResistance
	void OnSpiritMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpiritMagicalReductionMod
	void OnSpiritMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpiritMagicalReductionMagicResistance
	void OnSpiritMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpiritMagicalReduction
	void OnSpellPayload(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpellPayload
	void OnSpellCastingSpeed(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpellCastingSpeed
	void OnSpellCapacityMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpellCapacityMod
	void OnSpellCapacityBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpellCapacityBase
	void OnSpellCapacityAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpellCapacityAdd
	void OnSpellCapacity(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSpellCapacity
	void OnSecondaryWeaponImpactPower(float& NewValue, float& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSecondaryWeaponImpactPower
	void OnSecondaryAbilityWidgetArray(struct TArray<struct UItemTooltipStatWidgetData*>& NewValue, struct TArray<struct UItemTooltipStatWidgetData*>& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnSecondaryAbilityWidgetArray
	void OnResourcefulness(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnResourcefulness
	void OnRegularInteractionSpeedBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnRegularInteractionSpeedBase
	void OnRegularInteractionSpeed(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnRegularInteractionSpeed
	void OnProjectileReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnProjectileReductionMod
	void OnPrimaryWeaponImpactPower(float& NewValue, float& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPrimaryWeaponImpactPower
	void OnPrimaryAbilityWidgetArray(struct TArray<struct UItemTooltipStatWidgetData*>& NewValue, struct TArray<struct UItemTooltipStatWidgetData*>& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPrimaryAbilityWidgetArray
	void OnPhysicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalReductionMod
	void OnPhysicalReductionBonus(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalReductionBonus
	void OnPhysicalReductionArmorRating(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalReductionArmorRating
	void OnPhysicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalReduction
	void OnPhysicalPower(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalPower
	void OnPhysicalHealMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalHealMod
	void OnPhysicalHealBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalHealBase
	void OnPhysicalHeadshotPenetration(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalHeadshotPenetration
	void OnPhysicalDamageWeaponSecondary(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalDamageWeaponSecondary
	void OnPhysicalDamageWeaponPrimary(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalDamageWeaponPrimary
	void OnPhysicalDamageTrue(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalDamageTrue
	void OnPhysicalDamageModPhysicalPower(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalDamageModPhysicalPower
	void OnPhysicalDamageModBonus(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalDamageModBonus
	void OnPhysicalDamageMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalDamageMod
	void OnPhysicalDamageBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalDamageBase
	void OnPhysicalDamageAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnPhysicalDamageAdd
	void OnMoveSpeedWithModifier(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMoveSpeedWithModifier
	void OnMoveSpeedMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMoveSpeedMod
	void OnMoveSpeedBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMoveSpeedBase
	void OnMoveSpeedAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMoveSpeedAdd
	void OnMoveSpeed(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMoveSpeed
	void OnMaxHealthMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMaxHealthMod
	void OnMaxHealthBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMaxHealthBase
	void OnMaxHealthAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMaxHealthAdd
	void OnMaxHealth(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMaxHealth
	void OnMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicResistance
	void OnMagicPenetration(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicPenetration
	void OnMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalReductionMod
	void OnMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalReductionMagicResistance
	void OnMagicalReductionBonus(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalReductionBonus
	void OnMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalReduction
	void OnMagicalPower(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalPower
	void OnMagicalInteractionSpeed(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalInteractionSpeed
	void OnMagicalHealMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalHealMod
	void OnMagicalHealBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalHealBase
	void OnMagicalDamageTrue(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalDamageTrue
	void OnMagicalDamageModMagicalPower(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalDamageModMagicalPower
	void OnMagicalDamageModBonus(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalDamageModBonus
	void OnMagicalDamageMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalDamageMod
	void OnMagicalDamageBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalDamageBase
	void OnMagicalDamageAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnMagicalDamageAdd
	void OnLuck(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnLuck
	void OnLightningMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnLightningMagicResistance
	void OnLightningMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnLightningMagicalReductionMod
	void OnLightningMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnLightningMagicalReductionMagicResistance
	void OnLightningMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnLightningMagicalReduction
	void OnLightMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnLightMagicResistance
	void OnLightMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnLightMagicalReductionMod
	void OnLightMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnLightMagicalReductionMagicResistance
	void OnLightMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnLightMagicalReduction
	void OnKnowledge(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnKnowledge
	void OnItemEquipSpeed(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnItemEquipSpeed
	void OnImpactPower(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnImpactPower
	void OnHealth(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnHealth
	void OnHeadshotReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnHeadshotReductionMod
	void OnFireMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnFireMagicResistance
	void OnFireMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnFireMagicalReductionMod
	void OnFireMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnFireMagicalReductionMagicResistance
	void OnFireMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnFireMagicalReduction
	void OnEvilMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnEvilMagicResistance
	void OnEvilMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnEvilMagicalReductionMod
	void OnEvilMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnEvilMagicalReductionMagicResistance
	void OnEvilMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnEvilMagicalReduction
	void OnEarthMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnEarthMagicResistance
	void OnEarthMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnEarthMagicalReductionMod
	void OnEarthMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnEarthMagicalReductionMagicResistance
	void OnEarthMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnEarthMagicalReduction
	void OnDivineMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnDivineMagicResistance
	void OnDivineMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnDivineMagicalReductionMod
	void OnDivineMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnDivineMagicalReductionMagicResistance
	void OnDivineMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnDivineMagicalReduction
	void OnDebuffDurationMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnDebuffDurationMod
	void OnDarkMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnDarkMagicResistance
	void OnDarkMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnDarkMagicalReductionMod
	void OnDarkMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnDarkMagicalReductionMagicResistance
	void OnDarkMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnDarkMagicalReduction
	void OnBuffDurationMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnBuffDurationMod
	void OnArmorRating(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnArmorRating
	void OnArmorPenetration(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnArmorPenetration
	void OnArcaneMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnArcaneMagicResistance
	void OnArcaneMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnArcaneMagicalReductionMod
	void OnArcaneMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnArcaneMagicalReductionMagicResistance
	void OnArcaneMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnArcaneMagicalReduction
	void OnAirMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnAirMagicResistance
	void OnAirMagicalReductionMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnAirMagicalReductionMod
	void OnAirMagicalReductionMagicResistance(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnAirMagicalReductionMagicResistance
	void OnAirMagicalReduction(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnAirMagicalReduction
	void OnAgility(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnAgility
	void OnActionSpeed(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusDetailWidget.OnActionSpeed
}; 
 
 


// Class DungeonCrawler.GA_MusicInstantBase
// Size: 0x6D0(Inherited: 0x6D0)
struct UGA_MusicInstantBase : UGA_MusicBase
{


	void OnTargetActorOverlap(struct TArray<struct AActor*>& InTargetActors); // Function DungeonCrawler.GA_MusicInstantBase.OnTargetActorOverlap
}; 
 
 


// Class DungeonCrawler.CharacterStatusWidget
// Size: 0x4B0(Inherited: 0x300)
struct UCharacterStatusWidget : UDCWidgetBase
{
	struct FCharacterStatusWidgetData WidgetData;  // 0x300 (0x300)
	struct UAccountLink* AccountLink;  // 0x480 (0x480)
	char pad_1160[8];  // 0x488 (0x488)
	struct FString LinkedAccountId;  // 0x490 (0x490)
	struct FString CheckTargetAccountId;  // 0x4A0 (0x4A0)


	void OnWill(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnWill
	void OnWeightLimitMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnWeightLimitMod
	void OnWeightLimitBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnWeightLimitBase
	void OnWeightLimitAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnWeightLimitAdd
	void OnWeightLimit(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnWeightLimit
	void OnWeight(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnWeight
	void OnUtilityEffectivenessMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnUtilityEffectivenessMod
	void OnUtilityEffectivenessBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnUtilityEffectivenessBase
	void OnUtilityEffectivenessAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnUtilityEffectivenessAdd
	void OnUtilityEffectiveness(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnUtilityEffectiveness
	void OnStrength(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnStrength
	void OnSpellPayload(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnSpellPayload
	void OnSpellCapacityMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnSpellCapacityMod
	void OnSpellCapacityBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnSpellCapacityBase
	void OnSpellCapacityAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnSpellCapacityAdd
	void OnSpellCapacity(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnSpellCapacity
	void OnResourcefulness(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnResourcefulness
	void OnMaxHealthMod(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnMaxHealthMod
	void OnMaxHealthBase(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnMaxHealthBase
	void OnMaxHealthAdd(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnMaxHealthAdd
	void OnMaxHealth(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnMaxHealth
	void OnKnowledge(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnKnowledge
	void OnHealth(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnHealth
	void OnAgility(struct FGameplayAttributeData& NewValue, struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.CharacterStatusWidget.OnAgility
}; 
 
 


// Class DungeonCrawler.DCAT_RotateToActor
// Size: 0x98(Inherited: 0x80)
struct UDCAT_RotateToActor : UAbilityTask
{
	char pad_128[24];  // 0x80 (0x80)


	struct UDCAT_RotateToActor* RotateToActor(struct UGameplayAbility* OwningAbility, struct AActor* Actor, uint8_t HitBox, float Speed, bool WithoutPitch); // Function DungeonCrawler.DCAT_RotateToActor.RotateToActor
}; 
 
 


// Class DungeonCrawler.ChatEditWidgetBase
// Size: 0x378(Inherited: 0x300)
struct UChatEditWidgetBase : UDCWidgetBase
{
	struct URichTextBlock* RichTextBlock;  // 0x300 (0x300)
	struct UDCEditableText* EditableText;  // 0x308 (0x308)
	char pad_784[104];  // 0x310 (0x310)


	void OnTextCommitted(struct FText& InText, enum class ETextCommit InCommitMethod); // Function DungeonCrawler.ChatEditWidgetBase.OnTextCommitted
	void OnTextChanged(struct FText& InText); // Function DungeonCrawler.ChatEditWidgetBase.OnTextChanged
}; 
 
 


// Class DungeonCrawler.ChatFilterListEntryWidgetObject
// Size: 0x58(Inherited: 0x28)
struct UChatFilterListEntryWidgetObject : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	struct FGameplayTag ChatFilterTag;  // 0x30 (0x30)
	struct FText ChatFilterText;  // 0x38 (0x38)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool bChecked : 1;  // 0x50 (0x50)
	char pad_81[7];  // 0x51 (0x51)


}; 
 
 


// Class DungeonCrawler.DCDamageIndicatorComponent
// Size: 0xB8(Inherited: 0xA0)
struct UDCDamageIndicatorComponent : UActorComponent
{
	struct FVector IsZeroLocationByOffset;  // 0xA0 (0xA0)


}; 
 
 


// Class DungeonCrawler.TagQueryData
// Size: 0xC8(Inherited: 0x38)
struct UTagQueryData : UDCDataAssetBase
{
	struct FGameplayTagQuery SourceTagQuery;  // 0x38 (0x38)
	struct FGameplayTagQuery TargetTagQuery;  // 0x80 (0x80)


}; 
 
 


// Class DungeonCrawler.ChatFilterListEntryWidget
// Size: 0x330(Inherited: 0x300)
struct UChatFilterListEntryWidget : UDCWidgetBase
{
	char pad_768[8];  // [x300 ([x300)
	struct UCheckBox* FilterCheckBox;  // 0x308 (0x308)
	char pad_784[8];  // 0x310 (0x310)
	struct FText ChatFilterText;  // 0x318 (0x318)


	void OnCheckStateChanged(bool bIsChecked); // Function DungeonCrawler.ChatFilterListEntryWidget.OnCheckStateChanged
}; 
 
 


// Class DungeonCrawler.DCAbilityActorBase
// Size: 0x300(Inherited: 0x2F0)
struct ADCAbilityActorBase : ADCActorBase
{
	char pad_752[8];  // 0x2F0 (0x2F0)
	struct UAbilitySystemComponent* AbilitySystemComponent;  // 0x2F8 (0x2F8)


}; 
 
 


// Class DungeonCrawler.DCWeaponEquipmentSlot
// Size: 0x40(Inherited: 0x38)
struct UDCWeaponEquipmentSlot : UDCEquipmentSlot
{
	struct UDCWeaponEquipmentSlot* PairSlot;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.DCGameModeAIControllerDungeonBase
// Size: 0x430(Inherited: 0x430)
struct ADCGameModeAIControllerDungeonBase : ADCGameModeAIControllerGameBase
{


}; 
 
 


// Class DungeonCrawler.ChatFilterWidget
// Size: 0x370(Inherited: 0x300)
struct UChatFilterWidget : UDCWidgetBase
{
	struct UListView* ChatFilterListView;  // 0x300 (0x300)
	struct UEditableText* EditableSearchText;  // 0x308 (0x308)
	char pad_784[80];  // 0x310 (0x310)
	struct TArray<struct UChatFilterListEntryWidgetObject*> ChatFilterListWidgetObjectArray;  // 0x360 (0x360)


	void SetChatFilterListVisible(bool InbVisible); // Function DungeonCrawler.ChatFilterWidget.SetChatFilterListVisible
	void ResetChatFilter(); // Function DungeonCrawler.ChatFilterWidget.ResetChatFilter
	void RegenerateListItems(struct FText& FindFilter); // Function DungeonCrawler.ChatFilterWidget.RegenerateListItems
}; 
 
 


// Class DungeonCrawler.ClassSelectWidget
// Size: 0x338(Inherited: 0x300)
struct UClassSelectWidget : UDCWidgetBase
{
	struct UTileView* ClassSelectTileView;  // 0x300 (0x300)
	struct UTileView* ClassAttributeTileView;  // 0x308 (0x308)
	struct UListView* ClassPerkTileView;  // 0x310 (0x310)
	struct UButton* ClassSelectButton;  // 0x318 (0x318)
	char pad_800[16];  // 0x320 (0x320)
	struct UAccountLink* AccountLink;  // 0x330 (0x330)


	void OnPlayerCharacterId(struct FPrimaryAssetId& NewValue, struct FPrimaryAssetId& OldValue); // Function DungeonCrawler.ClassSelectWidget.OnPlayerCharacterId
	void OnClassSelectButtonClicked(); // Function DungeonCrawler.ClassSelectWidget.OnClassSelectButtonClicked
}; 
 
 


// Class DungeonCrawler.ChatWidgetBase
// Size: 0x398(Inherited: 0x300)
struct UChatWidgetBase : UDCWidgetBase
{
	char pad_768[16];  // 0x300 (0x300)
	struct UChatWidgetData* ChatWidgetData;  // 0x310 (0x310)
	char pad_792[128];  // 0x318 (0x318)


	void OnRightClicked(); // Function DungeonCrawler.ChatWidgetBase.OnRightClicked
	void OnChatRecordData(struct FChatRecord& NewValue, struct FChatRecord& OldValue); // Function DungeonCrawler.ChatWidgetBase.OnChatRecordData
	struct FString FilterStreamingMode(struct FString OriginalStr); // Function DungeonCrawler.ChatWidgetBase.FilterStreamingMode
}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationMaxHealth
// Size: 0x100(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationMaxHealth : UGameplayModMagnitudeCalculation
{
	char pad_64[192];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCItemSkinViewerActor
// Size: 0x3C0(Inherited: 0x2F0)
struct ADCItemSkinViewerActor : ADCActorBase
{
	float StartRotateLocation;  // 0x2F0 (0x2F0)
	float RotateSpeed;  // 0x2F4 (0x2F4)
	char pad_760[8];  // 0x2F8 (0x2F8)
	struct FTransform PreviewCameraDefaultTransform;  // 0x300 (0x300)
	struct UDCSceneCaptureComponent2D* SceneCaptureComponent;  // 0x360 (0x360)
	struct UChildActorComponent* PreviewHolderComponent;  // 0x368 (0x368)
	struct TMap<struct FPrimaryAssetId, struct UDCItemSkinArtData*> ItemSkinViewTargetMap;  // 0x370 (0x370)


}; 
 
 


// Class DungeonCrawler.ClassGroupWidgetBase
// Size: 0x460(Inherited: 0x440)
struct UClassGroupWidgetBase : UDCCommonActivatableWidgetBase
{
	uint8_t WidgetClassGroupType;  // 0x440 (0x440)
	char pad_1089[7];  // 0x441 (0x441)
	struct TArray<uint8_t> NonCoexistWidgetWidgetClassGroupTypeArray;  // 0x448 (0x448)
	char pad_1112[8];  // 0x458 (0x458)


}; 
 
 


// Class DungeonCrawler.ItemTooltipWidget
// Size: 0x3A0(Inherited: 0x300)
struct UItemTooltipWidget : UDCWidgetBase
{
	struct FItemTooltipWidgetData WidgetData;  // 0x300 (0x300)


	void SetItemData(struct FItemData& NewItemData); // Function DungeonCrawler.ItemTooltipWidget.SetItemData
	void OnRefreshItemName(); // Function DungeonCrawler.ItemTooltipWidget.OnRefreshItemName
	void OnItemData(struct FItemData& NewItemData, struct FItemData& OldItemData); // Function DungeonCrawler.ItemTooltipWidget.OnItemData
}; 
 
 


// Class DungeonCrawler.ClassIconWidgetData
// Size: 0x158(Inherited: 0x28)
struct UClassIconWidgetData : UObject
{
	int32_t ItemIndex;  // 0x28 (0x28)
	struct FPrimaryAssetId CharacterClassId;  // 0x2C (0x2C)
	char pad_60[4];  // 0x3C (0x3C)
	struct FDesignDataPlayerCharacter DesignDataPlayerCharacter;  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.ContainerInventoryWidget
// Size: 0x408(Inherited: 0x300)
struct UContainerInventoryWidget : UDCWidgetBase
{
	struct UGridPanel* ContainerSlotGridPanel;  // 0x300 (0x300)
	struct UOverlay* ContainerItemOvelay;  // 0x308 (0x308)
	UContainerSlotWidget* ContainerSlotWidgetClass;  // 0x310 (0x310)
	float ContainerSlotSize;  // 0x318 (0x318)
	char pad_796[4];  // 0x31C (0x31C)
	struct TMap<int32_t, struct FContainerSlotArrayData> ContainerSlotWidgetMap;  // 0x320 (0x320)
	struct TWeakObjectPtr<UInventoryComponent> InventoryComponent;  // 0x370 (0x370)
	UItemWidget* ItemWidgetClass;  // 0x378 (0x378)
	struct UAccountLink* AccountLink;  // 0x380 (0x380)
	struct FPrimaryAssetId PlayerCharacterId;  // 0x388 (0x388)
	struct TMap<int64_t, struct UItemWidget*> ItemWidgetMap;  // 0x398 (0x398)
	int32_t ContainerRowCount;  // 0x3E8 (0x3E8)
	int32_t ContainerColumnCount;  // 0x3EC (0x3EC)
	int32_t DragDetectedContainerSlotId;  // 0x3F0 (0x3F0)
	char pad_1012[4];  // 0x3F4 (0x3F4)
	struct TArray<struct UContainerSlotWidget*> OverlapContainerSlots;  // 0x3F8 (0x3F8)


	void UpdateItemCanBeSet(struct FItemData& InItemData, int32_t SlotId); // Function DungeonCrawler.ContainerInventoryWidget.UpdateItemCanBeSet
	void OnRemoveItem(struct FItemData& InItemData); // Function DungeonCrawler.ContainerInventoryWidget.OnRemoveItem
	void OnMoveItem(struct FItemData& OldItemData, struct FItemData& NewItemData); // Function DungeonCrawler.ContainerInventoryWidget.OnMoveItem
	void OnItemWidgetDropOrLeave(); // Function DungeonCrawler.ContainerInventoryWidget.OnItemWidgetDropOrLeave
	void OnItemDragDetected(struct FItemData& ItemData, struct FVector2D& DragScreenPos); // Function DungeonCrawler.ContainerInventoryWidget.OnItemDragDetected
	struct UItemWidget* OnAddItem(struct FItemData& InItemData); // Function DungeonCrawler.ContainerInventoryWidget.OnAddItem
	void InitializeContainerInventoryWidget(struct UInventoryComponent* InInventoryComponent, struct UAccountLink* InAccountLink); // Function DungeonCrawler.ContainerInventoryWidget.InitializeContainerInventoryWidget
	int32_t GetSlotIdByScreenPosition(struct FVector2D& ScreenPos); // Function DungeonCrawler.ContainerInventoryWidget.GetSlotIdByScreenPosition
	bool CanSetItemAt(struct FItemData& ItemData, int32_t SlotId); // Function DungeonCrawler.ContainerInventoryWidget.CanSetItemAt
}; 
 
 


// Class DungeonCrawler.ClassIconWidget
// Size: 0x308(Inherited: 0x300)
struct UClassIconWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)


	void OnClickedClassIconButton(); // Function DungeonCrawler.ClassIconWidget.OnClickedClassIconButton
}; 
 
 


// Class DungeonCrawler.ClassMusicEquippedWidget
// Size: 0x440(Inherited: 0x440)
struct UClassMusicEquippedWidget : UDCCommonActivatableWidgetBase
{


}; 
 
 


// Class DungeonCrawler.MiniMapData
// Size: 0x88(Inherited: 0x38)
struct UMiniMapData : UDCDataAssetBase
{
	struct TMap<struct FString, struct FDCMiniMapDataContainer> MiniMapData;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.DCCustomizeWidgetBase
// Size: 0x308(Inherited: 0x300)
struct UDCCustomizeWidgetBase : UDCWidgetBase
{
	struct UDCTabListWidgetBase* CustomizeTabList;  // 0x300 (0x300)


	void OnCustomizeWidgetOpen(); // Function DungeonCrawler.DCCustomizeWidgetBase.OnCustomizeWidgetOpen
	void OnCustomizeWidgetClose(); // Function DungeonCrawler.DCCustomizeWidgetBase.OnCustomizeWidgetClose
	void AnyTabButtonSelected(struct FName InTabButtonId); // Function DungeonCrawler.DCCustomizeWidgetBase.AnyTabButtonSelected
}; 
 
 


// Class DungeonCrawler.GameMenuOptionSliderWidget
// Size: 0x330(Inherited: 0x300)
struct UGameMenuOptionSliderWidget : UDCWidgetBase
{
	struct FMulticastInlineDelegate OnSliderValueChanged;  // 0x300 (0x300)
	struct UTextBlock* Title;  // 0x310 (0x310)
	float CurValue;  // 0x318 (0x318)
	float CurPerValue;  // 0x31C (0x31C)
	float MinValue;  // 0x320 (0x320)
	float MaxValue;  // 0x324 (0x324)
	float StepSize;  // 0x328 (0x328)
	char pad_812[4];  // 0x32C (0x32C)


	void UpdateSliderValue(float NewValue); // Function DungeonCrawler.GameMenuOptionSliderWidget.UpdateSliderValue
	void UpdateSliderMinMaxValue(); // Function DungeonCrawler.GameMenuOptionSliderWidget.UpdateSliderMinMaxValue
	void SetTitle(struct FText InText); // Function DungeonCrawler.GameMenuOptionSliderWidget.SetTitle
	void SetSliderMinMaxValue(float InMinValue, float InMaxValue, float InStepSize); // Function DungeonCrawler.GameMenuOptionSliderWidget.SetSliderMinMaxValue
	void SetOptionValue(float InValue); // Function DungeonCrawler.GameMenuOptionSliderWidget.SetOptionValue
	struct UWidget* GetPrimaryGamepadFocusWidget(); // Function DungeonCrawler.GameMenuOptionSliderWidget.GetPrimaryGamepadFocusWidget
	float GetOptionValuePercent(); // Function DungeonCrawler.GameMenuOptionSliderWidget.GetOptionValuePercent
	float GetOptionValue(); // Function DungeonCrawler.GameMenuOptionSliderWidget.GetOptionValue
	void GetCurrentOptionValueByPercent(); // Function DungeonCrawler.GameMenuOptionSliderWidget.GetCurrentOptionValueByPercent
	void GetCurrentOptionValue(); // Function DungeonCrawler.GameMenuOptionSliderWidget.GetCurrentOptionValue
	struct FString ExtractOnlyNumberics(struct FString Message, bool IsInteger); // Function DungeonCrawler.GameMenuOptionSliderWidget.ExtractOnlyNumberics
}; 
 
 


// Class DungeonCrawler.GameGroupWidgetBase
// Size: 0x460(Inherited: 0x440)
struct UGameGroupWidgetBase : UDCCommonActivatableWidgetBase
{
	char pad_1088_1 : 7;  // 0x440 (0x440)
	bool bShowCursor : 1;  // 0x440 (0x440)
	uint8_t WidgetGameGroupType;  // 0x441 (0x441)
	char pad_1090[6];  // 0x442 (0x442)
	struct TArray<uint8_t> NonCoexistWidgetGameGroupTypeArray;  // 0x448 (0x448)
	char pad_1112[8];  // 0x458 (0x458)


	void OnVisible(); // Function DungeonCrawler.GameGroupWidgetBase.OnVisible
	void OnHidden(); // Function DungeonCrawler.GameGroupWidgetBase.OnHidden
	void OnGroupWidgetVisibilityChanged(uint8_t NewVisibility); // Function DungeonCrawler.GameGroupWidgetBase.OnGroupWidgetVisibilityChanged
}; 
 
 


// Class DungeonCrawler.DCTargetType_UseEventData
// Size: 0x28(Inherited: 0x28)
struct UDCTargetType_UseEventData : UDCTargetType
{


}; 
 
 


// Class DungeonCrawler.MusicListWidgetBase
// Size: 0x4A0(Inherited: 0x460)
struct UMusicListWidgetBase : UGameGroupWidgetBase
{
	struct UMusicSlotWidgetBase* MusicSlot_2;  // 0x460 (0x460)
	struct UMusicSlotWidgetBase* MusicSlot_3;  // 0x468 (0x468)
	struct UMusicSlotWidgetBase* MusicSlot_4;  // 0x470 (0x470)
	struct UMusicSlotWidgetBase* MusicSlot_5;  // 0x478 (0x478)
	struct UMusicSlotWidgetBase* MusicSlot_6;  // 0x480 (0x480)
	struct TArray<struct UMusicSlotWidgetBase*> MusicSlots;  // 0x488 (0x488)
	uint8_t WidgetSlotType;  // 0x498 (0x498)
	char pad_1177[7];  // 0x499 (0x499)


}; 
 
 


// Class DungeonCrawler.DCLobbyEmoteComponent
// Size: 0x138(Inherited: 0xA0)
struct UDCLobbyEmoteComponent : UActorComponent
{
	char pad_160[24];  // 0xA0 (0xA0)
	struct TArray<struct FDCLobbyEmoteSlotInfo> LobbyEmoteSlotInfoArray;  // 0xB8 (0xB8)
	struct TMap<int32_t, struct FPrimaryAssetId> LobbyEmoteSlotMap;  // 0xC8 (0xC8)
	struct TArray<struct FGameplayAbilitySpecHandle> OwnerGameplayAbilitySpecHandles;  // 0x118 (0x118)
	struct TArray<struct FActiveGameplayEffectHandle> OwnerGameplayEffectHandles;  // 0x128 (0x128)


}; 
 
 


// Class DungeonCrawler.SubSystemReplyMsg
// Size: 0x48(Inherited: 0x28)
struct USubSystemReplyMsg : UObject
{
	char pad_40[24];  // 0x28 (0x28)
	float CreateAt;  // 0x40 (0x40)
	char pad_68[4];  // 0x44 (0x44)


}; 
 
 


// Class DungeonCrawler.DCCharacterV2
// Size: 0x6B0(Inherited: 0x620)
struct ADCCharacterV2 : ACharacter
{
	char pad_1568[8];  // 0x620 (0x620)
	struct USkeletalMeshComponent* PartHead;  // 0x628 (0x628)
	struct USkeletalMeshComponent* PartGloves;  // 0x630 (0x630)
	struct FDCPlayerCharacterKey CharacterKey;  // 0x638 (0x638)
	char pad_1594[6];  // 0x63A (0x63A)
	struct USkeletalMeshComponent* PartHelmet;  // 0x640 (0x640)
	struct USkeletalMeshComponent* PartChest;  // 0x648 (0x648)
	struct USkeletalMeshComponent* PartPants;  // 0x650 (0x650)
	struct USkeletalMeshComponent* PartBoots;  // 0x658 (0x658)
	struct USkeletalMeshComponent* PartBack;  // 0x660 (0x660)
	struct UDCCharacterDataComponent* CharacterDataComponent;  // 0x668 (0x668)
	struct UDCCharacterPartsComponent* CharacterPartsComponent;  // 0x670 (0x670)
	struct UDCCharacterSkinComponent* CharacterSkinComponent;  // 0x678 (0x678)
	struct UDCItemSkinComponent* ItemSkinComponent;  // 0x680 (0x680)
	struct UDCActionSkinComponent* ActionSkinComponent;  // 0x688 (0x688)
	struct UDCInventoryComponent* InventoryComponent;  // 0x690 (0x690)
	struct UDCEquipmentComponent* EquipmentComponent;  // 0x698 (0x698)
	struct UDCPerkDataComponent* PerkDataComponent;  // 0x6A0 (0x6A0)
	struct UDCCharacterAbilitySystemComponent* AbilitySystemComponent;  // 0x6A8 (0x6A8)


	struct UDCPerkDataComponent* GetPerkDataComponent(); // Function DungeonCrawler.DCCharacterV2.GetPerkDataComponent
}; 
 
 


// Class DungeonCrawler.DCIngameInventoryControllerComponent
// Size: 0xC0(Inherited: 0xC0)
struct UDCIngameInventoryControllerComponent : UDCInventoryControllerComponent
{


}; 
 
 


// Class DungeonCrawler.DCPlayerCharacterAnimInstanceBase
// Size: 0x5B0(Inherited: 0x4E0)
struct UDCPlayerCharacterAnimInstanceBase : UDCCharacterAnimInstanceBase
{
	char pad_1248_1 : 7;  // 0x4E0 (0x4E0)
	bool bHoldingTwoHandedItem : 1;  // 0x4D8 (0x4D8)
	char pad_1249_1 : 7;  // 0x4E1 (0x4E1)
	bool bIsInFirstPersonPerspective : 1;  // 0x4D9 (0x4D9)
	char pad_1250_1 : 7;  // 0x4E2 (0x4E2)
	bool bIsMontageLooping : 1;  // 0x4DA (0x4DA)
	float JumpStateMachineRemainAnimTimeRatio;  // 0x4DC (0x4DC)
	float LocomotionStateMachineRemainAnimTimeRatio;  // 0x4E0 (0x4E0)
	struct USkeletalMesh* HeadMeshAsset;  // 0x4E8 (0x4E8)
	struct FLocomotionAnimSet ItemAnimationSet;  // 0x4F0 (0x4F0)
	struct FLocomotionAnimSet SecondaryItemAnimationSet;  // 0x508 (0x508)
	struct FGameplayTagContainer PrimaryMontageTagContainer;  // 0x520 (0x520)
	struct FGameplayTagContainer SecondaryMontageTagContainer;  // 0x540 (0x540)
	struct FGameplayTagContainer TwoHandedMontageTagContainer;  // 0x560 (0x560)
	struct TArray<struct FName> LoopSectionNames;  // 0x580 (0x580)
	struct FName JumpStateMachineName;  // 0x590 (0x590)
	struct FName LocomotionStateMachineName;  // 0x598 (0x598)
	char pad_1443[13];  // 0x5A3 (0x5A3)


}; 
 
 


// Class DungeonCrawler.LoginSecretTokenPopupData
// Size: 0x40(Inherited: 0x30)
struct ULoginSecretTokenPopupData : UPopupDataBase
{
	struct FString SecretToken;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.GA_PickUp
// Size: 0x568(Inherited: 0x558)
struct UGA_PickUp : UDCGameplayAbilityBase
{
	char pad_1368[16];  // 0x558 (0x558)


	void OnStartSync(); // Function DungeonCrawler.GA_PickUp.OnStartSync
	void OnPickedUp(struct AActor* ItemHolderToPickUp, bool bShouldDestroy); // Function DungeonCrawler.GA_PickUp.OnPickedUp
}; 
 
 


// Class DungeonCrawler.PerkListWidgetBase
// Size: 0x328(Inherited: 0x300)
struct UPerkListWidgetBase : UDCWidgetBase
{
	struct UAccountLink* AccountLink;  // 0x300 (0x300)
	struct FString LinkedAccountId;  // 0x308 (0x308)
	struct FString CheckTargetAccountId;  // 0x318 (0x318)


}; 
 
 


// Class DungeonCrawler.ClassPerkListWidgetBase
// Size: 0x360(Inherited: 0x328)
struct UClassPerkListWidgetBase : UPerkListWidgetBase
{
	struct TArray<struct UPerkWidget*> PerkWidgetArray;  // 0x328 (0x328)
	char pad_824[40];  // 0x338 (0x338)


	void SetSelectedSlotIndex(int32_t InSlotIndex); // Function DungeonCrawler.ClassPerkListWidgetBase.SetSelectedSlotIndex
	void OnFMsgWidgetClassSlotUnLockLevelNotifyBlueprint(struct FMsgWidgetClassSlotUnLockLevelNotify& InMsg); // Function DungeonCrawler.ClassPerkListWidgetBase.OnFMsgWidgetClassSlotUnLockLevelNotifyBlueprint
	void OnFMsgWidgetClassLevelNotifyBlueprint(struct FMsgWidgetClassLevelNotify& InMsg); // Function DungeonCrawler.ClassPerkListWidgetBase.OnFMsgWidgetClassLevelNotifyBlueprint
	void OnFMsgWidgetClassEquipablePerkEmptySlotsMarkNotifyBlueprint(struct FMsgWidgetClassEquipablePerkEmptySlotsMarkNotify& InMsg); // Function DungeonCrawler.ClassPerkListWidgetBase.OnFMsgWidgetClassEquipablePerkEmptySlotsMarkNotifyBlueprint
	struct FPrimaryAssetId GetSelectedSlotPerkId(); // Function DungeonCrawler.ClassPerkListWidgetBase.GetSelectedSlotPerkId
	int32_t GetSelectedSlotIndex(); // Function DungeonCrawler.ClassPerkListWidgetBase.GetSelectedSlotIndex
}; 
 
 


// Class DungeonCrawler.DCCustomizeLobbyEmoteListWidget
// Size: 0x320(Inherited: 0x300)
struct UDCCustomizeLobbyEmoteListWidget : UDCWidgetBase
{
	char pad_768[24];  // 0x300 (0x300)
	struct UTileView* TileView_LobbyEmoteList;  // 0x318 (0x318)


	void OnSetLobbyEmoteIdArray(struct TArray<struct FDCLobbyEmoteInfo> LobbyEmoteIdArray); // Function DungeonCrawler.DCCustomizeLobbyEmoteListWidget.OnSetLobbyEmoteIdArray
}; 
 
 


// Class DungeonCrawler.ClassSelectAttributeItemWidgetData
// Size: 0x38(Inherited: 0x28)
struct UClassSelectAttributeItemWidgetData : UObject
{
	struct FGameplayEffectDescData AttrributeEffectDescData;  // 0x28 (0x28)
	char pad_52[4];  // 0x34 (0x34)


}; 
 
 


// Class DungeonCrawler.ClassSelectAttributeItemWidget
// Size: 0x308(Inherited: 0x300)
struct UClassSelectAttributeItemWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationStrength
// Size: 0xC0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationStrength : UGameplayModMagnitudeCalculation
{
	char pad_64[128];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCMerchantRequiredItemData
// Size: 0x88(Inherited: 0x28)
struct UDCMerchantRequiredItemData : UObject
{
	struct UDCItemDataAsset* DataAsset;  // 0x28 (0x28)
	int32_t MaxStack;  // 0x30 (0x30)
	char pad_52[4];  // 0x34 (0x34)
	struct TMap<struct FDCItemInfo, int32_t> FilledInfos;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.ClassSelectItemWidgetData
// Size: 0x158(Inherited: 0x28)
struct UClassSelectItemWidgetData : UObject
{
	struct FPrimaryAssetId PlayerCharacterId;  // 0x28 (0x28)
	struct FDesignDataPlayerCharacter DesignDataPlayerCharacter;  // 0x38 (0x38)
	char pad_336_1 : 7;  // 0x150 (0x150)
	bool bSelected : 1;  // 0x150 (0x150)
	char pad_337[7];  // 0x151 (0x151)


}; 
 
 


// Class DungeonCrawler.ClassSelectItemWidget
// Size: 0x308(Inherited: 0x300)
struct UClassSelectItemWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)


}; 
 
 


// Class DungeonCrawler.ClassSpellListWidget
// Size: 0x4A0(Inherited: 0x4A0)
struct UClassSpellListWidget : USpellListWidgetBase
{


	void OnShowEquippableSlot(); // Function DungeonCrawler.ClassSpellListWidget.OnShowEquippableSlot
	void OnHideEquippableSlot(); // Function DungeonCrawler.ClassSpellListWidget.OnHideEquippableSlot
}; 
 
 


// Class DungeonCrawler.ClassSelectPerkItemWidgetData
// Size: 0x38(Inherited: 0x28)
struct UClassSelectPerkItemWidgetData : UObject
{
	struct FString PerkId;  // 0x28 (0x28)


}; 
 
 


// Class DungeonCrawler.SkillListWidgetBase
// Size: 0x328(Inherited: 0x300)
struct USkillListWidgetBase : UDCWidgetBase
{
	struct UAccountLink* AccountLink;  // 0x300 (0x300)
	struct FString LinkedAccountId;  // 0x308 (0x308)
	struct FString CheckTargetAccountId;  // 0x318 (0x318)


}; 
 
 


// Class DungeonCrawler.GA_PlayerMusicPlayBase
// Size: 0x760(Inherited: 0x558)
struct UGA_PlayerMusicPlayBase : UDCGameplayAbilityBase
{
	struct UAnimMontage* MontageToPlayOnPlaying;  // 0x558 (0x558)
	struct UAnimMontage* MontageToPlayOnPlayingSourceObject;  // 0x560 (0x560)
	struct FGameplayTag CurrentMusicTriggerTag;  // 0x568 (0x568)
	struct FDesignDataMusic CurrentMusicData;  // 0x570 (0x570)
	struct AMusicActor* CurrentMusicActor;  // 0x630 (0x630)
	struct UPlayMusicData* CurrentPlayMusicDatas;  // 0x638 (0x638)
	struct FGameplayCueParameters CurrentCueParams;  // 0x640 (0x640)
	struct FRandomStream Stream;  // 0x718 (0x718)
	char pad_1824[64];  // 0x720 (0x720)


	void ReceivedEvent(struct FGameplayTag EventTag, struct FGameplayEventData EventData); // Function DungeonCrawler.GA_PlayerMusicPlayBase.ReceivedEvent
	void OnPlayFinishSucceed(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnPlayFinishSucceed
	void OnPlayFinishFailed(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnPlayFinishFailed
	void OnPlayFinish(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnPlayFinish
	void OnPerfect(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnPerfect
	void OnMiss(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnMiss
	void OnGood(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnGood
	void OnChannelingStartSync(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnChannelingStartSync
	void OnChannelingSectionFinish(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnChannelingSectionFinish
	void OnChannelingFinish(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnChannelingFinish
	void OnChannelingAction(int32_t ActionCounter); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnChannelingAction
	void OnBad(); // Function DungeonCrawler.GA_PlayerMusicPlayBase.OnBad
	void EventReceived(struct FGameplayTag EventTag, struct FGameplayEventData EventData); // Function DungeonCrawler.GA_PlayerMusicPlayBase.EventReceived
	void AbilityActivated(struct FGameplayEventData TriggerEventData); // Function DungeonCrawler.GA_PlayerMusicPlayBase.AbilityActivated
}; 
 
 


// Class DungeonCrawler.DCLobbyEmoteListEntryWidget
// Size: 0x3F8(Inherited: 0x3E8)
struct UDCLobbyEmoteListEntryWidget : UDCLobbyEmoteWidget
{
	char pad_1000[16];  // 0x3E8 (0x3E8)


	void OnRightClicked(); // Function DungeonCrawler.DCLobbyEmoteListEntryWidget.OnRightClicked
	uint8_t GetSelectedVisibility(); // Function DungeonCrawler.DCLobbyEmoteListEntryWidget.GetSelectedVisibility
}; 
 
 


// Class DungeonCrawler.DCStockCraftDataAsset
// Size: 0x48(Inherited: 0x38)
struct UDCStockCraftDataAsset : UDCTableDataAsset
{
	struct TArray<struct FDCStockCraftItemData> StockCraftItemArray;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.GameCrossHairWidget
// Size: 0x308(Inherited: 0x300)
struct UGameCrossHairWidget : UDCWidgetBase
{
	char pad_768_1 : 7;  // 0x300 (0x300)
	bool IsMeleeCrossHair : 1;  // 0x300 (0x300)
	char pad_769[7];  // 0x301 (0x301)


	void OnPlayShootCrossHair(float Rate); // Function DungeonCrawler.GameCrossHairWidget.OnPlayShootCrossHair
	void OnPlayPullingCrossHair(float Rate); // Function DungeonCrawler.GameCrossHairWidget.OnPlayPullingCrossHair
	void OnInitCrossHair(); // Function DungeonCrawler.GameCrossHairWidget.OnInitCrossHair
	void OnCrossHairVisability(bool IsVisablile, bool SetDefault); // Function DungeonCrawler.GameCrossHairWidget.OnCrossHairVisability
	void OnChangeWeaponCrossHair(struct FGameplayTag WeaponTypeTag, struct FGameplayTag ItemUtilityTag, struct FGameplayTag ItemSlotTypeTags, bool IsAttackEnable); // Function DungeonCrawler.GameCrossHairWidget.OnChangeWeaponCrossHair
	void OnChangeToRangeCrossHairAndPullAction(struct FGameplayTag WeaponTypeTag, struct FGameplayTag ItemUtilityTag); // Function DungeonCrawler.GameCrossHairWidget.OnChangeToRangeCrossHairAndPullAction
	void OnChangeCrossHairInfo(struct FGameplayTag WeaponTypeTag, float ChangeAngle, bool IsPinPoint, float RotateTime); // Function DungeonCrawler.GameCrossHairWidget.OnChangeCrossHairInfo
	void OnActivateSpellCrossHair(bool IsActivate); // Function DungeonCrawler.GameCrossHairWidget.OnActivateSpellCrossHair
}; 
 
 


// Class DungeonCrawler.ClassSkillListWidgetBase
// Size: 0x340(Inherited: 0x328)
struct UClassSkillListWidgetBase : USkillListWidgetBase
{
	struct TArray<struct USkillWidget*> SkillWidgetArray;  // 0x328 (0x328)
	char pad_824[8];  // 0x338 (0x338)


	void SetSelectedSlotIndex(int32_t InSlotIndex); // Function DungeonCrawler.ClassSkillListWidgetBase.SetSelectedSlotIndex
	void OnFMsgWidgetClassSlotUnLockLevelNotifyBlueprint(struct FMsgWidgetClassSlotUnLockLevelNotify& InMsg); // Function DungeonCrawler.ClassSkillListWidgetBase.OnFMsgWidgetClassSlotUnLockLevelNotifyBlueprint
	void OnFMsgWidgetClassLevelNotifyBlueprint(struct FMsgWidgetClassLevelNotify& InMsg); // Function DungeonCrawler.ClassSkillListWidgetBase.OnFMsgWidgetClassLevelNotifyBlueprint
	void OnFMsgWidgetClassEquipableSkillEmptySlotsMarkNotifyBlueprint(struct FMsgWidgetClassEquipableSkillEmptySlotsMarkNotify& InMsg); // Function DungeonCrawler.ClassSkillListWidgetBase.OnFMsgWidgetClassEquipableSkillEmptySlotsMarkNotifyBlueprint
	struct FPrimaryAssetId GetSelectedSlotSkillId(); // Function DungeonCrawler.ClassSkillListWidgetBase.GetSelectedSlotSkillId
	int32_t GetSelectedSlotIndex(); // Function DungeonCrawler.ClassSkillListWidgetBase.GetSelectedSlotIndex
}; 
 
 


// Class DungeonCrawler.DCPlayerManager
// Size: 0x1E0(Inherited: 0x30)
struct UDCPlayerManager : UDCUserInfoManagerBase
{
	char pad_48[192];  // 0x30 (0x30)
	struct TMap<struct FDCAccountId, struct FDCPlayerInfo> PlayerInfos;  // 0xF0 (0xF0)
	char pad_320[160];  // 0x140 (0x140)


}; 
 
 


// Class DungeonCrawler.PlayMusicData
// Size: 0x68(Inherited: 0x38)
struct UPlayMusicData : UDCDataAssetBase
{
	struct UAkAudioEvent* AkEvent;  // 0x38 (0x38)
	struct UAkAudioEvent* AkStopEvent;  // 0x40 (0x40)
	struct TArray<struct FDCPlayMusicDataContainer> PlayMusicDatas;  // 0x48 (0x48)
	struct TArray<struct FDCPlayMusicDataContainer> ChannelingPlayMusicDatas;  // 0x58 (0x58)


}; 
 
 


// Class DungeonCrawler.SpellCapacitySlotWidget
// Size: 0x430(Inherited: 0x428)
struct USpellCapacitySlotWidget : USpellSlotWidgetBase
{
	int32_t SequenceIndex;  // 0x428 (0x428)
	char pad_1068[4];  // 0x42C (0x42C)


}; 
 
 


// Class DungeonCrawler.DCActionSkinDataAsset
// Size: 0x100(Inherited: 0x38)
struct UDCActionSkinDataAsset : UDCTableDataAsset
{
	struct FText Name;  // 0x38 (0x38)
	struct FText FlavorText;  // 0x50 (0x50)
	uint8_t ActionSkinType;  // 0x68 (0x68)
	char pad_105[7];  // 0x69 (0x69)
	struct TSoftObjectPtr<UDCActionSkinArtData> Art;  // 0x70 (0x70)
	struct TSoftObjectPtr<UDCGameplayAbilityDataAsset> TargetAction;  // 0xA0 (0xA0)
	struct TSoftObjectPtr<UDCGameplayAbilityDataAsset> SkinAction;  // 0xD0 (0xD0)


}; 
 
 


// Class DungeonCrawler.ClassSpellCapacitySlotWidget
// Size: 0x448(Inherited: 0x430)
struct UClassSpellCapacitySlotWidget : USpellCapacitySlotWidget
{
	struct FText SequenceText;  // 0x430 (0x430)


}; 
 
 


// Class DungeonCrawler.DCGameModeAIControllerMetaLobbyBase
// Size: 0x428(Inherited: 0x428)
struct ADCGameModeAIControllerMetaLobbyBase : ADCGameModeAIControllerMetaBase
{


}; 
 
 


// Class DungeonCrawler.DCItemSkinShopDataAsset
// Size: 0xA8(Inherited: 0x78)
struct UDCItemSkinShopDataAsset : UDCShopDataAsset
{
	struct TSoftObjectPtr<UDCItemSkinDataAsset> StockData;  // 0x78 (0x78)


}; 
 
 


// Class DungeonCrawler.DCAT_PlayMontageAndWaitForEvent
// Size: 0x140(Inherited: 0x80)
struct UDCAT_PlayMontageAndWaitForEvent : UAbilityTask
{
	struct FMulticastInlineDelegate OnCompleted;  // 0x80 (0x80)
	struct FMulticastInlineDelegate OnBlendOut;  // 0x90 (0x90)
	struct FMulticastInlineDelegate OnInterrupted;  // 0xA0 (0xA0)
	struct FMulticastInlineDelegate OnCancelled;  // 0xB0 (0xB0)
	struct FMulticastInlineDelegate EventReceived;  // 0xC0 (0xC0)
	struct UAnimMontage* MontageToPlay;  // 0xD0 (0xD0)
	struct FGameplayTagContainer EventTags;  // 0xD8 (0xD8)
	float Rate;  // 0xF8 (0xF8)
	struct FName StartSection;  // 0xFC (0xFC)
	float StartTimeSeconds;  // 0x104 (0x104)
	float AnimRootMotionTranslationScale;  // 0x108 (0x108)
	char pad_268_1 : 7;  // 0x10C (0x10C)
	bool bStopWhenAbilityEnds : 1;  // 0x10C (0x10C)
	char pad_269[51];  // 0x10D (0x10D)


	struct UDCAT_PlayMontageAndWaitForEvent* PlayMontageAndWaitForEvent(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct UAnimMontage* MontageToPlay, struct FGameplayTagContainer EventTags, float Rate, struct FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, float StartTimeSeconds); // Function DungeonCrawler.DCAT_PlayMontageAndWaitForEvent.PlayMontageAndWaitForEvent
}; 
 
 


// Class DungeonCrawler.SpellCapacityWidgetBase
// Size: 0x4A8(Inherited: 0x440)
struct USpellCapacityWidgetBase : UDCCommonActivatableWidgetBase
{
	struct USpellCapacitySlotWidget* SpellCapacitySlot_2;  // 0x440 (0x440)
	struct USpellCapacitySlotWidget* SpellCapacitySlot_3;  // 0x448 (0x448)
	struct USpellCapacitySlotWidget* SpellCapacitySlot_4;  // 0x450 (0x450)
	struct USpellCapacitySlotWidget* SpellCapacitySlot_5;  // 0x458 (0x458)
	struct USpellCapacitySlotWidget* SpellCapacitySlot_6;  // 0x460 (0x460)
	struct USpellCapacitySlotWidget* SpellCapacitySlot_7;  // 0x468 (0x468)
	struct USpellCapacitySlotWidget* SpellCapacitySlot_8;  // 0x470 (0x470)
	struct USpellCapacitySlotWidget* SpellCapacitySlot_9;  // 0x478 (0x478)
	struct USpellCapacitySlotWidget* SpellCapacitySlot_10;  // 0x480 (0x480)
	struct USpellCapacitySlotWidget* SpellCapacitySlot_11;  // 0x488 (0x488)
	struct TArray<struct USpellCapacitySlotWidget*> SpellCapacitySlots;  // 0x490 (0x490)
	float SpellCurrentCapacity;  // 0x4A0 (0x4A0)
	float SpellMaxCapacity;  // 0x4A4 (0x4A4)


	void OnSpellCapacityChanged(float InSpellCurrentCapacity, float InSpellMaxCapacity); // Function DungeonCrawler.SpellCapacityWidgetBase.OnSpellCapacityChanged
}; 
 
 


// Class DungeonCrawler.PropsActorBase
// Size: 0x3E0(Inherited: 0x310)
struct APropsActorBase : ADCAbilityInteractableActorBase
{
	char pad_784[152];  // 0x310 (0x310)
	struct UImpactableComponent* ImpactableComponent;  // 0x3A8 (0x3A8)
	struct UDCUpdateRateOptimizeManagerComponent* OptimizeComponent;  // 0x3B0 (0x3B0)
	struct UDesignDataAssetProps* DesignDataAssetProps;  // 0x3B8 (0x3B8)
	struct TArray<struct FActiveGameplayEffectHandle> ActiveGameplayEffectHandleArray;  // 0x3C0 (0x3C0)
	struct UDCPropDataComponent* DataComponent;  // 0x3D0 (0x3D0)
	char pad_984[1];  // 0x3D8 (0x3D8)
	char pad_985_1 : 7;  // 0x3D9 (0x3D9)
	bool bPreview : 1;  // 0x3D9 (0x3D9)
	char pad_986[6];  // 0x3DA (0x3DA)


	void UpdateInteractDepthValue(int32_t DepthValue); // Function DungeonCrawler.PropsActorBase.UpdateInteractDepthValue
	void SetPropsId(struct FPrimaryAssetId& InPropsId); // Function DungeonCrawler.PropsActorBase.SetPropsId
	void OnImpactEnduranceExhausted(float ExhaustedTime, UGameplayEffect* GameplayEffectClass, struct FDCGameplayEffectContext EffectContext); // Function DungeonCrawler.PropsActorBase.OnImpactEnduranceExhausted
	struct FPrimaryAssetId GetPropsId(); // Function DungeonCrawler.PropsActorBase.GetPropsId
	struct FDesignDataProps GetDesignDataProps(); // Function DungeonCrawler.PropsActorBase.GetDesignDataProps
	struct UDesignDataAssetProps* GetDesignDataAssetProps(); // Function DungeonCrawler.PropsActorBase.GetDesignDataAssetProps
	void GameplayTagUpdated(struct FGameplayTag InGameplayTag, int32_t InCount); // Function DungeonCrawler.PropsActorBase.GameplayTagUpdated
}; 
 
 


// Class DungeonCrawler.ClassSpellCapacityWidget
// Size: 0x560(Inherited: 0x4A8)
struct UClassSpellCapacityWidget : USpellCapacityWidgetBase
{
	struct UImage* CapacityGauge_2;  // 0x4A8 (0x4A8)
	struct UImage* CapacityGauge_3;  // 0x4B0 (0x4B0)
	struct UImage* CapacityGauge_4;  // 0x4B8 (0x4B8)
	struct UImage* CapacityGauge_5;  // 0x4C0 (0x4C0)
	struct UImage* CapacityGauge_6;  // 0x4C8 (0x4C8)
	struct UImage* CapacityGauge_7;  // 0x4D0 (0x4D0)
	struct UImage* CapacityGauge_8;  // 0x4D8 (0x4D8)
	struct UImage* CapacityGauge_9;  // 0x4E0 (0x4E0)
	struct UImage* CapacityGauge_10;  // 0x4E8 (0x4E8)
	struct UImage* CapacityGauge_11;  // 0x4F0 (0x4F0)
	struct TArray<struct UImage*> CapacityGauges;  // 0x4F8 (0x4F8)
	struct USpacer* CapacitySpacer_2;  // 0x508 (0x508)
	struct USpacer* CapacitySpacer_3;  // 0x510 (0x510)
	struct USpacer* CapacitySpacer_4;  // 0x518 (0x518)
	struct USpacer* CapacitySpacer_5;  // 0x520 (0x520)
	struct USpacer* CapacitySpacer_6;  // 0x528 (0x528)
	struct USpacer* CapacitySpacer_7;  // 0x530 (0x530)
	struct USpacer* CapacitySpacer_8;  // 0x538 (0x538)
	struct USpacer* CapacitySpacer_9;  // 0x540 (0x540)
	struct USpacer* CapacitySpacer_10;  // 0x548 (0x548)
	struct TArray<struct USpacer*> CapacitySpacers;  // 0x550 (0x550)


	void OnSpellListChanged(struct TArray<struct FSpellData>& InSpellDataArray); // Function DungeonCrawler.ClassSpellCapacityWidget.OnSpellListChanged
}; 
 
 


// Class DungeonCrawler.ClassSpellEquippedWidget
// Size: 0x440(Inherited: 0x440)
struct UClassSpellEquippedWidget : UDCCommonActivatableWidgetBase
{


}; 
 
 


// Class DungeonCrawler.SpellListWidgetBase
// Size: 0x4A0(Inherited: 0x460)
struct USpellListWidgetBase : UGameGroupWidgetBase
{
	struct USpellSlotWidgetBase* SpellSlot_2;  // 0x460 (0x460)
	struct USpellSlotWidgetBase* SpellSlot_3;  // 0x468 (0x468)
	struct USpellSlotWidgetBase* SpellSlot_4;  // 0x470 (0x470)
	struct USpellSlotWidgetBase* SpellSlot_5;  // 0x478 (0x478)
	struct USpellSlotWidgetBase* SpellSlot_6;  // 0x480 (0x480)
	struct TArray<struct USpellSlotWidgetBase*> SpellSlots;  // 0x488 (0x488)
	uint8_t WidgetSlotType;  // 0x498 (0x498)
	char pad_1177[7];  // 0x499 (0x499)


}; 
 
 


// Class DungeonCrawler.GamePartyManagePartyWidgetData
// Size: 0x48(Inherited: 0x28)
struct UGamePartyManagePartyWidgetData : UObject
{
	struct FPartyData PartyData;  // 0x28 (0x28)


}; 
 
 


// Class DungeonCrawler.ClassSpellSkillListWidgetBase
// Size: 0x338(Inherited: 0x328)
struct UClassSpellSkillListWidgetBase : USkillListWidgetBase
{
	struct TArray<struct USkillWidget*> SkillWidgetArray;  // 0x328 (0x328)


	void OnFMsgWidgetClassSlotUnLockLevelNotifyBlueprint(struct FMsgWidgetClassSlotUnLockLevelNotify& InMsg); // Function DungeonCrawler.ClassSpellSkillListWidgetBase.OnFMsgWidgetClassSlotUnLockLevelNotifyBlueprint
	void OnFMsgWidgetClassLevelNotifyBlueprint(struct FMsgWidgetClassLevelNotify& InMsg); // Function DungeonCrawler.ClassSpellSkillListWidgetBase.OnFMsgWidgetClassLevelNotifyBlueprint
}; 
 
 


// Class DungeonCrawler.DCMetaPlayerController
// Size: 0x900(Inherited: 0x850)
struct ADCMetaPlayerController : APlayerController
{
	char pad_2128[88];  // 0x850 (0x850)
	struct UBaseObject* BaseObject;  // 0x8A8 (0x8A8)
	struct UAccountLink* AccountLink;  // 0x8B0 (0x8B0)
	struct FDCAccountId TargetAccountId;  // 0x8B8 (0x8B8)
	char pad_2248[32];  // 0x8C8 (0x8C8)
	struct UDCMerchantComponent* MerchantComponent;  // 0x8E8 (0x8E8)
	struct UDCRecruitComponent* RecruitComponent;  // 0x8F0 (0x8F0)
	struct UDCInventoryControllerComponent* InventoryControllerComponent;  // 0x8F8 (0x8F8)


	void UpdateGameState(struct FGameStateData& InGameStateData); // Function DungeonCrawler.DCMetaPlayerController.UpdateGameState
	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCMetaPlayerController.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCMetaPlayerController.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCMetaPlayerController.TerminateBase
	void OnExitConfirmed(uint8_t PopupResult); // Function DungeonCrawler.DCMetaPlayerController.OnExitConfirmed
	void OnExitClicked(); // Function DungeonCrawler.DCMetaPlayerController.OnExitClicked
	void Gm(struct FString InCmd); // Function DungeonCrawler.DCMetaPlayerController.Gm
	struct FAccountSessionData GetAccountSessionData(); // Function DungeonCrawler.DCMetaPlayerController.GetAccountSessionData
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCMetaPlayerController.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.ClassTabMenuWidget
// Size: 0x14F0(Inherited: 0x14F0)
struct UClassTabMenuWidget : UCommonButtonBase
{


	void OnLobbyCharacterInfoUpdated_BP(struct TArray<struct FGameplayTag>& CharacterClassType); // Function DungeonCrawler.ClassTabMenuWidget.OnLobbyCharacterInfoUpdated_BP
	void OnLobbyCharacterInfoUpdated(); // Function DungeonCrawler.ClassTabMenuWidget.OnLobbyCharacterInfoUpdated
}; 
 
 


// Class DungeonCrawler.DCChannelPlayerListEntryWidgetData
// Size: 0x90(Inherited: 0x28)
struct UDCChannelPlayerListEntryWidgetData : UObject
{
	struct FDCChannelPlayerWidgetInfo Info;  // 0x28 (0x28)


}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentMusicItemWidgetData
// Size: 0x40(Inherited: 0x28)
struct UClassUnEquipmentMusicItemWidgetData : UObject
{
	struct FPrimaryAssetId ID;  // 0x28 (0x28)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool Selected : 1;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)


}; 
 
 


// Class DungeonCrawler.DCAT_WaitDistChangeFromLocation
// Size: 0xB0(Inherited: 0x80)
struct UDCAT_WaitDistChangeFromLocation : UAbilityTask
{
	struct FMulticastInlineDelegate OnDistanceChange;  // 0x80 (0x80)
	char pad_144[32];  // 0x90 (0x90)


	struct UDCAT_WaitDistChangeFromLocation* WaitDistanceChange(struct UGameplayAbility* OwningAbility, struct FVector TargetLocation, float MaximumDistance); // Function DungeonCrawler.DCAT_WaitDistChangeFromLocation.WaitDistanceChange
}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentMusicListWidget
// Size: 0x448(Inherited: 0x440)
struct UClassUnEquipmentMusicListWidget : UDCCommonActivatableWidgetBase
{
	struct UListView* MusicListView;  // 0x440 (0x440)


}; 
 
 


// Class DungeonCrawler.DCPlayerBlueprintFunctionLibrary
// Size: 0x28(Inherited: 0x28)
struct UDCPlayerBlueprintFunctionLibrary : UBlueprintFunctionLibrary
{


	struct APawn* GetCurrentPlayerPawn(struct UObject* WorldContextObject); // Function DungeonCrawler.DCPlayerBlueprintFunctionLibrary.GetCurrentPlayerPawn
}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentMusicTypeItemWidgetData
// Size: 0x40(Inherited: 0x28)
struct UClassUnEquipmentMusicTypeItemWidgetData : UObject
{
	struct FGameplayTag TypeTag;  // 0x28 (0x28)
	struct TArray<struct FPrimaryAssetId> MusicIds;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentMusicTypeListWidget
// Size: 0x318(Inherited: 0x300)
struct UClassUnEquipmentMusicTypeListWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)
	struct UTextBlock* TypeName;  // 0x308 (0x308)
	struct UTileView* MusicTileView;  // 0x310 (0x310)


}; 
 
 


// Class DungeonCrawler.DCPlayerCharacterInterface
// Size: 0x28(Inherited: 0x28)
struct UDCPlayerCharacterInterface : UInterface
{


	struct USkeletalMesh* GetPartHeadMeshAsset(); // Function DungeonCrawler.DCPlayerCharacterInterface.GetPartHeadMeshAsset
}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentPerkandSkillItemWidgetData
// Size: 0x48(Inherited: 0x28)
struct UClassUnEquipmentPerkandSkillItemWidgetData : UObject
{
	struct FPrimaryAssetId ID;  // 0x28 (0x28)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool Selected : 1;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)
	struct UUserWidget* Widget;  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCGATA_LineCollision
// Size: 0x500(Inherited: 0x3E0)
struct ADCGATA_LineCollision : AGameplayAbilityTargetActor
{
	struct FCollisionProfileName TraceProfile;  // 0x3E0 (0x3E0)
	char pad_1000_1 : 7;  // 0x3E8 (0x3E8)
	bool bIgnoreBlockingHits : 1;  // 0x3E8 (0x3E8)
	char pad_1001_1 : 7;  // 0x3E9 (0x3E9)
	bool bShowDebug : 1;  // 0x3E9 (0x3E9)
	char pad_1002[2];  // 0x3EA (0x3EA)
	float DebugLineDrawTime;  // 0x3EC (0x3EC)
	char pad_1008[272];  // 0x3F0 (0x3F0)


}; 
 
 


// Class DungeonCrawler.DCMonsterBase
// Size: 0xC50(Inherited: 0x8B0)
struct ADCMonsterBase : ADCCharacterBase
{
	char pad_2224[40];  // 0x8B0 (0x8B0)
	char pad_2264_1 : 7;  // 0x8D8 (0x8D8)
	bool bIsRepRootMotionActive : 1;  // 0x8D8 (0x8D8)
	char pad_2265[7];  // 0x8D9 (0x8D9)
	struct UCapsuleComponent* PlayerCharacterOverlapComponent;  // 0x8E0 (0x8E0)
	char pad_2280[112];  // 0x8E8 (0x8E8)
	struct FPrimaryAssetId MonsterId;  // 0x958 (0x958)
	char pad_2408[136];  // 0x968 (0x968)
	struct UArtDataMonster* ArtDataMonster;  // 0x9F0 (0x9F0)
	char OrientRotationToMovement;  // 0x9F8 (0x9F8)
	char pad_2553[119];  // 0x9F9 (0x9F9)
	char MonsterCollisionProfile;  // 0xA70 (0xA70)
	char pad_2673[119];  // 0xA71 (0xA71)
	char PauseAnims;  // 0xAE8 (0xAE8)
	char pad_2793[7];  // 0xAE9 (0xAE9)
	struct TScriptInterface<IMonsterSpawnableInterface> MonsterSpawnableInterface;  // 0xAF0 (0xAF0)
	struct UDesignDataAssetMonster* DesignDataAssetMonster;  // 0xB00 (0xB00)
	float MinAcceleration;  // 0xB08 (0xB08)
	float NormalAcceleration;  // 0xB0C (0xB0C)
	float MaxAcceleration;  // 0xB10 (0xB10)
	char pad_2836[4];  // 0xB14 (0xB14)
	struct FVector SpawnedPoint;  // 0xB18 (0xB18)
	struct TArray<struct ATargetPoint*> TargetPoints;  // 0xB30 (0xB30)
	char pad_2880_1 : 7;  // 0xB40 (0xB40)
	bool bAggressive : 1;  // 0xB40 (0xB40)
	uint8_t DefaultMonsterCollisionProfile;  // 0xB41 (0xB41)
	char pad_2882[6];  // 0xB42 (0xB42)
	struct UBehaviorTree* BehaviorAsset;  // 0xB48 (0xB48)
	char pad_2896_1 : 7;  // 0xB50 (0xB50)
	bool bRagdollDeath : 1;  // 0xB50 (0xB50)
	char pad_2897[3];  // 0xB51 (0xB51)
	float AddtionalPlayerCharacterOverlapCapsuleComponentHalfHeight;  // 0xB54 (0xB54)
	float AddtionalPlayerCharacterOverlapCapsuleComponentRadius;  // 0xB58 (0xB58)
	float AggroPerTime;  // 0xB5C (0xB5C)
	float AddtionalAggro;  // 0xB60 (0xB60)
	float MaxAggroPoint;  // 0xB64 (0xB64)
	float DecreaseAggroSec;  // 0xB68 (0xB68)
	float DecreaseAggroPointRate;  // 0xB6C (0xB6C)
	struct TMap<struct TWeakObjectPtr<AActor>, struct FAggroInfo> AggroInfoMap;  // 0xB70 (0xB70)
	struct TArray<struct TWeakObjectPtr<ADCCharacterBase>> SightTargets;  // 0xBC0 (0xBC0)
	struct TArray<struct TWeakObjectPtr<ADCCharacterBase>> HearingTargets;  // 0xBD0 (0xBD0)
	struct TArray<struct TWeakObjectPtr<ADCCharacterBase>> Slaves;  // 0xBE0 (0xBE0)
	char pad_3056[88];  // 0xBF0 (0xBF0)
	char pad_3144_1 : 7;  // 0xC48 (0xC48)
	bool bPreview : 1;  // 0xC48 (0xC48)
	char pad_3145[7];  // 0xC49 (0xC49)


	void SetMonsterId(struct FPrimaryAssetId& InMonsterId); // Function DungeonCrawler.DCMonsterBase.SetMonsterId
	void OnStuckByShield(struct ADCCharacterBase* InInstigator, struct AActor* InEffectCauser); // Function DungeonCrawler.DCMonsterBase.OnStuckByShield
	void OnSetAI(); // Function DungeonCrawler.DCMonsterBase.OnSetAI
	void OnRep_PauseAnims(char& OldPauseAnims); // Function DungeonCrawler.DCMonsterBase.OnRep_PauseAnims
	void OnRep_OrientRotationToMovement(char& OldOrientRotationToMovement); // Function DungeonCrawler.DCMonsterBase.OnRep_OrientRotationToMovement
	void OnRep_MonsterId(struct FPrimaryAssetId& InOldMonsterId); // Function DungeonCrawler.DCMonsterBase.OnRep_MonsterId
	void OnRep_MonsterCollisionProfile(char& OldMonsterCollisionProfile); // Function DungeonCrawler.DCMonsterBase.OnRep_MonsterCollisionProfile
	void OnRep_bIsRepRootMotionActive(bool InOldbIsRepRootMotionActive); // Function DungeonCrawler.DCMonsterBase.OnRep_bIsRepRootMotionActive
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DungeonCrawler.DCMonsterBase.OnOverlapEnd
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DungeonCrawler.DCMonsterBase.OnOverlapBegin
	void OnNewTarget(struct ADCCharacterBase* InTarget); // Function DungeonCrawler.DCMonsterBase.OnNewTarget
	void OnLostTarget(struct ADCCharacterBase* InTarget); // Function DungeonCrawler.DCMonsterBase.OnLostTarget
	void OnFMsgGASAttributeNotifyBlueprint(struct FMsgGASAttributeNotify& InMsg); // Function DungeonCrawler.DCMonsterBase.OnFMsgGASAttributeNotifyBlueprint
	void OnDamaged(struct ADCCharacterBase* DCCharacterBase); // Function DungeonCrawler.DCMonsterBase.OnDamaged
	void OnBeforeDeath(); // Function DungeonCrawler.DCMonsterBase.OnBeforeDeath
	void OnAfterDeath(); // Function DungeonCrawler.DCMonsterBase.OnAfterDeath
	bool Normal(); // Function DungeonCrawler.DCMonsterBase.Normal
	bool InteractableWithoutHit(); // Function DungeonCrawler.DCMonsterBase.InteractableWithoutHit
	bool InteractableOnly(); // Function DungeonCrawler.DCMonsterBase.InteractableOnly
	bool Interactable(); // Function DungeonCrawler.DCMonsterBase.Interactable
	struct FPrimaryAssetId GetMonsterId(); // Function DungeonCrawler.DCMonsterBase.GetMonsterId
	struct FDesignDataMonster GetDesignDataMonster(); // Function DungeonCrawler.DCMonsterBase.GetDesignDataMonster
	bool Fly(); // Function DungeonCrawler.DCMonsterBase.Fly
	bool Death(); // Function DungeonCrawler.DCMonsterBase.Death
	void ChangePauseAnims(char Value); // Function DungeonCrawler.DCMonsterBase.ChangePauseAnims
	void ChangeOrientRotationToMovement(char Value); // Function DungeonCrawler.DCMonsterBase.ChangeOrientRotationToMovement
	bool Burrow(); // Function DungeonCrawler.DCMonsterBase.Burrow
	bool BeforeDeath(); // Function DungeonCrawler.DCMonsterBase.BeforeDeath
}; 
 
 


// Class DungeonCrawler.DCCharacterSkinShopDataAsset
// Size: 0xA8(Inherited: 0x78)
struct UDCCharacterSkinShopDataAsset : UDCShopDataAsset
{
	struct TSoftObjectPtr<UDCCharacterSkinDataAsset> StockData;  // 0x78 (0x78)


}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentPerkandSkillListWidget
// Size: 0x450(Inherited: 0x440)
struct UClassUnEquipmentPerkandSkillListWidget : UDCCommonActivatableWidgetBase
{
	struct UTileView* PerkTileView;  // 0x440 (0x440)
	struct UTileView* SkillTileView;  // 0x448 (0x448)


	void OnSetCompletedSkillTileView(); // Function DungeonCrawler.ClassUnEquipmentPerkandSkillListWidget.OnSetCompletedSkillTileView
	void OnSetCompletedPerkTileView(); // Function DungeonCrawler.ClassUnEquipmentPerkandSkillListWidget.OnSetCompletedPerkTileView
	void OnCompletedSkillTileViewRegenerateAllEntries(); // Function DungeonCrawler.ClassUnEquipmentPerkandSkillListWidget.OnCompletedSkillTileViewRegenerateAllEntries
	void OnCompletedPerkTileViewRegenerateAllEntries(); // Function DungeonCrawler.ClassUnEquipmentPerkandSkillListWidget.OnCompletedPerkTileViewRegenerateAllEntries
	struct FPrimaryAssetId GetSelectedSkillId(); // Function DungeonCrawler.ClassUnEquipmentPerkandSkillListWidget.GetSelectedSkillId
	struct FPrimaryAssetId GetSelectedPerkId(); // Function DungeonCrawler.ClassUnEquipmentPerkandSkillListWidget.GetSelectedPerkId
}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentSpellItemWidgetData
// Size: 0x40(Inherited: 0x28)
struct UClassUnEquipmentSpellItemWidgetData : UObject
{
	struct FPrimaryAssetId ID;  // 0x28 (0x28)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool Selected : 1;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)


}; 
 
 


// Class DungeonCrawler.DCAT_WaitGameplayEffectAdd
// Size: 0xA0(Inherited: 0x80)
struct UDCAT_WaitGameplayEffectAdd : UAbilityTask
{
	struct FMulticastInlineDelegate OnApplied;  // 0x80 (0x80)
	char pad_144[16];  // 0x90 (0x90)


	struct UDCAT_WaitGameplayEffectAdd* WaitGameplayEffectAdded(struct UGameplayAbility* OwningAbility, bool TriggerOnce); // Function DungeonCrawler.DCAT_WaitGameplayEffectAdd.WaitGameplayEffectAdded
	void OnApplyGameplayEffectCallback(struct UAbilitySystemComponent* Target, struct FGameplayEffectSpec& SpecApplied, struct FActiveGameplayEffectHandle ActiveHandle); // Function DungeonCrawler.DCAT_WaitGameplayEffectAdd.OnApplyGameplayEffectCallback
}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentSpellListWidget
// Size: 0x448(Inherited: 0x440)
struct UClassUnEquipmentSpellListWidget : UDCCommonActivatableWidgetBase
{
	struct UListView* SpellListView;  // 0x440 (0x440)


}; 
 
 


// Class DungeonCrawler.DCItemInfoWidgetData
// Size: 0x140(Inherited: 0x28)
struct UDCItemInfoWidgetData : UObject
{
	char pad_40[280];  // 0x28 (0x28)


}; 
 
 


// Class DungeonCrawler.DCLightSourceComponent
// Size: 0xC0(Inherited: 0xA0)
struct UDCLightSourceComponent : UActorComponent
{
	struct TArray<struct UPointLightComponent*> PointLightComponentArray;  // 0xA0 (0xA0)
	struct TArray<struct UNiagaraComponent*> NiagaraComponentArray;  // 0xB0 (0xB0)


}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentSpellTierItemWidgetData
// Size: 0x40(Inherited: 0x28)
struct UClassUnEquipmentSpellTierItemWidgetData : UObject
{
	int32_t Tier;  // 0x28 (0x28)
	char pad_44[4];  // 0x2C (0x2C)
	struct TArray<struct FPrimaryAssetId> SpellIds;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.CommonPopupBase
// Size: 0x440(Inherited: 0x440)
struct UCommonPopupBase : UDCCommonActivatableWidgetBase
{


}; 
 
 


// Class DungeonCrawler.DCAoeSystemBlueprintLibrary
// Size: 0x28(Inherited: 0x28)
struct UDCAoeSystemBlueprintLibrary : UBlueprintFunctionLibrary
{


	struct ADCAoeBase* SpawnAoeDeferred(struct ADCCharacterBase*& DCCharacterBase, ADCAoeBase* AoeClass, struct UDCGameplayAbilityBase* DCGameplayAbilityBase, struct FGameplayEventData EventData, bool& bSuccessfully); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.SpawnAoeDeferred
	struct ADCAoeBase* SpawnAoe(struct ADCCharacterBase*& DCCharacterBase, ADCAoeBase* AoeClass, struct FVector Location, struct UDCGameplayAbilityBase* DCGameplayAbilityBase, struct FGameplayEventData EventData, bool& bSuccessfully); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.SpawnAoe
	struct ADCCharacterBase* SortTargetsByDistanceAndPickTarget(struct ADCAoeBase*& DCAoeBase, struct TArray<struct ADCCharacterBase*>& TargetArray, uint8_t AoeFilterSortingType, int32_t Index); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.SortTargetsByDistanceAndPickTarget
	bool SortTargetsByDistance(struct ADCAoeBase*& DCAoeBase, struct TArray<struct ADCCharacterBase*>& TargetArray, uint8_t AoeFilterSortingType); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.SortTargetsByDistance
	struct ADCCharacterBase* PickTarget(struct TArray<struct ADCCharacterBase*>& TargetArray, int32_t Index); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.PickTarget
	struct ADCCharacterBase* PickRandomTarget(struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.PickRandomTarget
	bool GetTargetArray(struct ADCAoeBase*& DCAoeBase, struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.GetTargetArray
	bool FilterUnTagedTargets(struct TArray<struct ADCCharacterBase*>& TargetArray, struct FGameplayTag GameplayTag); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.FilterUnTagedTargets
	bool FilterTargetsWithinDistance(struct ADCAoeBase*& DCAoeBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float Distance); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.FilterTargetsWithinDistance
	bool FilterTargetsWithinDirectionAngleAndAllowedAngle(struct ADCAoeBase*& DCAoeBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float DirectionalAngle, float AllowedAngle); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.FilterTargetsWithinDirectionAngleAndAllowedAngle
	bool FilterTargetsOverDistance(struct ADCAoeBase*& DCAoeBase, struct TArray<struct ADCCharacterBase*>& TargetArray, float Distance); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.FilterTargetsOverDistance
	bool FilterTagedTargets(struct TArray<struct ADCCharacterBase*>& TargetArray, struct FGameplayTag GameplayTag); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.FilterTagedTargets
	void FilterPlayerCharacterTargets(struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.FilterPlayerCharacterTargets
	void FilterMonsterTargets(struct TArray<struct ADCCharacterBase*>& TargetArray); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.FilterMonsterTargets
	void DespawnAoeWithinDistance(struct ADCCharacterBase*& DCCharacterBase, struct FVector Location, float Distance); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.DespawnAoeWithinDistance
	void DespawnAoeByPrimaryAssetIdWithinDistance(struct ADCCharacterBase*& DCCharacterBase, struct FPrimaryAssetId PrimaryAssetId, struct FVector Location, float Distance); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.DespawnAoeByPrimaryAssetIdWithinDistance
	void DespawnAoeByPrimaryAssetId(struct ADCCharacterBase*& DCCharacterBase, struct FPrimaryAssetId PrimaryAssetId); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.DespawnAoeByPrimaryAssetId
	void DespawnAoeAll(struct ADCCharacterBase* DCCharacterBase); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.DespawnAoeAll
	void DeferredAoeFinish(struct ADCCharacterBase*& DCCharacterBase, struct ADCAoeBase* Aoe, struct FTransform Transform, struct FGameplayEventData EventData, bool& bSuccessfully); // Function DungeonCrawler.DCAoeSystemBlueprintLibrary.DeferredAoeFinish
}; 
 
 


// Class DungeonCrawler.GameMenuOptionsVideosSlotWidget
// Size: 0x310(Inherited: 0x300)
struct UGameMenuOptionsVideosSlotWidget : UDCWidgetBase
{
	struct UTextBlock* Title;  // 0x300 (0x300)
	char pad_776[8];  // 0x308 (0x308)


	void SetTitle(struct FText InTitle); // Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.SetTitle
	void SetQualityLevel(int32_t InQualityLevel); // Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.SetQualityLevel
	void OnQualityLevel(int32_t& NewValue, int32_t& OldValue); // Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.OnQualityLevel
	void OnMediumButtonClicked(); // Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.OnMediumButtonClicked
	void OnLowButtonClicked(); // Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.OnLowButtonClicked
	void OnHighButtonClicked(); // Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.OnHighButtonClicked
	void OnExtraButtonClicked(); // Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.OnExtraButtonClicked
	void OnEpicButtonClicked(); // Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.OnEpicButtonClicked
	int32_t GetQualityLevel(); // Function DungeonCrawler.GameMenuOptionsVideosSlotWidget.GetQualityLevel
}; 
 
 


// Class DungeonCrawler.ClassUnEquipmentSpellTierListWidget
// Size: 0x320(Inherited: 0x300)
struct UClassUnEquipmentSpellTierListWidget : UDCWidgetBase
{
	char pad_768[8];  // 0x300 (0x300)
	struct UTextBlock* TierNumber;  // 0x308 (0x308)
	struct UTextBlock* CostNumber;  // 0x310 (0x310)
	struct UTileView* SpellTileView;  // 0x318 (0x318)


}; 
 
 


// Class DungeonCrawler.ClientAccountSubsystem
// Size: 0x4C0(Inherited: 0x30)
struct UClientAccountSubsystem : UGameInstanceSubsystem
{
	char pad_48[744];  // 0x30 (0x30)
	struct TMap<int16_t, struct USubSystemReplyMsg*> ResponseLambdaPointerMap;  // 0x318 (0x318)
	char pad_872[24];  // 0x368 (0x368)
	struct UTcpSocket* TcpSocketObject;  // 0x380 (0x380)
	char pad_904[312];  // 0x388 (0x388)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.ClientAccountSubsystem.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.ClientAccountSubsystem.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.ClientAccountSubsystem.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.ClientAccountSubsystem.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCAkSpatialAudioVolume
// Size: 0x388(Inherited: 0x2E0)
struct ADCAkSpatialAudioVolume : AAkSpatialAudioVolume
{
	char pad_736[88];  // 0x2E0 (0x2E0)
	struct UBaseObject* BaseObject;  // 0x338 (0x338)
	float Priority;  // 0x340 (0x340)
	char pad_836[4];  // 0x344 (0x344)
	struct UAkAudioEvent* AkEventBeginOverlap;  // 0x348 (0x348)
	struct UAkStateValue* AkStateValueBeginOverlap;  // 0x350 (0x350)
	struct UAkRtpc* RtpcBeginOverlap;  // 0x358 (0x358)
	float RtpcValueBeginOverlap;  // 0x360 (0x360)
	char pad_868[4];  // 0x364 (0x364)
	struct UAkAudioEvent* AkEventEndOverlap;  // 0x368 (0x368)
	struct UAkStateValue* AkStateValueEndOverlap;  // 0x370 (0x370)
	struct UAccountLink* AccountLink;  // 0x378 (0x378)
	char pad_896[8];  // 0x380 (0x380)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCAkSpatialAudioVolume.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCAkSpatialAudioVolume.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCAkSpatialAudioVolume.TerminateBase
	void OnTargetPlayerPawnExitVolume(); // Function DungeonCrawler.DCAkSpatialAudioVolume.OnTargetPlayerPawnExitVolume
	void OnTargetPlayerPawnEnterVolume(); // Function DungeonCrawler.DCAkSpatialAudioVolume.OnTargetPlayerPawnEnterVolume
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function DungeonCrawler.DCAkSpatialAudioVolume.OnOverlapEnd
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function DungeonCrawler.DCAkSpatialAudioVolume.OnOverlapBegin
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCAkSpatialAudioVolume.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.ClientPartySubsystem
// Size: 0x188(Inherited: 0x30)
struct UClientPartySubsystem : UGameInstanceSubsystem
{
	char pad_48[344];  // 0x30 (0x30)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.ClientPartySubsystem.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.ClientPartySubsystem.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.ClientPartySubsystem.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.ClientPartySubsystem.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.ClientShopSubsystem
// Size: 0x110(Inherited: 0x30)
struct UClientShopSubsystem : UGameInstanceSubsystem
{
	char pad_48[224];  // 0x30 (0x30)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.ClientShopSubsystem.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.ClientShopSubsystem.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.ClientShopSubsystem.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.ClientShopSubsystem.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCDamageExecCalculation
// Size: 0x40(Inherited: 0x40)
struct UDCDamageExecCalculation : UGameplayEffectExecutionCalculation
{


}; 
 
 


// Class DungeonCrawler.GameHitDirectionManagerWidget
// Size: 0x330(Inherited: 0x300)
struct UGameHitDirectionManagerWidget : UDCWidgetBase
{
	struct TArray<struct UDCWidgetBase*> HitDirectionWidgetList;  // 0x300 (0x300)
	UGameHitDirectionWidget* HitDirectionWidget;  // 0x310 (0x310)
	struct UGameHitDirectionWidget* AllDirectionWidget;  // 0x318 (0x318)
	struct UGameHitDirectionWidget* HealingWidget;  // 0x320 (0x320)
	int32_t SpawnCount;  // 0x328 (0x328)
	char pad_812[4];  // 0x32C (0x32C)


}; 
 
 


// Class DungeonCrawler.CommemorativePlaqueTextWidget
// Size: 0x300(Inherited: 0x300)
struct UCommemorativePlaqueTextWidget : UDCWidgetBase
{


	void UpdateCommenorativePlaqueText(struct TArray<struct FText>& InText, struct FVector Location); // Function DungeonCrawler.CommemorativePlaqueTextWidget.UpdateCommenorativePlaqueText
	void SnedWidgetToggleMsg(); // Function DungeonCrawler.CommemorativePlaqueTextWidget.SnedWidgetToggleMsg
	void SetCommemorativePlaqueText(struct FPrimaryAssetId ScriptId, struct FVector Location); // Function DungeonCrawler.CommemorativePlaqueTextWidget.SetCommemorativePlaqueText
}; 
 
 


// Class DungeonCrawler.DCAT_WaitAimDirChangedFromLoc
// Size: 0xC0(Inherited: 0x80)
struct UDCAT_WaitAimDirChangedFromLoc : UAbilityTask
{
	struct FMulticastInlineDelegate OnDirectionChanged;  // 0x80 (0x80)
	char pad_144[48];  // 0x90 (0x90)


	struct UDCAT_WaitAimDirChangedFromLoc* WaitAimDirectionChangedFromLocation(struct UGameplayAbility* OwningAbility, struct FVector InitialAimTargetLocation); // Function DungeonCrawler.DCAT_WaitAimDirChangedFromLoc.WaitAimDirectionChangedFromLocation
}; 
 
 


// Class DungeonCrawler.DCContextComponent
// Size: 0x110(Inherited: 0xA0)
struct UDCContextComponent : UActorComponent
{
	char pad_160[88];  // 0xA0 (0xA0)
	UContextMenuWidgetBase* ContextMenuWidgetClass;  // 0xF8 (0xF8)
	char pad_256[16];  // 0x100 (0x100)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCContextComponent.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCContextComponent.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCContextComponent.TerminateBase
	void OnContextMenuHolderVisibilityChaned(uint8_t Visibility); // Function DungeonCrawler.DCContextComponent.OnContextMenuHolderVisibilityChaned
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCContextComponent.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCIngameHUD
// Size: 0x3B0(Inherited: 0x390)
struct ADCIngameHUD : ADCHUD
{
	UUserWidget* LocalTestWidgetClass;  // 0x390 (0x390)
	UUserWidget* SpectatorLoadingScreenClass;  // 0x398 (0x398)
	struct UUserWidget* LocalTestWidget;  // 0x3A0 (0x3A0)
	struct UUserWidget* SpectatorLoadingScreen;  // 0x3A8 (0x3A8)


}; 
 
 


// Class DungeonCrawler.DCCommonButtonBase
// Size: 0x1580(Inherited: 0x14F0)
struct UDCCommonButtonBase : UCommonButtonBase
{
	char pad_5360[88];  // 0x14F0 (0x14F0)
	struct FMulticastInlineDelegate OnCommonButtonClick;  // 0x1548 (0x1548)
	struct UAkAudioEvent* ClickSound;  // 0x1558 (0x1558)
	struct FText ButtonText;  // 0x1560 (0x1560)
	struct UBaseObject* BaseObject;  // 0x1578 (0x1578)


	void UnbindMsgOwner(struct UScriptStruct* InMsgType); // Function DungeonCrawler.DCCommonButtonBase.UnbindMsgOwner
	void UnbindMsgAllOwner(); // Function DungeonCrawler.DCCommonButtonBase.UnbindMsgAllOwner
	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCCommonButtonBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCCommonButtonBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCCommonButtonBase.TerminateBase
	void SetButtonText(struct FText& InButtonText); // Function DungeonCrawler.DCCommonButtonBase.SetButtonText
	void PlayClickSound(); // Function DungeonCrawler.DCCommonButtonBase.PlayClickSound
	void OnCommonButtonClicked(); // Function DungeonCrawler.DCCommonButtonBase.OnCommonButtonClicked
	struct TScriptInterface<IBaseInterface> GetOwningBaseInterfaceBlueprint(); // Function DungeonCrawler.DCCommonButtonBase.GetOwningBaseInterfaceBlueprint
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCCommonButtonBase.BroadcastMsgBlueprint
	void BindMsgOwner(struct UScriptStruct* InMsgType, struct UBindMsgNode* InMsgDynamicDelegate); // Function DungeonCrawler.DCCommonButtonBase.BindMsgOwner
}; 
 
 


// Class DungeonCrawler.DCPortraitCharacter
// Size: 0x6E0(Inherited: 0x6B0)
struct ADCPortraitCharacter : ADCCharacterV2
{
	struct FUint32Point Size;  // 0x6B0 (0x6B0)
	struct UDCSceneCaptureComponent2D* PortraitCaptureComponent;  // 0x6B8 (0x6B8)
	struct UTextureRenderTarget2D* PortraitRenderTarget;  // 0x6C0 (0x6C0)
	char pad_1736[24];  // 0x6C8 (0x6C8)


}; 
 
 


// Class DungeonCrawler.CommonButtonLWidget
// Size: 0x1580(Inherited: 0x1580)
struct UCommonButtonLWidget : UDCCommonButtonBase
{


	void SetSwitchOn(bool bSetOn); // Function DungeonCrawler.CommonButtonLWidget.SetSwitchOn
	void SetAllText(struct FText TextTitle); // Function DungeonCrawler.CommonButtonLWidget.SetAllText
}; 
 
 


// Class DungeonCrawler.GameMenuOptionBaseWidget
// Size: 0x348(Inherited: 0x300)
struct UGameMenuOptionBaseWidget : UDCWidgetBase
{
	struct FMulticastInlineDelegate GameMenuOptionHoveredDelegate;  // 0x300 (0x300)
	struct UWidgetSwitcher* Switcher_Selected;  // 0x310 (0x310)
	struct FText TitleText;  // 0x318 (0x318)
	struct FText DescText;  // 0x330 (0x330)


	void OnHovered(); // Function DungeonCrawler.GameMenuOptionBaseWidget.OnHovered
}; 
 
 


// Class DungeonCrawler.DesignDataAssetItemConsume
// Size: 0x58(Inherited: 0x38)
struct UDesignDataAssetItemConsume : UDCDesignDataAssetBase
{
	struct FDesignDataItemConsume Item;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.CommonButtonMWidget
// Size: 0x1580(Inherited: 0x1580)
struct UCommonButtonMWidget : UDCCommonButtonBase
{


	void SetAllText(struct FText TextTitle); // Function DungeonCrawler.CommonButtonMWidget.SetAllText
}; 
 
 


// Class DungeonCrawler.CommonButtonPopupWidget
// Size: 0x1580(Inherited: 0x1580)
struct UCommonButtonPopupWidget : UDCCommonButtonBase
{


	void SetAllText(struct FText TextTitle); // Function DungeonCrawler.CommonButtonPopupWidget.SetAllText
}; 
 
 


// Class DungeonCrawler.CommonButtonSWidget
// Size: 0x1580(Inherited: 0x1580)
struct UCommonButtonSWidget : UDCCommonButtonBase
{


	void SetAllText(struct FText TextTitle); // Function DungeonCrawler.CommonButtonSWidget.SetAllText
}; 
 
 


// Class DungeonCrawler.PopupDataBase
// Size: 0x30(Inherited: 0x28)
struct UPopupDataBase : UObject
{
	char pad_40[8];  // 0x28 (0x28)


}; 
 
 


// Class DungeonCrawler.DCIngameUserManager
// Size: 0xE8(Inherited: 0x30)
struct UDCIngameUserManager : UDCUserInfoManagerBase
{
	struct TMap<struct FDCAccountId, struct FDCIngameUser> IngameUsers;  // 0x30 (0x30)
	char pad_128[104];  // 0x80 (0x80)


}; 
 
 


// Class DungeonCrawler.DCCharacterBase
// Size: 0x8B0(Inherited: 0x620)
struct ADCCharacterBase : ACharacter
{
	char pad_1568[112];  // 0x620 (0x620)
	struct UBaseObject* BaseObject;  // 0x690 (0x690)
	char pad_1688[24];  // 0x698 (0x698)
	struct UAbilitySystemComponent* AbilitySystemComponent;  // 0x6B0 (0x6B0)
	struct UDCUpdateRateOptimizeManagerComponent* OptimizeComponent;  // 0x6B8 (0x6B8)
	char pad_1728[8];  // 0x6C0 (0x6C0)
	struct FGenericTeamId GenericTeamId;  // 0x6C8 (0x6C8)
	char pad_1737[7];  // 0x6C9 (0x6C9)
	struct UAttackInputManagerComponent* AttackInputManager;  // 0x6D0 (0x6D0)
	struct USkillComponent* SkillComponent;  // 0x6D8 (0x6D8)
	char pad_1760[56];  // 0x6E0 (0x6E0)
	struct FString AccountId;  // 0x718 (0x718)
	struct UAccountLink* AccountLink;  // 0x728 (0x728)
	struct FAccountDataReplication AccountDataReplication;  // 0x730 (0x730)
	char pad_1960_1 : 7;  // 0x7A8 (0x7A8)
	bool bIsFirstPersonPerspective : 1;  // 0x7A8 (0x7A8)
	char pad_1961_1 : 7;  // 0x7A9 (0x7A9)
	bool bIsDead : 1;  // 0x7A9 (0x7A9)
	char pad_1962[6];  // 0x7AA (0x7AA)
	struct TArray<struct TWeakObjectPtr<ADCAoeBase>> AoeArray;  // 0x7B0 (0x7B0)
	struct FNickname NickNameCached;  // 0x7C0 (0x7C0)
	char pad_2024[16];  // 0x7E8 (0x7E8)
	char RemoteViewYaw;  // 0x7F8 (0x7F8)
	char pad_2041[103];  // 0x7F9 (0x7F9)
	struct FGameplayTagContainer AimRotationLockTags;  // 0x860 (0x860)
	struct FGameplayTagContainer CancelWithoutTags;  // 0x880 (0x880)
	struct UDCInventoryComponent* InventoryComponentV2;  // 0x8A0 (0x8A0)
	char pad_2216[8];  // 0x8A8 (0x8A8)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCCharacterBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCCharacterBase.UnbindMsg
	void TogglePerspective(); // Function DungeonCrawler.DCCharacterBase.TogglePerspective
	void TerminateBase(); // Function DungeonCrawler.DCCharacterBase.TerminateBase
	void SetIsDead(bool IsDead); // Function DungeonCrawler.DCCharacterBase.SetIsDead
	void SetGenericTeamId(struct FGenericTeamId& TeamID); // Function DungeonCrawler.DCCharacterBase.SetGenericTeamId
	void ServerSetRemoteViewYaw(char InRemoteViewYaw); // Function DungeonCrawler.DCCharacterBase.ServerSetRemoteViewYaw
	void RemoveAllLocalStateTags(); // Function DungeonCrawler.DCCharacterBase.RemoveAllLocalStateTags
	void ReceivePreInitializeComponents(); // Function DungeonCrawler.DCCharacterBase.ReceivePreInitializeComponents
	void OnUpdateTeammateState(bool bIsTeammateWithLocalPlayer); // Function DungeonCrawler.DCCharacterBase.OnUpdateTeammateState
	void OnSetPerspective(struct APlayerController* InPlayerController, bool bInIsFirstPersonPerspective); // Function DungeonCrawler.DCCharacterBase.OnSetPerspective
	void OnRep_AccountId(struct FString InOldAccountId); // Function DungeonCrawler.DCCharacterBase.OnRep_AccountId
	void OnQuickSlotClicked(uint8_t SlotType); // Function DungeonCrawler.DCCharacterBase.OnQuickSlotClicked
	void OnGameState(struct FGameStateData& InGameStateData); // Function DungeonCrawler.DCCharacterBase.OnGameState
	void OnFMsgGASActorDieNotifyBlueprint(struct FMsgGASActorDieNotify& InMsg); // Function DungeonCrawler.DCCharacterBase.OnFMsgGASActorDieNotifyBlueprint
	void OnCharacterMoved(float InDeltaSeconds, struct FVector InOldLocation, struct FVector InOldVelocity); // Function DungeonCrawler.DCCharacterBase.OnCharacterMoved
	bool IsSameTeam(struct FString PartyId); // Function DungeonCrawler.DCCharacterBase.IsSameTeam
	bool IsInFirstPersonPerspective(); // Function DungeonCrawler.DCCharacterBase.IsInFirstPersonPerspective
	bool IsDead(); // Function DungeonCrawler.DCCharacterBase.IsDead
	void InteractSucceed(struct AActor* Interacter, struct FGameplayTag StateTag, struct FGameplayTag TriggerTag, struct FHitResult HitResult); // Function DungeonCrawler.DCCharacterBase.InteractSucceed
	void InteractLost(struct AActor* Interacter); // Function DungeonCrawler.DCCharacterBase.InteractLost
	void InteractFound(struct AActor* Interacter, struct UPrimitiveComponent* InteractPart); // Function DungeonCrawler.DCCharacterBase.InteractFound
	struct UCameraComponent* GetPerspectiveCameraComponent(bool bFirstPersonPerspective); // Function DungeonCrawler.DCCharacterBase.GetPerspectiveCameraComponent
	struct FString GetPartyId(); // Function DungeonCrawler.DCCharacterBase.GetPartyId
	struct FNickname GetNickNameCached(); // Function DungeonCrawler.DCCharacterBase.GetNickNameCached
	bool GetHitBoxLocation(uint8_t HitBoxType, struct FVector& Location); // Function DungeonCrawler.DCCharacterBase.GetHitBoxLocation
	struct FGenericTeamId GetGenericTeamId(); // Function DungeonCrawler.DCCharacterBase.GetGenericTeamId
	struct FVector GetCapsuleTopLocation(); // Function DungeonCrawler.DCCharacterBase.GetCapsuleTopLocation
	struct FVector GetCapsuleBottomLocation(); // Function DungeonCrawler.DCCharacterBase.GetCapsuleBottomLocation
	struct UCameraComponent* GetCameraComponent(); // Function DungeonCrawler.DCCharacterBase.GetCameraComponent
	struct FString GetAccountId(); // Function DungeonCrawler.DCCharacterBase.GetAccountId
	void GameplayTagUpdated(struct FGameplayTag InGameplayTag, int32_t InCount); // Function DungeonCrawler.DCCharacterBase.GameplayTagUpdated
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCCharacterBase.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.MetaItemComponent
// Size: 0x100(Inherited: 0x100)
struct UMetaItemComponent : UItemComponentBase
{


}; 
 
 


// Class DungeonCrawler.DCTradeBoxWidget
// Size: 0x2E8(Inherited: 0x2C0)
struct UDCTradeBoxWidget : UDCInventoryWidgetBase
{
	char pad_704_1 : 7;  // 0x2C0 (0x2C0)
	bool bLocal : 1;  // 0x2C0 (0x2C0)
	char pad_705[7];  // 0x2C1 (0x2C1)
	struct FString TraderName;  // 0x2C8 (0x2C8)
	char pad_728_1 : 7;  // 0x2D8 (0x2D8)
	bool bReady : 1;  // 0x2D8 (0x2D8)
	char pad_729[3];  // 0x2D9 (0x2D9)
	float LockRemainTime;  // 0x2DC (0x2DC)
	struct UDCBagWidget* InnerBagWidget;  // 0x2E0 (0x2E0)


	void SetReady(bool bState); // Function DungeonCrawler.DCTradeBoxWidget.SetReady
	bool IsEnableCheckBox(); // Function DungeonCrawler.DCTradeBoxWidget.IsEnableCheckBox
}; 
 
 


// Class DungeonCrawler.CommonPopupManageWidget
// Size: 0x378(Inherited: 0x300)
struct UCommonPopupManageWidget : UDCWidgetBase
{
	struct UCanvasPanel* PopupCanvas;  // 0x300 (0x300)
	UDCCommonActivatableWidgetBase* DefaultPopupWidgetClass;  // 0x308 (0x308)
	struct TMap<int32_t, struct FMsgPopup> ReplyPointerMap;  // 0x310 (0x310)
	char pad_864[24];  // 0x360 (0x360)


}; 
 
 


// Class DungeonCrawler.PopupDataSWidget
// Size: 0x68(Inherited: 0x30)
struct UPopupDataSWidget : UPopupDataBase
{
	uint8_t PopupButtonType;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)
	struct FText DescMessage;  // 0x38 (0x38)
	struct FString Nickname;  // 0x50 (0x50)
	char pad_96[8];  // 0x60 (0x60)


	bool Cancel(); // Function DungeonCrawler.PopupDataSWidget.Cancel
}; 
 
 


// Class DungeonCrawler.EquipmentSlotWidget
// Size: 0x410(Inherited: 0x300)
struct UEquipmentSlotWidget : UDCWidgetBase
{
	uint8_t EquipmentQuickSlotType;  // 0x300 (0x300)
	char pad_769[3];  // 0x301 (0x301)
	struct FGameplayTag ItemSlotType;  // 0x304 (0x304)
	uint8_t EquipmentSlot;  // 0x30C (0x30C)
	char pad_781[3];  // 0x30D (0x30D)
	struct FLinearColor ValidSlotColor;  // 0x310 (0x310)
	struct FLinearColor InvalidSlotColor;  // 0x320 (0x320)
	struct UScaleBox* ItemWidgetScaleBox;  // 0x330 (0x330)
	struct UGameItemWearingBarWidget* ItemWearingBarWidget;  // 0x338 (0x338)
	struct UTextBlock* ItemCountTextBlock;  // 0x340 (0x340)
	struct UImage* SlotColorImage;  // 0x348 (0x348)
	char pad_848[8];  // 0x350 (0x350)
	struct UItemWidget* ItemWidget;  // 0x358 (0x358)
	UItemWidget* ItemWidgetClass;  // 0x360 (0x360)
	struct FItemData ItemData;  // 0x368 (0x368)
	char pad_1032_1 : 7;  // 0x408 (0x408)
	bool bSetPreview : 1;  // 0x408 (0x408)
	char pad_1033_1 : 7;  // 0x409 (0x409)
	bool bActivated : 1;  // 0x409 (0x409)
	char pad_1034[6];  // 0x40A (0x40A)


	void SetPreviewItemWidget(struct FPrimaryAssetId& ItemId, float Duration); // Function DungeonCrawler.EquipmentSlotWidget.SetPreviewItemWidget
	void SetActiveHoverImage(bool bActivate); // Function DungeonCrawler.EquipmentSlotWidget.SetActiveHoverImage
	void RemovePreviewItemWidget(bool bSetItem); // Function DungeonCrawler.EquipmentSlotWidget.RemovePreviewItemWidget
	void OnRemoveItem(struct FItemData& InItemData); // Function DungeonCrawler.EquipmentSlotWidget.OnRemoveItem
	void OnOverlapItemWidget(struct FPrimaryAssetId& ItemId, bool bValidSlot, bool bCanEquip); // Function DungeonCrawler.EquipmentSlotWidget.OnOverlapItemWidget
	void OnLeaveItemWidget(); // Function DungeonCrawler.EquipmentSlotWidget.OnLeaveItemWidget
	void OnItemSlotActivate(bool bActivate); // Function DungeonCrawler.EquipmentSlotWidget.OnItemSlotActivate
	void OnFinishedItemDataSet(struct FItemData& InItemData, struct FGameplayTag HandType, struct FGameplayTag SlotType, struct FItemInventorySize& InventorySize); // Function DungeonCrawler.EquipmentSlotWidget.OnFinishedItemDataSet
	uint8_t GetEquipmentSlotIndex(); // Function DungeonCrawler.EquipmentSlotWidget.GetEquipmentSlotIndex
	void CheckAndSetActiveHoverImage(); // Function DungeonCrawler.EquipmentSlotWidget.CheckAndSetActiveHoverImage
}; 
 
 


// Class DungeonCrawler.DCArenaGameMode
// Size: 0x4C8(Inherited: 0x4C8)
struct ADCArenaGameMode : ADCIngameGameMode
{


}; 
 
 


// Class DungeonCrawler.CommonPopupSWidget
// Size: 0x478(Inherited: 0x440)
struct UCommonPopupSWidget : UCommonPopupBase
{
	struct UCommonButtonPopupWidget* Btn_Two_Left;  // 0x440 (0x440)
	struct UCommonButtonPopupWidget* Btn_Two_Right;  // 0x448 (0x448)
	struct UCommonButtonPopupWidget* Btn_Single;  // 0x450 (0x450)
	struct UCommonButtonPopupWidget* Btn_Two_Left_DeleteCharacter;  // 0x458 (0x458)
	struct UCommonButtonPopupWidget* Btn_Two_Right_DeleteCharacter;  // 0x460 (0x460)
	struct UEditableText* NicknameText;  // 0x468 (0x468)
	struct UPopupDataSWidget* PopupDataSWidget;  // 0x470 (0x470)


	void OnRemovePopup(); // Function DungeonCrawler.CommonPopupSWidget.OnRemovePopup
	void OnCreatePopup(struct FPopupSWidgetData& PopupSWidgetData); // Function DungeonCrawler.CommonPopupSWidget.OnCreatePopup
	void HandleSingleButtonClicked(); // Function DungeonCrawler.CommonPopupSWidget.HandleSingleButtonClicked
	void HandleRightDeleteCharacterButtonClicked(); // Function DungeonCrawler.CommonPopupSWidget.HandleRightDeleteCharacterButtonClicked
	void HandleRightButtonClicked(); // Function DungeonCrawler.CommonPopupSWidget.HandleRightButtonClicked
	void HandleLeftDeleteCharacterButtonClicked(); // Function DungeonCrawler.CommonPopupSWidget.HandleLeftDeleteCharacterButtonClicked
	void HandleLeftButtonClicked(); // Function DungeonCrawler.CommonPopupSWidget.HandleLeftButtonClicked
}; 
 
 


// Class DungeonCrawler.ContainerSlotWidget
// Size: 0x338(Inherited: 0x300)
struct UContainerSlotWidget : UDCWidgetBase
{
	struct FLinearColor ItemSetColor;  // 0x7FF7D3428690 (0x16FAD03EBC0) (0x7FF7D3428690 (0x16FAD03EBC0))
	struct FLinearColor InvalidSlotColor;  // 0x310 (0x310)
	struct FLinearColor ValidSlotColor;  // 0x320 (0x320)
	char pad_816_1 : 7;  // 0x330 (0x330)
	bool bHasItem : 1;  // 0x330 (0x330)
	char pad_817[7];  // 0x331 (0x331)


	void OnSetNewItem(bool bFullfilledAll); // Function DungeonCrawler.ContainerSlotWidget.OnSetNewItem
	void OnRemoveItem(); // Function DungeonCrawler.ContainerSlotWidget.OnRemoveItem
	void OnOverlapItemWidget(bool bCanSetItem); // Function DungeonCrawler.ContainerSlotWidget.OnOverlapItemWidget
	void OnLeaveItemWidget(); // Function DungeonCrawler.ContainerSlotWidget.OnLeaveItemWidget
}; 
 
 


// Class DungeonCrawler.DCItemSkinArtData
// Size: 0x1A0(Inherited: 0x118)
struct UDCItemSkinArtData : UArtDataUtility
{
	struct UTexture2D* ItemSkinIconTexture;  // 0x118 (0x118)
	AActor* ItemSkinPreviewActorClass;  // 0x120 (0x120)
	struct FRotator ItemSkinPreviewRotation;  // 0x128 (0x128)
	struct FTransform PreviewCameraTransform;  // 0x140 (0x140)


}; 
 
 


// Class DungeonCrawler.ContextMenuHolderInterface
// Size: 0x28(Inherited: 0x28)
struct UContextMenuHolderInterface : UInterface
{


	void OnRightClicked(); // Function DungeonCrawler.ContextMenuHolderInterface.OnRightClicked
}; 
 
 


// Class DungeonCrawler.DCMovementModifierContainerData
// Size: 0x80(Inherited: 0x30)
struct UDCMovementModifierContainerData : UDataAsset
{
	struct TMap<struct FGameplayTag, struct FDCMovementModiferContainer> MovementModifierContainer;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.ContextMenuWidgetBase
// Size: 0x318(Inherited: 0x300)
struct UContextMenuWidgetBase : UDCWidgetBase
{
	struct UListView* ListView_ContextOptions;  // 0x300 (0x300)
	struct UOverlay* Overlay_ContextMenu;  // 0x0 ( (0x0 (0x0))
	char pad_784_1 : 7;  // 0x310 (0x310)
	bool bSetPosition : 1;  // 0x310 (0x310)
	char pad_785[7];  // 0x311 (0x311)


	void SetContextMenuWidgetPosition(); // Function DungeonCrawler.ContextMenuWidgetBase.SetContextMenuWidgetPosition
	void RequestCloseMenu(); // Function DungeonCrawler.ContextMenuWidgetBase.RequestCloseMenu
}; 
 
 


// Class DungeonCrawler.GameplayTagMessageRelationshipData
// Size: 0x80(Inherited: 0x30)
struct UGameplayTagMessageRelationshipData : UDataAsset
{
	struct TMap<struct FGameplayTag, struct FText> GameplayTagMessageRelationshipData;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.ContextOptionListEntryWidgetData
// Size: 0x30(Inherited: 0x28)
struct UContextOptionListEntryWidgetData : UObject
{
	uint8_t ContextOption;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)


}; 
 
 


// Class DungeonCrawler.DCDataAsset
// Size: 0x38(Inherited: 0x30)
struct UDCDataAsset : UPrimaryDataAsset
{
	struct FPrimaryAssetType AssetType;  // 0x30 (0x30)


}; 
 
 


// Class DungeonCrawler.DCReadOnlyValidator
// Size: 0x30(Inherited: 0x30)
struct UDCReadOnlyValidator : UDCInventoryValidatorBase
{


}; 
 
 


// Class DungeonCrawler.DCDataBlueprintLibrary
// Size: 0x28(Inherited: 0x28)
struct UDCDataBlueprintLibrary : UBlueprintFunctionLibrary
{


	int64_t MakeUniqueId(); // Function DungeonCrawler.DCDataBlueprintLibrary.MakeUniqueId
	struct FString MakePrimaryAssetIdStr(struct FPrimaryAssetId& PrimaryAssetId); // Function DungeonCrawler.DCDataBlueprintLibrary.MakePrimaryAssetIdStr
	struct FPrimaryAssetId MakePrimaryAssetId(struct FString PrimaryAssetIdStr); // Function DungeonCrawler.DCDataBlueprintLibrary.MakePrimaryAssetId
	void LoadPrimaryAsset(struct FPrimaryAssetId InPrimaryAssetId, struct FDelegate& InOnComplete); // Function DungeonCrawler.DCDataBlueprintLibrary.LoadPrimaryAsset
	struct TArray<struct UObject*> LoadObjectLibrary(struct FString Path, UObject* ObjectClass); // Function DungeonCrawler.DCDataBlueprintLibrary.LoadObjectLibrary
	bool IsStreamingMode(); // Function DungeonCrawler.DCDataBlueprintLibrary.IsStreamingMode
	bool IsAvailableInteractionWithDCCharacterBase(struct ADCPlayerCharacterBase* Interacter, struct ADCCharacterBase* DstActor, float& OutXYDistance); // Function DungeonCrawler.DCDataBlueprintLibrary.IsAvailableInteractionWithDCCharacterBase
	bool IsAvailableInteraction(struct ADCPlayerCharacterBase* Interacter, struct AActor* DstActor, struct FHitResult& InHitResult, float& OutDistance); // Function DungeonCrawler.DCDataBlueprintLibrary.IsAvailableInteraction
	struct FLinearColor GetViewNicknameColor(struct FNickname& Nickname); // Function DungeonCrawler.DCDataBlueprintLibrary.GetViewNicknameColor
	struct FString GetViewNickname(struct FNickname& Nickname); // Function DungeonCrawler.DCDataBlueprintLibrary.GetViewNickname
	struct FPrimaryAssetId GetRandomDesignDataItemId(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetRandomDesignDataItemId
	struct UPrimaryDataAsset* GetPrimaryAssetSync(struct FPrimaryAssetId& PrimaryAssetId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetPrimaryAssetSync
	void GetLobbyEmoteIdArray(struct TArray<struct FPrimaryAssetId>& OutLobbyEmoteIdArray); // Function DungeonCrawler.DCDataBlueprintLibrary.GetLobbyEmoteIdArray
	struct TMap<struct FGameplayTag, struct FText> GetItemWeaponTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemWeaponTypeTextMap
	struct TMap<struct FGameplayTag, struct FText> GetItemUtilityTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemUtilityTypeTextMap
	struct FText GetItemTypeText(struct FGameplayTag& InTypeTag); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemTypeText
	void GetItemTypeChatFilterTagContainerMaps(struct UDCChatRoomDataAsset* InChatRoomData, struct TMap<struct FGameplayTag, struct FGameplayTagContainer>& OutTypeIdTagChatFilterTagContainerMap, struct TMap<struct FGameplayTag, struct FGameplayTagContainer>& OutTypeRarityChatFilterTagContainerMap, struct TMap<struct FGameplayTag, struct FGameplayTagContainer>& OutPropertyChatFilterTagContainerMap); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemTypeChatFilterTagContainerMaps
	struct TMap<struct FGameplayTag, struct FText> GetItemSlotTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemSlotTypeTextMap
	void GetItemSkinIdArray(struct TArray<struct FPrimaryAssetId>& OutItemSkinIdArray); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemSkinIdArray
	struct TMap<struct FGameplayTag, struct FText> GetItemRarityTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemRarityTypeTextMap
	struct FText GetItemRarityText(struct FGameplayTag& InItemRarityTag); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemRarityText
	struct TMap<struct FGameplayTag, struct FText> GetItemPropertyTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemPropertyTypeTextMap
	struct FText GetItemPropertyTypeText(struct FGameplayTag& InItemPropertyTypeTag); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemPropertyTypeText
	struct FPrimaryAssetId GetItemPropertyTypeId_Unidentified(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemPropertyTypeId_Unidentified
	struct TMap<struct FGameplayTag, struct FText> GetItemMiscTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemMiscTypeTextMap
	struct FText GetItemIdTagText(struct FGameplayTag& InIdTag); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemIdTagText
	struct TMap<struct FGameplayTag, struct FText> GetItemHandTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemHandTypeTextMap
	struct TMap<struct FGameplayTag, struct FText> GetItemEffectTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemEffectTypeTextMap
	struct UArtDataItem* GetItemArtData(struct FItemData& ItemData); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemArtData
	struct TMap<struct FGameplayTag, struct FText> GetItemArmorTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemArmorTypeTextMap
	AItemActor* GetItemActorClass(struct AActor* OwnerActor, struct FItemData& ItemData); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemActorClass
	struct TMap<struct FGameplayTag, struct FText> GetItemAccessoryTypeTextMap(); // Function DungeonCrawler.DCDataBlueprintLibrary.GetItemAccessoryTypeTextMap
	void GetEmoteIdArray(struct TArray<struct FPrimaryAssetId>& OutEmoteIdArray); // Function DungeonCrawler.DCDataBlueprintLibrary.GetEmoteIdArray
	void GetDesignDataSpellMap(struct TMap<struct FPrimaryAssetId, struct FDesignDataSpell>& OutDesignDataSpellMap); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataSpellMap
	struct FDesignDataSpell GetDesignDataSpell(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataSpell
	void GetDesignDataSkillMap(struct TMap<struct FPrimaryAssetId, struct FDesignDataSkill>& OutDesignDataSkillMap); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataSkillMap
	struct FDesignDataSkill GetDesignDataSkill(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataSkill
	struct FDesignDataPropsSkillCheck GetDesignDataPropsSkillCheck(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataPropsSkillCheck
	struct FDesignDataPropsInteract GetDesignDataPropsInteract(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataPropsInteract
	struct FDesignDataProps GetDesignDataProps(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataProps
	void GetDesignDataPlayerCharacterMap(struct TMap<struct FPrimaryAssetId, struct FDesignDataPlayerCharacter>& OutDesignDataPlayerCharacterMap); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataPlayerCharacterMap
	struct FDesignDataPlayerCharacter GetDesignDataPlayerCharacter(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataPlayerCharacter
	void GetDesignDataPerkMap(struct TMap<struct FPrimaryAssetId, struct FDesignDataPerk>& OutDesignDataPerkMap); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataPerkMap
	struct FDesignDataPerk GetDesignDataPerk(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataPerk
	void GetDesignDataMusicMap(struct TMap<struct FPrimaryAssetId, struct FDesignDataMusic>& OutDesignDataMusicMap); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataMusicMap
	struct FDesignDataMusic GetDesignDataMusic(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataMusic
	struct FDesignDataMovementModifier GetDesignDataMovementModifier(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataMovementModifier
	struct FDesignDataMonster GetDesignDataMonster(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataMonster
	struct FDesignDataMeleeAttack GetDesignDataMeleeAttack(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataMeleeAttack
	struct FDesignDataItemRequirement GetDesignDataItemRequirement(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataItemRequirement
	struct FDesignDataItemPropertyType GetDesignDataItemPropertyType(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataItemPropertyType
	struct FDesignDataItemProperty GetDesignDataItemProperty(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataItemProperty
	struct TArray<struct FPrimaryAssetId> GetDesignDataItemIdsByGameplayTag(struct FGameplayTag ItemGameplayTag); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataItemIdsByGameplayTag
	struct FDesignDataItemContainer GetDesignDataItemContainer(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataItemContainer
	struct FDesignDataItemConsume GetDesignDataItemConsume(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataItemConsume
	struct FDesignDataItem GetDesignDataItem(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataItem
	struct FDesignDataIdTagGroup GetDesignDataIdTagGroup(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataIdTagGroup
	struct FDesignDataGameplayEffect GetDesignDataGameplayEffect(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataGameplayEffect
	struct FDesignDataGameplayAbility GetDesignDataGameplayAbility(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataGameplayAbility
	struct FDesignDataEmote GetDesignDataEmote(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataEmote
	struct FDesignDataBaseItem GetDesignDataBaseItem(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataBaseItem
	struct UDesignDataAssetItemRequirement* GetDesignDataAssetItemRequirement(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDesignDataAssetItemRequirement
	struct UDescData* GetDescData(struct FPrimaryAssetId& InId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetDescData
	int32_t GetConstantInt32(struct FPrimaryAssetId& InConstantId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetConstantInt32
	float GetConstantFloat(struct FPrimaryAssetId& InConstantId); // Function DungeonCrawler.DCDataBlueprintLibrary.GetConstantFloat
	void GetCharacterSkinIdArray(struct TArray<struct FPrimaryAssetId>& OutCharacterSkinIdArray); // Function DungeonCrawler.DCDataBlueprintLibrary.GetCharacterSkinIdArray
	void GetCharacterBaseItemMap(struct FPrimaryAssetId& InId, struct TMap<struct FPrimaryAssetId, int32_t>& BaseItemMap); // Function DungeonCrawler.DCDataBlueprintLibrary.GetCharacterBaseItemMap
	void GetActionSkinIdArray(struct TArray<struct FPrimaryAssetId>& OutActionSkinIdArray); // Function DungeonCrawler.DCDataBlueprintLibrary.GetActionSkinIdArray
}; 
 
 


// Class DungeonCrawler.DCGameModeAIControllerDungeonCrawlBase
// Size: 0x4A0(Inherited: 0x430)
struct ADCGameModeAIControllerDungeonCrawlBase : ADCGameModeAIControllerDungeonBase
{
	struct FPlayerPointData DownPlayerPointData;  // 0x430 (0x430)


}; 
 
 


// Class DungeonCrawler.DCPropsDataAsset
// Size: 0xD8(Inherited: 0x38)
struct UDCPropsDataAsset : UDCTableDataAsset
{
	struct FText Name;  // 0x38 (0x38)
	struct TSoftObjectPtr<USoundData> SoundData;  // 0x50 (0x50)
	APropsActorBase* ActorClass;  // 0x80 (0x80)
	int32_t InteractionMinCount;  // 0x88 (0x88)
	int32_t InteractionMaxCount;  // 0x8C (0x8C)
	struct TArray<struct TSoftObjectPtr<UDCPropsInteractDataAsset>> InteractionSettingDatas;  // 0x90 (0x90)
	struct TArray<struct TSoftObjectPtr<UTagQueryData>> DestructibleTagQueryData;  // 0xA0 (0xA0)
	struct TArray<struct TSoftObjectPtr<UDCGameplayAbilityDataAsset>> Abilities;  // 0xB0 (0xB0)
	struct TArray<struct TSoftObjectPtr<UDCGameplayEffectDataAsset>> Effects;  // 0xC0 (0xC0)
	int32_t AdvPoint;  // 0xD0 (0xD0)
	int32_t ExpPoint;  // 0xD4 (0xD4)


}; 
 
 


// Class DungeonCrawler.ContextOptionListEntryWidgetBase
// Size: 0x1590(Inherited: 0x1580)
struct UContextOptionListEntryWidgetBase : UDCCommonButtonBase
{
	char pad_5504[16];  // 0x1580 (0x1580)


	void OnSelect(); // Function DungeonCrawler.ContextOptionListEntryWidgetBase.OnSelect
}; 
 
 


// Class DungeonCrawler.DCShopItemSlotWidget
// Size: 0x448(Inherited: 0x368)
struct UDCShopItemSlotWidget : UDCControlWidgetBase
{
	char pad_872[24];  // 0x368 (0x368)
	struct FText ShopItemNameText;  // 0x380 (0x380)
	struct TArray<struct FText> ShopItemDescTextArray;  // 0x398 (0x398)
	struct FText ShopItemFlavorText;  // 0x3A8 (0x3A8)
	struct FText ShopItemTypeText;  // 0x3C0 (0x3C0)
	struct FText SalesChannelText;  // 0x3D8 (0x3D8)
	struct UTexture2D* ShopItemIconTexture;  // 0x3F0 (0x3F0)
	int32_t Price;  // 0x3F8 (0x3F8)
	int32_t CashPrice;  // 0x3FC (0x3FC)
	UDCGameTooltipWithFlavorTextWidget* TooltipWidgetClass;  // 0x400 (0x400)
	struct FSlateColor TooltipColor;  // 0x408 (0x408)
	char pad_1052_1 : 7;  // 0x41C (0x41C)
	bool bIsSelected : 1;  // 0x41C (0x41C)
	char pad_1053_1 : 7;  // 0x41D (0x41D)
	bool bIsPurchased : 1;  // 0x41D (0x41D)
	char pad_1054_1 : 7;  // 0x41E (0x41E)
	bool bIsExperimental : 1;  // 0x41E (0x41E)
	uint8_t SalesChannelType;  // 0x41F (0x41F)
	char pad_1056[32];  // 0x420 (0x420)
	struct UDCGameTooltipWithFlavorTextWidget* ShopItemTooltipWidget;  // 0x440 (0x440)


	struct UUserWidget* GetTooltipWidget(); // Function DungeonCrawler.DCShopItemSlotWidget.GetTooltipWidget
}; 
 
 


// Class DungeonCrawler.ItemWidget
// Size: 0x3D0(Inherited: 0x300)
struct UItemWidget : UDCWidgetBase
{
	struct UImage* ItemIconImage;  // 0x300 (0x300)
	struct USizeBox* ItemIconSizeBox;  // 0x308 (0x308)
	struct TWeakObjectPtr<AActor> ItemOwnedActor;  // 0x310 (0x310)
	float WidgetOriginalSize;  // 0x318 (0x318)
	char pad_796[20];  // 0x31C (0x31C)
	struct FItemWidgetData WidgetData;  // 0x330 (0x330)


	void SetItemOwnerActor(struct AActor* InItemOwnedActor); // Function DungeonCrawler.ItemWidget.SetItemOwnerActor
	void SetItemIcon(struct UTexture2D* ItemIconTexture, struct FItemInventorySize& ItemInventorySize); // Function DungeonCrawler.ItemWidget.SetItemIcon
	void SetItemData(struct FItemData& NewItemData); // Function DungeonCrawler.ItemWidget.SetItemData
	void OnSetItemRequirementsFulfilledStatus(bool bFufilled, struct FPrimaryAssetId& PlayerCharacterId, struct UDCAttributeSet* AttributeSet, struct TArray<struct FPrimaryAssetId>& PerkIdArray); // Function DungeonCrawler.ItemWidget.OnSetItemRequirementsFulfilledStatus
	void OnItemData(struct FItemData& NewItemData, struct FItemData& OldItemData); // Function DungeonCrawler.ItemWidget.OnItemData
	struct UImage* GetItemIconImage(); // Function DungeonCrawler.ItemWidget.GetItemIconImage
	struct FItemData GetItemData(); // Function DungeonCrawler.ItemWidget.GetItemData
}; 
 
 


// Class DungeonCrawler.ControllableItemWidget
// Size: 0x3D0(Inherited: 0x3D0)
struct UControllableItemWidget : UItemWidget
{


	void QuickMoveItem(); // Function DungeonCrawler.ControllableItemWidget.QuickMoveItem
	struct FEventReply OnRightMouseButtonDown(struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, bool bInventoryDropButtonPressed, bool bInventorySplitButtonPressed); // Function DungeonCrawler.ControllableItemWidget.OnRightMouseButtonDown
	struct FEventReply OnLeftMouseButtonDown(struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent); // Function DungeonCrawler.ControllableItemWidget.OnLeftMouseButtonDown
	struct FEventReply OnLeftMouseButtonDoubleClick(); // Function DungeonCrawler.ControllableItemWidget.OnLeftMouseButtonDoubleClick
	void DropOneItem(); // Function DungeonCrawler.ControllableItemWidget.DropOneItem
	void DropAllItem(); // Function DungeonCrawler.ControllableItemWidget.DropAllItem
}; 
 
 


// Class DungeonCrawler.DCActorBase
// Size: 0x2F0(Inherited: 0x290)
struct ADCActorBase : AActor
{
	char pad_656[88];  // 0x290 (0x290)
	struct UBaseObject* BaseObject;  // 0x2E8 (0x2E8)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCActorBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCActorBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCActorBase.TerminateBase
	void ReceivePreInitializeComponents(); // Function DungeonCrawler.DCActorBase.ReceivePreInitializeComponents
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCActorBase.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.EquipmentWeaponSlotSetWidget
// Size: 0x4E0(Inherited: 0x410)
struct UEquipmentWeaponSlotSetWidget : UEquipmentSlotWidget
{
	struct UScaleBox* SecondaryItemWidgetScaleBox;  // 0x410 (0x410)
	struct UItemWidget* SecondaryItemWidget;  // 0x418 (0x418)
	struct UWidget* PrimarySlot;  // 0x420 (0x420)
	struct UWidget* SecondarySlot;  // 0x428 (0x428)
	struct FItemData SecondaryItemData;  // 0x430 (0x430)
	struct UImage* SecondarySlotColorImage;  // 0x4D0 (0x4D0)
	uint8_t SecondaryEquipmentSlotId;  // 0x4D8 (0x4D8)
	char pad_1241[7];  // 0x4D9 (0x4D9)


	void SetActiveSecondaryHoverImage(bool bActivate); // Function DungeonCrawler.EquipmentWeaponSlotSetWidget.SetActiveSecondaryHoverImage
	void SetActivePrimaryHoverImage(bool bActivate); // Function DungeonCrawler.EquipmentWeaponSlotSetWidget.SetActivePrimaryHoverImage
	void CheckAndSetActiveHoverImageBySlot(struct UWidget* SlotUnderPointerPosition); // Function DungeonCrawler.EquipmentWeaponSlotSetWidget.CheckAndSetActiveHoverImageBySlot
}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationSkillVictoryStrike
// Size: 0xC0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationSkillVictoryStrike : UGameplayModMagnitudeCalculation
{
	char pad_64[128];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCInteractableActorBase
// Size: 0x300(Inherited: 0x2F0)
struct ADCInteractableActorBase : ADCActorBase
{
	char pad_752[8];  // 0x2F0 (0x2F0)
	struct UInteractableTargetComponent* InteractableTargetComponent;  // 0x2F8 (0x2F8)


	void InteractSucceed(struct AActor* Interacter, struct FGameplayTag StateTag, struct FGameplayTag TriggerTag, struct FHitResult HitResult); // Function DungeonCrawler.DCInteractableActorBase.InteractSucceed
	void InteractStarted(struct AActor* Interacter, struct FGameplayTag EventTag); // Function DungeonCrawler.DCInteractableActorBase.InteractStarted
	void InteractLost(struct AActor* Interacter); // Function DungeonCrawler.DCInteractableActorBase.InteractLost
	void InteractFound(struct AActor* Interacter, struct UPrimitiveComponent* InteractPart); // Function DungeonCrawler.DCInteractableActorBase.InteractFound
	void InteractFailed(struct AActor* Interacter, struct FGameplayTag EventTag); // Function DungeonCrawler.DCInteractableActorBase.InteractFailed
}; 
 
 


// Class DungeonCrawler.DCAbilitySystemBlueprintLibrary
// Size: 0x28(Inherited: 0x28)
struct UDCAbilitySystemBlueprintLibrary : UAbilitySystemBlueprintLibrary
{


	bool SetMovementStateGameplayTag(struct AActor* InActor, struct FGameplayTag InGameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.SetMovementStateGameplayTag
	bool SetModeGameplayTag(struct AActor* InActor, struct FGameplayTag InGameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.SetModeGameplayTag
	bool SetAnimationStateGameplayTag(struct AActor* InActor, struct FGameplayTag InGameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.SetAnimationStateGameplayTag
	void SendGameplayEventToActorOverride(struct AActor* Actor, struct FGameplayTag EventTag, struct TArray<struct FDCGameplayEffectData>& InOverrideGameplayEffectDataArray); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.SendGameplayEventToActorOverride
	void RemoveLooseGameplayTagAll(struct AActor* InActor, struct FGameplayTag GameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.RemoveLooseGameplayTagAll
	bool RemoveGameplayTag(struct AActor* InActor, struct FGameplayTag InGameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.RemoveGameplayTag
	void RemoveGameplayCueLocal(struct AActor* InActor, struct FGameplayTag GameplayCueTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.RemoveGameplayCueLocal
	void RemoveGameplayCue(struct AActor* InActor, struct FGameplayTag GameplayCueTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.RemoveGameplayCue
	struct FGameplayTag ParseOptionGameplayTag(struct FString InOptionStr, struct FString InOptionKey); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.ParseOptionGameplayTag
	void MessageNotifyByReasonTagContainer(struct AActor* InActor, struct FGameplayTagContainer& InGameplayTags, float MsgDuration); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.MessageNotifyByReasonTagContainer
	void MessageNotifyByReasonTag(struct AActor* InActor, struct FGameplayTag& InGameplayTag, float MsgDuration); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.MessageNotifyByReasonTag
	bool MatchesQuery(struct AActor* InActor, struct FGameplayTagQuery InTagQuery); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.MatchesQuery
	bool IsTargetSightBlocked(struct AActor* InActor, struct AActor* InTarget); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.IsTargetSightBlocked
	bool IsSameTeamWithPlayerCharacter(struct AActor* SourcePlayerCharacter, struct AActor* TargetActor); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.IsSameTeamWithPlayerCharacter
	bool IsMatchingAbilityActivated(struct AActor* InActor, struct FGameplayTag InGameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.IsMatchingAbilityActivated
	struct FGameplayAbilitySpecHandle GiveAbility(struct UObject* SourceObject, struct AActor* InActor, struct FDCGameplayAbilityData& InGameplayAbilityData, bool bTriggerOnlyOnce); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GiveAbility
	struct TArray<struct FGameplayAbilitySpecHandle> GiveAbilities(struct UObject* SourceObject, struct AActor* InActor, struct TArray<struct FDCGameplayAbilityData>& InGameplayAbilityDataArray, bool bTriggerOnlyOnce); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GiveAbilities
	void GetSocketLocationBySocketName(struct FName SocketName, struct UObject* Object, struct AActor* AvatarActor, struct FVector& OutSocketLocation); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetSocketLocationBySocketName
	float GetSetByCallerValueInContainerSpecArray(struct FGameplayTag InEventTag, struct FGameplayTag InSetByCallerDataTag, struct TArray<struct FDCGameplayEffectContainerSpec>& InEffectHandle); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetSetByCallerValueInContainerSpecArray
	float GetSetByCallerValueInContainer(struct FGameplayTag InEventTag, struct FGameplayTag InSetByCallerDataTag, struct TArray<struct FDCGameplayEffectContainer>& InEffectContainer); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetSetByCallerValueInContainer
	float GetSetByCallerValueInAbilityIds(struct FGameplayTag InEventTag, struct FGameplayTag InSetByCallerDataTag, struct TArray<struct FPrimaryAssetId>& InAbilities); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetSetByCallerValueInAbilityIds
	float GetProjectileDamageCurveFloatValue(struct FGameplayEffectSpec& InSpec); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetProjectileDamageCurveFloatValue
	void GetOwnedGameplayTags(struct AActor* InActor, struct FGameplayTagContainer& TagContainer); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetOwnedGameplayTags
	float GetMeleeAttackAbilityDamageRatioFromEffectSpec(struct FGameplayEffectSpec& InSpec); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetMeleeAttackAbilityDamageRatioFromEffectSpec
	float GetMeleeAttackAbilityDamageRatioFromDesignData(struct FDesignDataGameplayAbility& DesignDataGameplayAbility); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetMeleeAttackAbilityDamageRatioFromDesignData
	struct TArray<struct FGameplayTag> GetMatchingAbilityActivatedTriggers(struct AActor* InActor, struct FGameplayTag InGameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetMatchingAbilityActivatedTriggers
	int32_t GetMatchingAbilityActivatedCount(struct AActor* InActor, struct FGameplayTag InGameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetMatchingAbilityActivatedCount
	void GetItemDataFromDesignData(struct FDesignDataItem& InDesignDataItem, struct FItemData& OutItemData); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetItemDataFromDesignData
	struct FGameplayTagContainer GetGrantedTag(struct FGameplayEffectSpecHandle SpecHandle); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetGrantedTag
	float GetGameplayEffectSetByCallerValue(struct FGameplayTag InSetByCallerTag, int32_t InSetByCallerValue); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetGameplayEffectSetByCallerValue
	void GetGameplayEffectDescDataItem(struct FDesignDataItem& InDesignDataItem, struct FDesignDataGameplayEffect& InDesignDataGameplayEffect, struct FItemDataGameplayEffect& InItemDataGameplayEffect, struct TArray<struct FGameplayEffectDescData>& OutGameplayEffectDescDataArray); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetGameplayEffectDescDataItem
	void GetGameplayEffectDescData(struct FDesignDataGameplayEffect& InDesignDataGameplayEffect, struct TArray<struct FGameplayEffectDescData>& OutGameplayEffectDescDataArray); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetGameplayEffectDescData
	void GetGameplayEffectData(struct FDesignDataGameplayEffect& InDesignDataGameplayEffect, struct FDCGameplayEffectData& OutGameplayEffectData); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetGameplayEffectData
	void GetGameplayDataFromDesignDataSpell(struct FDesignDataSpell& InDesignDataSpell, struct TArray<struct FDCGameplayAbilityData>& OutGameplayAbilityDataArray, struct TArray<struct FDCGameplayEffectData>& OutGameplayEffectDataArray); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetGameplayDataFromDesignDataSpell
	void GetGameplayDataFromDesignDataSkill(struct FDesignDataSkill& InDesignDataSkill, struct TArray<struct FDCGameplayAbilityData>& OutGameplayAbilityDataArray, struct TArray<struct FDCGameplayEffectData>& OutGameplayEffectDataArray); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetGameplayDataFromDesignDataSkill
	void GetGameplayAbilityData(struct FDesignDataGameplayAbility& InDesignDataGameplayAbility, struct FDCGameplayAbilityData& OutGameplayAbilityData); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetGameplayAbilityData
	void GetEffectSpec(struct FGameplayEffectSpecHandle SpecHandle, struct FGameplayEffectSpec& OutEffectSpec); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetEffectSpec
	struct FName GetCurrentMontageSectionName(struct AActor* InActor); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetCurrentMontageSectionName
	void GetBoundingBoxPointsLocation(struct AActor* InActor, struct AActor* InTarget, struct FVector& OutTop, struct FVector& OutBottom, struct FVector& OutLeft, struct FVector& OutRight, struct FVector& OutCenter); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetBoundingBoxPointsLocation
	struct FText GetAttributeDisplayName(struct UObject* WorldContextObject, struct FGameplayAttribute& Attribute); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetAttributeDisplayName
	float GetActorAttributeValue(struct AActor* InActor, struct FGameplayAttribute InAttribute); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.GetActorAttributeValue
	struct USkeletalMeshComponent* FindSocketOwningMeshComponent(struct FName SocketName, struct UObject* Object, struct AActor* AvatarActor); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.FindSocketOwningMeshComponent
	void ExecuteGameplayCueLocal(struct AActor* InActor, struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.ExecuteGameplayCueLocal
	void ExecuteGameplayCue(struct AActor* InActor, struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.ExecuteGameplayCue
	void EffectContextSetSoundDataPrimaryAssetId(struct FGameplayEffectContextHandle EffectContext, struct FPrimaryAssetId PrimaryAssetId); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.EffectContextSetSoundDataPrimaryAssetId
	struct FPrimaryAssetId EffectContextGetSoundDataPrimaryAssetId(struct FGameplayEffectContextHandle EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.EffectContextGetSoundDataPrimaryAssetId
	struct USoundData* EffectContextGetSoundData(struct FGameplayEffectContextHandle EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.EffectContextGetSoundData
	struct TArray<struct FItemData> EffectContextGetItemDatas(struct FGameplayEffectContextHandle EffectContextHandle); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.EffectContextGetItemDatas
	void DCEffectContextSetSoundDataPrimaryAssetId(struct FDCGameplayEffectContext EffectContext, struct FPrimaryAssetId PrimaryAssetId); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextSetSoundDataPrimaryAssetId
	void DCEffectContextSetOrigin(struct FDCGameplayEffectContext EffectContext, struct FVector Origin); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextSetOrigin
	bool DCEffectContextHasHitResult(struct FDCGameplayEffectContext EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextHasHitResult
	struct UObject* DCEffectContextGetSourceObject(struct FDCGameplayEffectContext EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextGetSourceObject
	struct FPrimaryAssetId DCEffectContextGetSoundDataPrimaryAssetId(struct FDCGameplayEffectContext EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextGetSoundDataPrimaryAssetId
	struct AActor* DCEffectContextGetOriginalInstigatorActor(struct FDCGameplayEffectContext EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextGetOriginalInstigatorActor
	struct FVector DCEffectContextGetOrigin(struct FDCGameplayEffectContext EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextGetOrigin
	struct AActor* DCEffectContextGetInstigatorActor(struct FDCGameplayEffectContext EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextGetInstigatorActor
	struct FHitResult DCEffectContextGetHitResult(struct FDCGameplayEffectContext EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextGetHitResult
	struct AActor* DCEffectContextGetEffectCauser(struct FDCGameplayEffectContext EffectContext); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextGetEffectCauser
	void DCEffectContextAddHitResult(struct FDCGameplayEffectContext EffectContext, struct FHitResult HitResult, bool bReset); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.DCEffectContextAddHitResult
	void ClearAllAbilities(struct AActor* InActor); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.ClearAllAbilities
	void CancelAllAbilities(struct AActor* InActor); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.CancelAllAbilities
	struct TArray<struct FActiveGameplayEffectHandle> ApplyPremadeSpecArray(struct AActor* InActor, struct FGameplayTag ContainerTag, struct FGameplayEventData& EventData); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.ApplyPremadeSpecArray
	struct TArray<struct FActiveGameplayEffectHandle> ApplyGameplayEffects(struct AActor* InActor, struct TArray<struct FDCGameplayEffectData>& InGameplayEffectDataArray, struct AActor* InSourceActor); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.ApplyGameplayEffects
	struct TArray<struct FActiveGameplayEffectHandle> ApplyGameplayEffectByIds(struct AActor* InActor, struct TArray<struct FPrimaryAssetId>& InGameplayEffectIdArray, struct AActor* InSourceActor); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.ApplyGameplayEffectByIds
	struct FActiveGameplayEffectHandle ApplyGameplayEffect(struct AActor* InActor, struct FDesignDataGameplayEffect& InDesignDataGameplayEffect, struct AActor* InSourceActor); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.ApplyGameplayEffect
	struct TArray<struct FActiveGameplayEffectHandle> ApplyEffectContainerSpec(struct FDCGameplayEffectContainerSpec& ContainerSpec); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.ApplyEffectContainerSpec
	void AimSphereWithActorViewPoint(struct AActor* InActor, float Radius, struct TArray<struct FHitResult>& OutHitResults, enum class ECollisionChannel TraceChannel, float MaxRange); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.AimSphereWithActorViewPoint
	void AimLineWithActorViewPointToPoint(struct AActor* InActor, struct FVector& TraceEnd, struct TArray<struct FHitResult>& OutHitResults, enum class ECollisionChannel TraceChannel); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.AimLineWithActorViewPointToPoint
	void AimLineWithActorViewPoint(struct AActor* InActor, struct TArray<struct FHitResult>& OutHitResults, enum class ECollisionChannel TraceChannel, float MaxRange); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.AimLineWithActorViewPoint
	void AddLooseGameplayTag(struct AActor* InActor, struct FGameplayTag GameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.AddLooseGameplayTag
	bool AddGameplayTag(struct AActor* InActor, struct FGameplayTag InGameplayTag); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.AddGameplayTag
	void AddGameplayCueLocal(struct AActor* InActor, struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.AddGameplayCueLocal
	void AddGameplayCue(struct AActor* InActor, struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function DungeonCrawler.DCAbilitySystemBlueprintLibrary.AddGameplayCue
}; 
 
 


// Class DungeonCrawler.DCAbilitySystemComponent
// Size: 0x1938(Inherited: 0x13A0)
struct UDCAbilitySystemComponent : UAbilitySystemComponent
{
	char pad_5024[168];  // 0x13A0 (0x13A0)
	struct FActorDieData ActorDieData;  // 0x1448 (0x1448)
	struct FImpactEnduranceExhaustedData ImpactEnduranceExhaustedData;  // 0x1630 (0x1630)
	char pad_6168[112];  // 0x1818 (0x1818)
	struct TArray<struct FDCGameplayAbilityHandleData> AbilityHandleDataArray;  // 0x1888 (0x1888)
	char pad_6296[80];  // 0x1898 (0x1898)
	struct UGameplayAbilityRelationshipData* AbilityTagRelationship;  // 0x18E8 (0x18E8)
	struct UGameplayTagMessageRelationshipData* GameplayTagMessageRelationshipData;  // 0x18F0 (0x18F0)
	struct UGameplayCueRelationshipData* GameplayCueRelationship;  // 0x18F8 (0x18F8)
	struct UGameplayCueRelationshipData* OverrideGameplayCueRelationship;  // 0x1900 (0x1900)
	struct TArray<struct FDCGameplayEffectContainerSpec> PremadeContainerSpecArray;  // 0x1908 (0x1908)
	struct TArray<struct UTagQueryData*> HitTagQueryDataArray;  // 0x1918 (0x1918)
	struct TArray<struct UTagQueryData*> BeHitTagQueryDataArray;  // 0x1928 (0x1928)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCAbilitySystemComponent.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCAbilitySystemComponent.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCAbilitySystemComponent.TerminateBase
	void SetTagQueryData(struct TArray<struct FPrimaryAssetId> InHitTagQueryDataIdArray, struct TArray<struct FPrimaryAssetId> InBeHitTagQueryDataIdArray); // Function DungeonCrawler.DCAbilitySystemComponent.SetTagQueryData
	void RemoveGameplayCueLocal(struct FGameplayTag GameplayCueTag); // Function DungeonCrawler.DCAbilitySystemComponent.RemoveGameplayCueLocal
	void PlayMontageOnSourceObject(struct UGameplayAbility* InAnimatingAbility, struct FGameplayAbilityActivationInfo ActivationInfo, struct UAnimMontage* NewAnimMontage, float InPlayRate, struct FName StartSectionName, float StartTimeSeconds); // Function DungeonCrawler.DCAbilitySystemComponent.PlayMontageOnSourceObject
	void OnRep_ImpactEnduranceExhaustedData(struct FImpactEnduranceExhaustedData& OldImpactEnduranceExhaustedData); // Function DungeonCrawler.DCAbilitySystemComponent.OnRep_ImpactEnduranceExhaustedData
	void OnRep_AbilityHandleDataArray(struct TArray<struct FDCGameplayAbilityHandleData>& InOldAbilityHandleDataArray); // Function DungeonCrawler.DCAbilitySystemComponent.OnRep_AbilityHandleDataArray
	void OnActorDieData(struct FActorDieData InActorDieData); // Function DungeonCrawler.DCAbilitySystemComponent.OnActorDieData
	struct TArray<struct FDCGameplayEffectContainerSpec> GetContainerSpecArray(); // Function DungeonCrawler.DCAbilitySystemComponent.GetContainerSpecArray
	void ExecuteGameplayCueLocal(struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function DungeonCrawler.DCAbilitySystemComponent.ExecuteGameplayCueLocal
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCAbilitySystemComponent.BroadcastMsgBlueprint
	void AddGameplayCueLocal(struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function DungeonCrawler.DCAbilitySystemComponent.AddGameplayCueLocal
}; 
 
 


// Class DungeonCrawler.DCAbilitySystemGlobals
// Size: 0x2C8(Inherited: 0x298)
struct UDCAbilitySystemGlobals : UAbilitySystemGlobals
{
	UGameplayEffect* GameplayEffectClassMMC;  // 0x298 (0x298)
	UGameplayEffect* GameplayEffectClassMMCSimple;  // 0x2A0 (0x2A0)
	UGameplayEffect* GameplayEffectClassInfiniteTagOnly;  // 0x2A8 (0x2A8)
	UGameplayEffect* GameplayEffectClassDurationTagOnly;  // 0x2B0 (0x2B0)
	UGameplayEffect* GameplayEffectClassInitialize;  // 0x2B8 (0x2B8)
	UGameplayEffect* GameplayEffectClassCalculation;  // 0x2C0 (0x2C0)


}; 
 
 


// Class DungeonCrawler.DCActionSkinArtData
// Size: 0x40(Inherited: 0x38)
struct UDCActionSkinArtData : UDCDataAssetBase
{
	struct UTexture2D* IconTexture;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.DCActionSkinComponent
// Size: 0x100(Inherited: 0xA0)
struct UDCActionSkinComponent : UActorComponent
{
	struct TArray<struct UDCActionSkinDataAsset*> Datas;  // 0xA0 (0xA0)
	char pad_176[80];  // 0xB0 (0xB0)


	void OnRep_Datas(struct TArray<struct UDCActionSkinDataAsset*>& OldDatas); // Function DungeonCrawler.DCActionSkinComponent.OnRep_Datas
}; 
 
 


// Class DungeonCrawler.DCPlayerChatComponent
// Size: 0x158(Inherited: 0xA0)
struct UDCPlayerChatComponent : UActorComponent
{
	char pad_160[184];  // 0xA0 (0xA0)


}; 
 
 


// Class DungeonCrawler.DCActionSkinListEntryWidgetData
// Size: 0x38(Inherited: 0x28)
struct UDCActionSkinListEntryWidgetData : UObject
{
	struct FDCActionSkinInfo ActionSkinInfo;  // 0x28 (0x28)


}; 
 
 


// Class DungeonCrawler.DCGATA_LineTraceInteractable
// Size: 0x4C0(Inherited: 0x3E0)
struct ADCGATA_LineTraceInteractable : AGameplayAbilityTargetActor
{
	struct FMulticastInlineDelegate FoundNewInteractableTarget;  // 0x3E0 (0x3E0)
	struct FMulticastInlineDelegate LostInteractableTarget;  // 0x3F0 (0x3F0)
	float MaxRange;  // 0x400 (0x400)
	float Radius;  // 0x404 (0x404)
	char pad_1032[184];  // 0x408 (0x408)


}; 
 
 


// Class DungeonCrawler.GA_HuntingTrapDisarmInteract
// Size: 0x6A0(Inherited: 0x6A0)
struct UGA_HuntingTrapDisarmInteract : UGA_Interact
{


}; 
 
 


// Class DungeonCrawler.DCControlWidgetBase
// Size: 0x368(Inherited: 0x278)
struct UDCControlWidgetBase : UUserWidget
{
	char pad_632_1 : 7;  // 0x278 (0x278)
	bool bCanClick : 1;  // 0x278 (0x278)
	char pad_633_1 : 7;  // 0x279 (0x279)
	bool bCanDrag : 1;  // 0x279 (0x279)
	char pad_634[6];  // 0x27A (0x27A)
	struct FDCMouseClickInfo PrevMouseInfo;  // 0x280 (0x280)
	struct FTimerHandle TimerHandle;  // 0x360 (0x360)


	void OnClickTimer(); // Function DungeonCrawler.DCControlWidgetBase.OnClickTimer
}; 
 
 


// Class DungeonCrawler.DCActionSkinWidget
// Size: 0x3E0(Inherited: 0x368)
struct UDCActionSkinWidget : UDCControlWidgetBase
{
	char pad_872[24];  // 0x368 (0x368)
	struct FText ActionSkinName;  // 0x380 (0x380)
	struct FText ActionSkinFlavorText;  // 0x398 (0x398)
	struct UTexture2D* ActionSkinIconTexture;  // 0x3B0 (0x3B0)
	struct FPrimaryAssetId ActionSkinId;  // 0x3B8 (0x3B8)
	char pad_968_1 : 7;  // 0x3C8 (0x3C8)
	bool bIsEquipped : 1;  // 0x3C8 (0x3C8)
	char pad_969[7];  // 0x3C9 (0x3C9)
	UDCGameTooltipWithFlavorTextWidget* TooltipWidgetClass;  // 0x3D0 (0x3D0)
	struct UDCGameTooltipWithFlavorTextWidget* SkinTooltipWidget;  // 0x3D8 (0x3D8)


	struct UUserWidget* GetActionSkinTooltipWidget(); // Function DungeonCrawler.DCActionSkinWidget.GetActionSkinTooltipWidget
}; 
 
 


// Class DungeonCrawler.DCActionSkinListEntryWidget
// Size: 0x3F0(Inherited: 0x3E0)
struct UDCActionSkinListEntryWidget : UDCActionSkinWidget
{
	char pad_992[16];  // 0x3E0 (0x3E0)


	void OnRightClicked(); // Function DungeonCrawler.DCActionSkinListEntryWidget.OnRightClicked
}; 
 
 


// Class DungeonCrawler.DCAT_WaitGameplayTagsAdded
// Size: 0x118(Inherited: 0x108)
struct UDCAT_WaitGameplayTagsAdded : UDCAT_WaitGameplayTags
{
	struct FMulticastInlineDelegate Added;  // 0x108 (0x108)


	struct UDCAT_WaitGameplayTagsAdded* WaitGameplayTagsAdded(struct UGameplayAbility* OwningAbility, struct FGameplayTagContainer TagContainer, bool bIsWaitAnyTag, struct AActor* InOptionalExternalTarget, bool bIsOnlyTriggerOnce); // Function DungeonCrawler.DCAT_WaitGameplayTagsAdded.WaitGameplayTagsAdded
}; 
 
 


// Class DungeonCrawler.DCCustomizeEmoteListWidget
// Size: 0x320(Inherited: 0x300)
struct UDCCustomizeEmoteListWidget : UDCWidgetBase
{
	char pad_768[24];  // 0x300 (0x300)
	struct UTileView* TileView_EmoteList;  // 0x318 (0x318)


	void OnSetEmoteIdArray(struct TArray<struct FDCEmoteInfo> EmoteIdArray); // Function DungeonCrawler.DCCustomizeEmoteListWidget.OnSetEmoteIdArray
}; 
 
 


// Class DungeonCrawler.DCActorReferenceCounterInterface
// Size: 0x28(Inherited: 0x28)
struct UDCActorReferenceCounterInterface : UInterface
{


}; 
 
 


// Class DungeonCrawler.DCMerchantItemWidget
// Size: 0x4E8(Inherited: 0x4C8)
struct UDCMerchantItemWidget : UDCItemWidgetBase
{
	UDCItemTooltipWidget* ItemTooltipWidgetClass;  // 0x4C8 (0x4C8)
	int32_t DealTableCount;  // 0x4D0 (0x4D0)
	char pad_1236[4];  // 0x4D4 (0x4D4)
	struct UImage* ItemImage;  // 0x4D8 (0x4D8)
	struct USizeBox* ItemSizeBox;  // 0x4E0 (0x4E0)


	struct UDCItemTooltipWidget* GetTooltipWidget(); // Function DungeonCrawler.DCMerchantItemWidget.GetTooltipWidget
}; 
 
 


// Class DungeonCrawler.DCCameraPostProcessTimelineData
// Size: 0x108(Inherited: 0x28)
struct UDCCameraPostProcessTimelineData : UObject
{
	struct FMulticastInlineDelegate OnCameraPostProcessDataTimelineUpdate;  // 0x28 (0x28)
	struct FMulticastInlineDelegate OnCameraPostProcessDataTimelineFinished;  // 0x38 (0x38)
	struct FTimeline CameraPostProcessTimeline;  // 0x48 (0x48)
	struct UCurveFloat* TimelineCurve;  // 0xE0 (0xE0)
	enum class ETimelineDirection TimelineDirection;  // 0xE8 (0xE8)
	char pad_233[7];  // 0xE9 (0xE9)
	struct TArray<struct FName> ParameterNames;  // 0xF0 (0xF0)
	struct UMaterialInstanceDynamic* MIDKey;  // 0x100 (0x100)


	void HandleTimelineUpdate(float UpdateValue); // Function DungeonCrawler.DCCameraPostProcessTimelineData.HandleTimelineUpdate
	void HandleTimelineFinished(); // Function DungeonCrawler.DCCameraPostProcessTimelineData.HandleTimelineFinished
}; 
 
 


// Class DungeonCrawler.DCCharacterAbilitySystemComponent
// Size: 0x1988(Inherited: 0x1938)
struct UDCCharacterAbilitySystemComponent : UDCAbilitySystemComponent
{
	struct TMap<struct FDCItemId, struct FDCEquipItemGASInfo> ItemEquipInfos;  // 0x1938 (0x1938)


	void OnItemUnequipEvent(struct FDCItemId ItemId); // Function DungeonCrawler.DCCharacterAbilitySystemComponent.OnItemUnequipEvent
	void OnItemEquipEvent(struct FDCItemInfo& ItemInfo); // Function DungeonCrawler.DCCharacterAbilitySystemComponent.OnItemEquipEvent
}; 
 
 


// Class DungeonCrawler.SkillActor
// Size: 0x400(Inherited: 0x2F0)
struct ASkillActor : ADCActorBase
{
	char pad_752[8];  // 0x2F0 (0x2F0)
	struct FSkillData SkillData;  // 0x2F8 (0x2F8)
	char pad_808[200];  // 0x328 (0x328)
	struct UArtDataSkill* ArtDataSkill;  // 0x3F0 (0x3F0)
	struct USoundData* SoundData;  // 0x3F8 (0x3F8)


	bool UpdateSkillCount(int32_t DeltaCount); // Function DungeonCrawler.SkillActor.UpdateSkillCount
	void SetSkillData(struct FSkillData& NewSkillData); // Function DungeonCrawler.SkillActor.SetSkillData
	void RechargeSkill(int32_t ChargeAmount); // Function DungeonCrawler.SkillActor.RechargeSkill
	void OnRep_SkillData(struct FSkillData& OldSkillData); // Function DungeonCrawler.SkillActor.OnRep_SkillData
	struct USoundData* GetSoundDataSkill(); // Function DungeonCrawler.SkillActor.GetSoundDataSkill
	struct FSkillData GetSkillData(); // Function DungeonCrawler.SkillActor.GetSkillData
	struct FDesignDataSkill GetDesignDataSkill(); // Function DungeonCrawler.SkillActor.GetDesignDataSkill
	struct UArtDataSkill* GetArtDataSkill(); // Function DungeonCrawler.SkillActor.GetArtDataSkill
}; 
 
 


// Class DungeonCrawler.DCActorStatusComponent
// Size: 0x130(Inherited: 0xA0)
struct UDCActorStatusComponent : UActorComponent
{
	char pad_160[88];  // 0xA0 (0xA0)
	struct UAsyncTaskEffectStackChanged* EffectStackAsyncTask;  // 0xF8 (0xF8)
	struct UAsyncTaskEffectInhibitionChanged* EffectInhibitAsyncTask;  // 0x100 (0x100)
	struct TArray<struct FActorStatusData> ActorStatusDatas;  // 0x108 (0x108)
	char pad_280[24];  // 0x118 (0x118)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCActorStatusComponent.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCActorStatusComponent.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCActorStatusComponent.TerminateBase
	void OnRep_ActorStatusDatas(struct TArray<struct FActorStatusData>& OldActorStatusDatas); // Function DungeonCrawler.DCActorStatusComponent.OnRep_ActorStatusDatas
	void GameplayEffectStackChanged(struct FGameplayTag EffectGameplayTag, struct FActiveGameplayEffectHandle EffectHandle, int32_t NewStackCount, int32_t PreviousStackCount); // Function DungeonCrawler.DCActorStatusComponent.GameplayEffectStackChanged
	void GameplayEffectInhibitChanged(struct FGameplayTag EffectGameplayTag, struct FActiveGameplayEffectHandle EffectHandle, bool bIsInhibited); // Function DungeonCrawler.DCActorStatusComponent.GameplayEffectInhibitChanged
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCActorStatusComponent.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.SkillWidget
// Size: 0x350(Inherited: 0x300)
struct USkillWidget : UDCWidgetBase
{
	struct UImage* SkillIconImage;  // 0x300 (0x300)
	struct FSkillWidgetData SkillWidgetData;  // 0x308 (0x308)
	UUserWidget* SkillToolTipWidgetClass;  // 0x338 (0x338)
	struct FPrimaryAssetId SkillId;  // 0x340 (0x340)


	void SetSkillData(struct FText& SkillName, struct FText& SkillDesc); // Function DungeonCrawler.SkillWidget.SetSkillData
	void OnSetSkillData(); // Function DungeonCrawler.SkillWidget.OnSetSkillData
	void InitializeSkillWidget(struct FPrimaryAssetId& InSkillId); // Function DungeonCrawler.SkillWidget.InitializeSkillWidget
}; 
 
 


// Class DungeonCrawler.DCAkComponent
// Size: 0x650(Inherited: 0x4A0)
struct UDCAkComponent : UAkComponent
{
	char pad_1184[88];  // 0x4A0 (0x4A0)
	struct TMap<uint32_t, struct FAkAudioVolumeInfo> CurrentVolumeIdMap;  // 0x4F8 (0x4F8)
	uint32_t CurrentVolumeId;  // 0x548 (0x548)
	char pad_1356[4];  // 0x54C (0x54C)
	struct TMap<struct FGameplayTag, struct UAkAudioEvent*> AkEvents;  // 0x550 (0x550)
	struct TMap<struct FGameplayTag, struct FDCSoundDataContainer> AkSwitches;  // 0x5A0 (0x5A0)
	struct TMap<struct FGameplayTag, struct FGameplayTagQuery> SoundPlayableCondition;  // 0x5F0 (0x5F0)
	struct FPrimaryAssetId SoundDataId;  // 0x640 (0x640)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCAkComponent.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCAkComponent.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCAkComponent.TerminateBase
	void SetSoundSwitch(struct FGameplayTag& Tag, enum class EPhysicalSurface SurfaceType, struct FString SwitchGroup, struct FString SwitchState); // Function DungeonCrawler.DCAkComponent.SetSoundSwitch
	void PostSoundEvent(struct FGameplayTag Tag); // Function DungeonCrawler.DCAkComponent.PostSoundEvent
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCAkComponent.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCMerchantMenuWidget
// Size: 0x278(Inherited: 0x278)
struct UDCMerchantMenuWidget : UUserWidget
{


}; 
 
 


// Class DungeonCrawler.ItemTooltipRequirementListEntryWidgetData
// Size: 0x58(Inherited: 0x28)
struct UItemTooltipRequirementListEntryWidgetData : UObject
{
	struct FText RequirementValueText;  // 0x28 (0x28)
	struct FSlateColor RequirementValueTextColor;  // 0x40 (0x40)
	char pad_84[4];  // 0x54 (0x54)


}; 
 
 


// Class DungeonCrawler.DCAnimInstanceBase
// Size: 0x450(Inherited: 0x350)
struct UDCAnimInstanceBase : UAnimInstance
{
	char pad_848[80];  // 0x350 (0x350)
	struct TArray<int32_t> AnimationLODFrameRate;  // 0x3A0 (0x3A0)
	float HorizontalMovingThreshold;  // 0x3B0 (0x3B0)
	char pad_948[4];  // 0x3B4 (0x3B4)
	struct FVector NativeVelocity;  // 0x3B8 (0x3B8)
	struct FVector NativeRelativeHorizontalVelocity;  // 0x3D0 (0x3D0)
	float NativeSpeed;  // 0x3E8 (0x3E8)
	float NativeHorizontalSpeed;  // 0x3EC (0x3EC)
	float NativeDirectionAngle;  // 0x3F0 (0x3F0)
	char pad_1012_1 : 7;  // 0x3F4 (0x3F4)
	bool bIsMontagePlaying : 1;  // 0x3F4 (0x3F4)
	char pad_1013_1 : 7;  // 0x3F5 (0x3F5)
	bool bIsHorizontalMoving : 1;  // 0x3F5 (0x3F5)
	char pad_1014[2];  // 0x3F6 (0x3F6)
	struct FGameplayTag IdleAnimSequenceGameplayTag;  // 0x3F8 (0x3F8)
	char pad_1024[40];  // 0x400 (0x400)
	struct FGameplayTagBlueprintPropertyMap GameplayTagPropertyMap;  // 0x428 (0x428)
	char pad_1096[8];  // 0x448 (0x448)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCAnimInstanceBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCAnimInstanceBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCAnimInstanceBase.TerminateBase
	struct AActor* GetOriginActor(); // Function DungeonCrawler.DCAnimInstanceBase.GetOriginActor
	void EventMontageStarted(struct UAnimMontage* InMontage); // Function DungeonCrawler.DCAnimInstanceBase.EventMontageStarted
	void EventAllMontageInstancesEnded(); // Function DungeonCrawler.DCAnimInstanceBase.EventAllMontageInstancesEnded
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCAnimInstanceBase.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCMetaGameMode
// Size: 0x3A0(Inherited: 0x3A0)
struct ADCMetaGameMode : ADCGameModeBase
{


}; 
 
 


// Class DungeonCrawler.DCGATA_AimTraceSphereOnServer
// Size: 0x3F0(Inherited: 0x3F0)
struct ADCGATA_AimTraceSphereOnServer : ADCGATA_AimTraceWithSphere
{


}; 
 
 


// Class DungeonCrawler.DCCharacterAnimInstanceBase
// Size: 0x4E0(Inherited: 0x450)
struct UDCCharacterAnimInstanceBase : UDCAnimInstanceBase
{
	float NativeYaw;  // 0x448 (0x448)
	float NativePitch;  // 0x44C (0x44C)
	char pad_1112_1 : 7;  // 0x458 (0x458)
	bool bIsFlying : 1;  // 0x450 (0x450)
	char pad_1113_1 : 7;  // 0x459 (0x459)
	bool bIsFalling : 1;  // 0x451 (0x451)
	char pad_1114_1 : 7;  // 0x45A (0x45A)
	bool bIsCrouching : 1;  // 0x452 (0x452)
	char pad_1115_1 : 7;  // 0x45B (0x45B)
	bool bIsDead : 1;  // 0x453 (0x453)
	struct FVector HitDirection;  // 0x458 (0x458)
	char pad_1140_1 : 7;  // 0x474 (0x474)
	bool bShouldTransitionToHit : 1;  // 0x470 (0x470)
	char pad_1141_1 : 7;  // 0x475 (0x475)
	bool bShouldTransitionToHitReactionFlipFlop : 1;  // 0x471 (0x471)
	struct FName HitReactionStateMachineName;  // 0x474 (0x474)
	struct FName HitReactionStateName;  // 0x47C (0x47C)
	struct FName HitReactionFlipFlopStateName;  // 0x484 (0x484)
	char pad_1166[82];  // 0x48E (0x48E)


}; 
 
 


// Class DungeonCrawler.InjectionItemSelectedPropertyWidgetBase
// Size: 0x2E8(Inherited: 0x2A0)
struct UInjectionItemSelectedPropertyWidgetBase : UCommonUserWidget
{
	char pad_672[16];  // 0x2A0 (0x2A0)
	struct UEditableText* EditableText;  // 0x2B0 (0x2B0)
	struct FText ItemPropertyType;  // 0x2B8 (0x2B8)
	int32_t PropertyValue;  // 0x2D0 (0x2D0)
	char pad_724[20];  // 0x2D4 (0x2D4)


	void OnSelectedPropertyValueChanged__DelegateSignature(struct FPrimaryAssetId& PropertyTypeAssetId, int32_t PropertyValue); // DelegateFunction DungeonCrawler.InjectionItemSelectedPropertyWidgetBase.OnSelectedPropertyValueChanged__DelegateSignature
	void OnPropertyValueSet(struct FText& Text, enum class ETextCommit CommitMethod); // Function DungeonCrawler.InjectionItemSelectedPropertyWidgetBase.OnPropertyValueSet
	void OnPropertyValueChanged(struct FText& Text); // Function DungeonCrawler.InjectionItemSelectedPropertyWidgetBase.OnPropertyValueChanged
}; 
 
 


// Class DungeonCrawler.DCAnimInstanceV2
// Size: 0x3A0(Inherited: 0x350)
struct UDCAnimInstanceV2 : UAnimInstance
{
	struct TMap<struct FDCPlayerCharacterKey, struct UAnimSequence*> IdleAnims;  // 0x348 (0x348)


	struct UAnimSequence* GetIdleAnim(); // Function DungeonCrawler.DCAnimInstanceV2.GetIdleAnim
}; 
 
 


// Class DungeonCrawler.DesignDataAssetMerchantSchedule
// Size: 0x40(Inherited: 0x38)
struct UDesignDataAssetMerchantSchedule : UDCDesignDataAssetBase
{
	struct FDesignDataMerchantSchedule Item;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)


}; 
 
 


// Class DungeonCrawler.DCAnimNotify_SendGameplayEventTagToSelf
// Size: 0x40(Inherited: 0x38)
struct UDCAnimNotify_SendGameplayEventTagToSelf : UAnimNotify
{
	struct FGameplayTag EventTag;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.DCAT_WaitTargetGameplayTagEvent
// Size: 0xE0(Inherited: 0x80)
struct UDCAT_WaitTargetGameplayTagEvent : UAbilityTask
{
	struct FMulticastInlineDelegate Added;  // 0x80 (0x80)
	struct FMulticastInlineDelegate OnCountChanged;  // 0x90 (0x90)
	struct FMulticastInlineDelegate Removed;  // 0xA0 (0xA0)
	char pad_176[16];  // 0xB0 (0xB0)
	struct UAbilitySystemComponent* OptionalExternalTarget;  // 0xC0 (0xC0)
	char pad_200[24];  // 0xC8 (0xC8)


	struct UDCAT_WaitTargetGameplayTagEvent* WaitTargetGameplayTagEvent(struct UGameplayAbility* OwningAbility, struct FGameplayTag InTargetTag, struct AActor* InOptionalExternalTarget); // Function DungeonCrawler.DCAT_WaitTargetGameplayTagEvent.WaitTargetGameplayTagEvent
}; 
 
 


// Class DungeonCrawler.DCAnimNotify_MontageJumpToSectionOnSourceObject
// Size: 0x40(Inherited: 0x38)
struct UDCAnimNotify_MontageJumpToSectionOnSourceObject : UAnimNotify
{
	struct FName SectionName;  // 0x38 (0x38)


}; 
 
 


// Class DungeonCrawler.DCAnimNotify_SoundEvent
// Size: 0x48(Inherited: 0x38)
struct UDCAnimNotify_SoundEvent : UAnimNotify
{
	struct FGameplayTag EventTag;  // 0x38 (0x38)
	struct UAkAudioEvent* DefaultAkEvent;  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCPlayerPoint
// Size: 0x2F0(Inherited: 0x2C0)
struct ADCPlayerPoint : APlayerStart
{
	float SpawningDistance;  // 0x2C0 (0x2C0)
	float SpawnTickAngle;  // 0x2C4 (0x2C4)
	char pad_712[16];  // 0x2C8 (0x2C8)
	float SpawnAngle;  // 0x2D8 (0x2D8)
	char pad_732[20];  // 0x2DC (0x2DC)


}; 
 
 


// Class DungeonCrawler.DCGameplayEffectDataAsset
// Size: 0x260(Inherited: 0x38)
struct UDCGameplayEffectDataAsset : UDCTableDataAsset
{
	UGameplayEffect* EffectClass;  // 0x38 (0x38)
	struct FGameplayTag EventTag;  // 0x40 (0x40)
	uint8_t TargetType;  // 0x48 (0x48)
	char pad_73[3];  // 0x49 (0x49)
	int32_t Duration;  // 0x4C (0x4C)
	int32_t StrengthBase;  // 0x50 (0x50)
	int32_t StrengthMod;  // 0x54 (0x54)
	int32_t AgilityBase;  // 0x58 (0x58)
	int32_t AgilityMod;  // 0x5C (0x5C)
	int32_t WillBase;  // 0x60 (0x60)
	int32_t WillMod;  // 0x64 (0x64)
	int32_t KnowledgeBase;  // 0x68 (0x68)
	int32_t KnowledgeMod;  // 0x6C (0x6C)
	int32_t ResourcefulnessBase;  // 0x70 (0x70)
	int32_t ResourcefulnessMod;  // 0x74 (0x74)
	int32_t ExecDamageWeaponRatio;  // 0x78 (0x78)
	int32_t PhysicalDamageWeapon;  // 0x7C (0x7C)
	int32_t PhysicalDamageBase;  // 0x80 (0x80)
	int32_t ExecPhysicalDamageBase;  // 0x84 (0x84)
	int32_t PhysicalPower;  // 0x88 (0x88)
	int32_t PhysicalDamageMod;  // 0x8C (0x8C)
	int32_t PhysicalDamageAdd;  // 0x90 (0x90)
	int32_t PhysicalDamageTrue;  // 0x94 ([x94)
	int32_t ExecPhysicalDamageTrue;  // 000534071] ited: 0x38)
 (000534071] ited: 0x38)
)
	int32_t PhysicalBackstabPower;  // 0x9C (0x9C)
	int32_t PhysicalHeadshotPower;  // 0xA0 (0xA0)
	int32_t PhysicalHeadshotPenetration;  // 0xA4 (0xA4)
	int32_t ArmorPenetration;  // 0xA8 (0xA8)
	int32_t ExecArmorPenetration;  // 0xAC (0xAC)
	int32_t ArmorRating;  // 0xB0 (0xB0)
	int32_t ItemArmorRatingMod;  // 0xB4 (0xB4)
	int32_t PhysicalReduction;  // 0xB8 (0xB8)
	int32_t PhysicalReductionMod;  // 0xBC (0xBC)
	int32_t PhysicalAbsoluteReduction;  // 0xC0 (0xC0)
	int32_t MagicalDamageWeapon;  // 0xC4 (0xC4)
	int32_t MagicalDamageBase;  // 0xC8 (0xC8)
	int32_t ExecMagicalDamageBase;  // 0xCC (0xCC)
	int32_t MagicalPower;  // 0xD0 (0xD0)
	int32_t MagicalDamageMod;  // 0xD4 (0xD4)
	int32_t MagicalDamageAdd;  // 0xD8 (0xD8)
	int32_t MagicalDamageTrue;  // 0xDC (0xDC)
	int32_t ExecMagicalDamageTrue;  // 0xE0 (0xE0)
	int32_t MagicPenetration;  // 0xE4 (0xE4)
	int32_t ExecMagicPenetration;  // 0xE8 (0xE8)
	int32_t MagicalFireDamageBase;  // 0xEC (0xEC)
	int32_t MagicalFireDamageMod;  // 0xF0 (0xF0)
	int32_t MagicalFireDamageAdd;  // 0xF4 (0xF4)
	int32_t MagicalArcaneDamageBase;  // 0xF8 (0xF8)
	int32_t MagicalArcaneDamageMod;  // 0xFC (0xFC)
	int32_t MagicalArcaneDamageAdd;  // 0x100 (0x100)
	int32_t MagicalDarkDamageBase;  // 0x104 (0x104)
	int32_t MagicalDarkDamageMod;  // 0x108 (0x108)
	int32_t MagicalDarkDamageAdd;  // 0x10C (0x10C)
	int32_t MagicResistance;  // 0x110 (0x110)
	int32_t MagicalReduction;  // 0x114 (0x114)
	int32_t MagicalReductionMod;  // 0x118 (0x118)
	int32_t MagicalAbsoluteReduction;  // 0x11C (0x11C)
	int32_t FireMagicResistance;  // 0x120 (0x120)
	int32_t FireMagicalReduction;  // 0x124 (0x124)
	int32_t FireMagicalReductionMod;  // 0x128 (0x128)
	int32_t WaterMagicResistance;  // 0x12C (0x12C)
	int32_t WaterMagicalReduction;  // 0x130 (0x130)
	int32_t WaterMagicalReductionMod;  // 0x134 (0x134)
	int32_t LightningMagicResistance;  // 0x138 (0x138)
	int32_t LightningMagicalReduction;  // 0x13C (0x13C)
	int32_t LightningMagicalReductionMod;  // 0x140 (0x140)
	int32_t EarthMagicResistance;  // 0x144 (0x144)
	int32_t EarthMagicalReduction;  // 0x148 (0x148)
	int32_t EarthMagicalReductionMod;  // 0x14C (0x14C)
	int32_t LightMagicResistance;  // 0x150 (0x150)
	int32_t LightMagicalReduction;  // 0x154 (0x154)
	int32_t LightMagicalReductionMod;  // 0x158 (0x158)
	int32_t DarkMagicResistance;  // 0x15C (0x15C)
	int32_t DarkMagicalReduction;  // 0x160 (0x160)
	int32_t DarkMagicalReductionMod;  // 0x164 (0x164)
	int32_t ArcaneMagicResistance;  // 0x168 (0x168)
	int32_t ArcaneMagicalReduction;  // 0x16C (0x16C)
	int32_t ArcaneMagicalReductionMod;  // 0x170 (0x170)
	int32_t DivineMagicResistance;  // 0x174 (0x174)
	int32_t DivineMagicalReduction;  // 0x178 (0x178)
	int32_t DivineMagicalReductionMod;  // 0x17C (0x17C)
	int32_t EvilMagicResistance;  // 0x180 (0x180)
	int32_t EvilMagicalReduction;  // 0x184 (0x184)
	int32_t EvilMagicalReductionMod;  // 0x188 (0x188)
	int32_t AirMagicResistance;  // 0x18C (0x18C)
	int32_t AirMagicalReduction;  // 0x190 (0x190)
	int32_t AirMagicalReductionMod;  // 0x194 (0x194)
	int32_t SpiritMagicResistance;  // 0x198 (0x198)
	int32_t SpiritMagicalReduction;  // 0x19C (0x19C)
	int32_t SpiritMagicalReductionMod;  // 0x1A0 (0x1A0)
	int32_t HeadshotReductionMod;  // 0x1A4 (0x1A4)
	int32_t ProjectileReductionMod;  // 0x1A8 (0x1A8)
	int32_t ImpactPower;  // 0x1AC (0x1AC)
	int32_t ExecImpactPower;  // 0x1B0 (0x1B0)
	int32_t ExecImpactEnduranceRestore;  // 0x1B4 (0x1B4)
	int32_t ImpactResistance;  // 0x1B8 (0x1B8)
	int32_t MaxImpactEndurance;  // 0x1BC (0x1BC)
	int32_t ExecAddHealthByCurHealthRatio;  // 0x1C0 (0x1C0)
	int32_t ExecAddHealthByMaxHealthRatio;  // 0x1C4 (0x1C4)
	int32_t PhysicalHealBase;  // 0x1C8 (0x1C8)
	int32_t ExecPhysicalHealBase;  // 0x1CC (0x1CC)
	int32_t PhysicalHealMod;  // 0x1D0 (0x1D0)
	int32_t MagicalHealBase;  // 0x1D4 (0x1D4)
	int32_t ExecMagicalHealBase;  // 0x1D8 (0x1D8)
	int32_t MagicalHealMod;  // 0x1DC (0x1DC)
	int32_t ExecRecoveryHealBase;  // 0x1E0 (0x1E0)
	int32_t MaxHealthMod;  // 0x1E4 (0x1E4)
	int32_t MaxHealthAdd;  // 0x1E8 (0x1E8)
	int32_t AddtionalAggroMod;  // 0x1EC (0x1EC)
	int32_t MaxPhysicalShield;  // 0x1F0 (0x1F0)
	int32_t MaxMagicalShield;  // 0x1F4 (0x1F4)
	int32_t MaxTotalShield;  // 0x1F8 (0x1F8)
	int32_t SpellCapacityMod;  // 0x1FC (0x1FC)
	int32_t SpellCapacityAdd;  // 0x200 (0x200)
	int32_t MoveSpeedBase;  // 0x204 (0x204)
	int32_t MoveSpeedMod;  // 0x208 (0x208)
	int32_t MoveSpeedAdd;  // 0x20C (0x20C)
	int32_t MoveSpeedArmorPenaltyMod;  // 0x210 (0x210)
	int32_t ActionSpeed;  // 0x214 (0x214)
	int32_t SpellCastingSpeed;  // 0x218 (0x218)
	int32_t ItemEquipSpeed;  // 0x21C (0x21C)
	int32_t RegularInteractionSpeed;  // 0x220 (0x220)
	int32_t MagicalInteractionSpeed;  // 0x224 (0x224)
	int32_t BuffDurationMod;  // 0x228 (0x228)
	int32_t DebuffDurationMod;  // 0x22C (0x22C)
	int32_t UtilityEffectivenessMod;  // 0x230 (0x230)
	int32_t UtilityEffectivenessAdd;  // 0x234 (0x234)
	int32_t WeightLimitMod;  // 0x238 (0x238)
	int32_t WeightLimitAdd;  // 0x23C (0x23C)
	int32_t Luck;  // 0x240 (0x240)
	int32_t ExecAttributeBonusRatio;  // 0x244 (0x244)
	int32_t ExecHealthCost;  // 0x248 (0x248)
	char pad_588[4];  // 0x24C (0x24C)
	struct TArray<struct FGameplayTag> Tags;  // 0x250 (0x250)


}; 
 
 


// Class DungeonCrawler.DCAnimNotify_UnHideEquippedWeapons
// Size: 0x38(Inherited: 0x38)
struct UDCAnimNotify_UnHideEquippedWeapons : UAnimNotify
{


}; 
 
 


// Class DungeonCrawler.MetaPlayComponent
// Size: 0x170(Inherited: 0x100)
struct UMetaPlayComponent : UMetaComponentBase
{
	char pad_256[32];  // 0x100 (0x100)
	struct TMap<uint8_t, struct ADCCharacterLobbyCapture*> CharacterLobbyCaptureMap;  // 0x120 (0x120)


	void OnRecruitBegin(); // Function DungeonCrawler.MetaPlayComponent.OnRecruitBegin
}; 
 
 


// Class DungeonCrawler.DCAnimNotify_SendGameplayEventTagsToSelf
// Size: 0x48(Inherited: 0x30)
struct UDCAnimNotify_SendGameplayEventTagsToSelf : UAnimNotifyState
{
	struct FGameplayTag BeginEventTag;  // 0x30 (0x30)
	struct FGameplayTag EndEventTag;  // 0x38 (0x38)
	struct FGameplayTag EventTag;  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.GamePartyWidget
// Size: 0x340(Inherited: 0x300)
struct UGamePartyWidget : UDCWidgetBase
{
	struct UHorizontalBox* PartyMemberWidgetRow;  // 0x300 (0x300)
	UGamePartyMemberWidget* PartyMemberWidgetClass;  // 0x308 (0x308)
	struct TArray<struct UGamePartyMemberWidget*> PartyMemberWidgets;  // 0x310 (0x310)
	struct FDCAccountId TargetAccountId;  // 0x320 (0x320)
	struct FDCPartyId TargetPartyId;  // 0x330 (0x330)


}; 
 
 


// Class DungeonCrawler.DCAnimNotify_TimedNiagaraEffect
// Size: 0x228(Inherited: 0xE8)
struct UDCAnimNotify_TimedNiagaraEffect : UAnimNotifyState_TimedNiagaraEffectAdvanced
{
	struct TMap<struct FName, float> ParameterFloatValues;  // 0xE8 (0xE8)
	struct TMap<struct FName, int32_t> ParameterIntValues;  // 0x138 (0x138)
	struct TMap<struct FName, struct FColor> ParameterColorValues;  // 0x188 (0x188)
	struct TMap<struct FName, struct FVector> ParameterVectorValues;  // 0x1D8 (0x1D8)


}; 
 
 


// Class DungeonCrawler.DCAnimNotify_ForceClientVisibilityBasedAnimTickOption
// Size: 0x38(Inherited: 0x30)
struct UDCAnimNotify_ForceClientVisibilityBasedAnimTickOption : UAnimNotifyState
{
	uint8_t VisibilityBasedAnimTickOption;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)


}; 
 
 


// Class DungeonCrawler.DCHudWidgetBase
// Size: 0x300(Inherited: 0x300)
struct UDCHudWidgetBase : UDCWidgetBase
{


}; 
 
 


// Class DungeonCrawler.DCSkeletalMeshComponent
// Size: 0xFE0(Inherited: 0xF80)
struct UDCSkeletalMeshComponent : USkeletalMeshComponent
{
	char pad_3968[96];  // 0xF80 (0xF80)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCSkeletalMeshComponent.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCSkeletalMeshComponent.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCSkeletalMeshComponent.TerminateBase
	void SetAffectNavigation(bool bRelevant); // Function DungeonCrawler.DCSkeletalMeshComponent.SetAffectNavigation
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCSkeletalMeshComponent.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCIngameGameSession
// Size: 0x3F0(Inherited: 0x3F0)
struct ADCIngameGameSession : ADCGameSession
{


}; 
 
 


// Class DungeonCrawler.DCAoeAIControllerBase
// Size: 0x418(Inherited: 0x3B8)
struct ADCAoeAIControllerBase : AAIController
{
	char pad_952[88];  // 0x3B8 (0x3B8)
	struct UBaseObject* BaseObject;  // 0x410 (0x410)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCAoeAIControllerBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCAoeAIControllerBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCAoeAIControllerBase.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCAoeAIControllerBase.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.DCAoeBase
// Size: 0x6B0(Inherited: 0x620)
struct ADCAoeBase : ACharacter
{
	char pad_1568[96];  // 0x620 (0x620)
	struct UBaseObject* BaseObject;  // 0x680 (0x680)
	char pad_1672[8];  // 0x688 (0x688)
	struct UDCAoeDataAsset* AoeDataAsset;  // 0x690 (0x690)
	char pad_1688_1 : 7;  // 0x698 (0x698)
	bool IsDestroyedWhenOwnerDie : 1;  // 0x698 (0x698)
	char pad_1689_1 : 7;  // 0x699 (0x699)
	bool ApplyContinuosDamage : 1;  // 0x699 (0x699)
	char pad_1690[6];  // 0x69A (0x69A)
	struct TArray<struct TWeakObjectPtr<ADCCharacterBase>> TargetArray;  // 0x6A0 (0x6A0)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCAoeBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCAoeBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCAoeBase.TerminateBase
	void RemoveEndOverlapActor(struct ADCCharacterBase* CharacterBase); // Function DungeonCrawler.DCAoeBase.RemoveEndOverlapActor
	void OnSetAI(); // Function DungeonCrawler.DCAoeBase.OnSetAI
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCAoeBase.BroadcastMsgBlueprint
	void AddBeginOverlapActor(struct ADCCharacterBase* CharacterBase); // Function DungeonCrawler.DCAoeBase.AddBeginOverlapActor
}; 
 
 


// Class DungeonCrawler.DCAoeDataAsset
// Size: 0xD0(Inherited: 0x38)
struct UDCAoeDataAsset : UDCTableDataAsset
{
	struct FText Name;  // 0x38 (0x38)
	struct TSoftObjectPtr<UArtDataAoe> ArtData;  // 0x50 (0x50)
	struct TSoftObjectPtr<USoundData> SoundData;  // 0x80 (0x80)
	struct TArray<struct TSoftObjectPtr<UDCGameplayAbilityDataAsset>> Abilities;  // 0xB0 (0xB0)
	struct TArray<struct TSoftObjectPtr<UDCGameplayEffectDataAsset>> Effects;  // 0xC0 (0xC0)


}; 
 
 


// Class DungeonCrawler.GameMenuOptionsVideoWidget
// Size: 0x4F8(Inherited: 0x440)
struct UGameMenuOptionsVideoWidget : UDCCommonActivatableWidgetBase
{
	struct UGameMenuOptionSlotWidget* WB_ShadowQuality;  // 0x440 (0x440)
	struct UGameMenuOptionSlotWidget* WB_TextureQuality;  // 0x448 (0x448)
	struct UGameMenuOptionSlotWidget* WB_PostProcessQuality;  // 0x450 (0x450)
	struct UGameMenuOptionSlotWidget* WB_EffectsQuality;  // 0x458 (0x458)
	struct UGameMenuOptionComboBoxWidget* WB_DisplayMode;  // 0x460 (0x460)
	struct UGameMenuOptionComboBoxWidget* WB_DisplayResolution;  // 0x468 (0x468)
	struct UGameMenuOptionSliderWidget* WB_MaxFrameRateLimit;  // 0x470 (0x470)
	struct UGameMenuOptionSliderWidget* WB_MaxFrameRateLimitMeta;  // 0x478 (0x478)
	struct UGameMenuOptionSliderWidget* WB_Brightness;  // 0x480 (0x480)
	struct UGameMenuOptionSlotWidget* WB_AntiAliasingSuperResolution;  // 0x488 (0x488)
	struct UWidgetSwitcher* AntiAliasingSuperResolutionSwitcher;  // 0x490 (0x490)
	struct UGameMenuOptionSliderWidget* WB_RenderScale;  // 0x498 (0x498)
	struct UGameMenuOptionSlotWidget* WB_SuperResolutionModeTSR;  // 0x4A0 (0x4A0)
	struct UGameMenuOptionSlotWidget* WB_SuperResolutionModeDLSS;  // 0x4A8 (0x4A8)
	struct UGameMenuOptionSlotWidget* WB_SuperResolutionModeFSR2;  // 0x4B0 (0x4B0)
	struct UGameMenuOptionSlotWidget* WB_SuperResolutionModeXeSS;  // 0x4B8 (0x4B8)
	struct FDataTableRowHandle ApplyInputActionData;  // 0x4C0 (0x4C0)
	char pad_1232[8];  // 0x4D0 (0x4D0)
	struct FDataTableRowHandle ResetInputActionData;  // 0x4D8 (0x4D8)
	char pad_1256[16];  // 0x4E8 (0x4E8)


	void UpdateDisplayMode(); // Function DungeonCrawler.GameMenuOptionsVideoWidget.UpdateDisplayMode
	void UpdateAntiAliasingSuperResolution(int32_t InSlotIdx); // Function DungeonCrawler.GameMenuOptionsVideoWidget.UpdateAntiAliasingSuperResolution
	void OnRevertDisplayOption(); // Function DungeonCrawler.GameMenuOptionsVideoWidget.OnRevertDisplayOption
	void OnResetButtonClicked(); // Function DungeonCrawler.GameMenuOptionsVideoWidget.OnResetButtonClicked
	void OnDisplayOptionChangePopup(); // Function DungeonCrawler.GameMenuOptionsVideoWidget.OnDisplayOptionChangePopup
	void OnBrightnessChanged(); // Function DungeonCrawler.GameMenuOptionsVideoWidget.OnBrightnessChanged
	void OnApplyDisplayOption(); // Function DungeonCrawler.GameMenuOptionsVideoWidget.OnApplyDisplayOption
	void OnApplyButtonClicked(); // Function DungeonCrawler.GameMenuOptionsVideoWidget.OnApplyButtonClicked
}; 
 
 


// Class DungeonCrawler.DCAT_WaitTargetData
// Size: 0xC0(Inherited: 0xC0)
struct UDCAT_WaitTargetData : UAbilityTask_WaitTargetData
{


	struct UDCAT_WaitTargetData* DCWaitTargetData(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, enum class EGameplayTargetingConfirmation ConfirmationType, struct AGameplayAbilityTargetActor* InTargetActor); // Function DungeonCrawler.DCAT_WaitTargetData.DCWaitTargetData
}; 
 
 


// Class DungeonCrawler.DCGameModeBase
// Size: 0x3A0(Inherited: 0x330)
struct ADCGameModeBase : AGameModeBase
{
	char pad_816[88];  // 0x330 (0x330)
	struct UBaseObject* BaseObject;  // 0x388 (0x388)
	ADCGameModeAIControllerBase* GameModeAIControllerClass;  // 0x390 (0x390)
	struct ADCGameModeAIControllerBase* GameModeAIController;  // 0x398 (0x398)


	void UnbindMsgAll(struct UObject* InObject); // Function DungeonCrawler.DCGameModeBase.UnbindMsgAll
	void UnbindMsg(struct UScriptStruct* InMsgType, struct UObject* InObject); // Function DungeonCrawler.DCGameModeBase.UnbindMsg
	void TerminateBase(); // Function DungeonCrawler.DCGameModeBase.TerminateBase
	void BroadcastMsgBlueprint(int32_t& InMsg); // Function DungeonCrawler.DCGameModeBase.BroadcastMsgBlueprint
}; 
 
 


// Class DungeonCrawler.GameSpellCastingBarWidget
// Size: 0x320(Inherited: 0x300)
struct UGameSpellCastingBarWidget : UDCShowingKeyWidgetBase
{
	struct UTextBlock* CastingText;  // 0x300 (0x300)
	struct UProgressBar* CastingGauge;  // 0x308 (0x308)
	char pad_784[16];  // 0x310 (0x310)


	void OnSpellChannelingStart(); // Function DungeonCrawler.GameSpellCastingBarWidget.OnSpellChannelingStart
	void OnSpellChannelingEnd(); // Function DungeonCrawler.GameSpellCastingBarWidget.OnSpellChannelingEnd
	void OnSpellCastSucceed(); // Function DungeonCrawler.GameSpellCastingBarWidget.OnSpellCastSucceed
	void OnSpellCastStart(); // Function DungeonCrawler.GameSpellCastingBarWidget.OnSpellCastStart
	void OnSpellCastEnd(); // Function DungeonCrawler.GameSpellCastingBarWidget.OnSpellCastEnd
}; 
 
 


// Class DungeonCrawler.DCIngameGameMode
// Size: 0x4C8(Inherited: 0x3A0)
struct ADCIngameGameMode : ADCGameModeBase
{
	char pad_928[112];  // 0x3A0 (0x3A0)
	struct TArray<struct ADCPlayerStart*> StartPoints;  // 0x410 (0x410)
	char pad_1056[168];  // 0x420 (0x420)


}; 
 
 


// Class DungeonCrawler.DCMerchantListPageWidget
// Size: 0x478(Inherited: 0x470)
struct UDCMerchantListPageWidget : ULobbyGroupWidgetBase
{
	struct UTileView* TileView;  // 0x470 (0x470)


	void OnSetCompletedTileView(); // Function DungeonCrawler.DCMerchantListPageWidget.OnSetCompletedTileView
}; 
 
 


// Class DungeonCrawler.DCAssetManager
// Size: 0x588(Inherited: 0x4E8)
struct UDCAssetManager : UAssetManager
{
	struct TMap<struct FPrimaryAssetId, struct FLoadPrimaryAssetData> LoadPrimaryAssetDataMap;  // 0x4E8 (0x4E8)
	struct TMap<struct FPrimaryAssetType, struct FLoadPrimaryAssetType> LoadPrimaryAssetTypeMap;  // 0x538 (0x538)


}; 
 
 


// Class DungeonCrawler.DCCharacterLobbyCaptureMine
// Size: 0x840(Inherited: 0x840)
struct ADCCharacterLobbyCaptureMine : ADCCharacterLobbyCapture
{


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationKnowledge
// Size: 0xC0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationKnowledge : UGameplayModMagnitudeCalculation
{
	char pad_64[128];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationResourcefulness
// Size: 0xC0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationResourcefulness : UGameplayModMagnitudeCalculation
{
	char pad_64[128];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationRegularInteractionSpeedBase
// Size: 0xC0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationRegularInteractionSpeedBase : UGameplayModMagnitudeCalculation
{
	char pad_64[128];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCGameModeAIControllerArenaBase
// Size: 0x430(Inherited: 0x430)
struct ADCGameModeAIControllerArenaBase : ADCGameModeAIControllerGameBase
{


}; 
 
 


// Class DungeonCrawler.DCItemInfoEntryWidget
// Size: 0x508(Inherited: 0x500)
struct UDCItemInfoEntryWidget : UDCItemCommonWidget
{
	char pad_1280[8];  // 0x500 (0x500)


}; 
 
 


// Class DungeonCrawler.LobbyWidget
// Size: 0x458(Inherited: 0x440)
struct ULobbyWidget : UDCCommonActivatableWidgetBase
{
	struct FDataTableRowHandle BackInputActionData;  // 0x440 (0x440)
	char pad_1104[8];  // 0x450 (0x450)


	void OnPlayPartyReadyStateChanged(bool bMine, bool bLeader, bool bReady); // Function DungeonCrawler.LobbyWidget.OnPlayPartyReadyStateChanged
	void OnMatchingStateChanged(bool bMatching); // Function DungeonCrawler.LobbyWidget.OnMatchingStateChanged
	void OnLobbySystemMessage(struct FText& AnnounceText); // Function DungeonCrawler.LobbyWidget.OnLobbySystemMessage
	void OnBackButtonClicked(); // Function DungeonCrawler.LobbyWidget.OnBackButtonClicked
}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationUtilityEffectiveness
// Size: 0x100(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationUtilityEffectiveness : UGameplayModMagnitudeCalculation
{
	char pad_64[192];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCPreLobbyHUD
// Size: 0x3A0(Inherited: 0x390)
struct ADCPreLobbyHUD : ADCHUD
{
	ADCCaptureStudioActor* LobbyCreateStudioActorClass;  // 0x390 (0x390)
	struct ADCCaptureStudioActor* LobbyCreateStudioActor;  // 0x398 (0x398)


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationWeightLimit
// Size: 0x100(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationWeightLimit : UGameplayModMagnitudeCalculation
{
	char pad_64[192];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCAttributeModMagnitudeCalculationPerkBerSerker
// Size: 0xC0(Inherited: 0x40)
struct UDCAttributeModMagnitudeCalculationPerkBerSerker : UGameplayModMagnitudeCalculation
{
	char pad_64[128];  // 0x40 (0x40)


}; 
 
 


// Class DungeonCrawler.DCAttributeSet
// Size: 0x8E0(Inherited: 0x30)
struct UDCAttributeSet : UAttributeSet
{
	struct FGameplayAttributeData Strength;  // 0x30 (0x30)
	struct FGameplayAttributeData StrengthBase;  // 0x40 (0x40)
	struct FGameplayAttributeData StrengthMod;  // 0x50 (0x50)
	struct FGameplayAttributeData Agility;  // 0x60 (0x60)
	struct FGameplayAttributeData AgilityBase;  // 0x70 (0x70)
	struct FGameplayAttributeData AgilityMod;  // 0x80 (0x80)
	struct FGameplayAttributeData Will;  // 0x90 (0x90)
	struct FGameplayAttributeData WillBase;  // 0xA0 (0xA0)
	struct FGameplayAttributeData WillMod;  // 0xB0 (0xB0)
	struct FGameplayAttributeData Knowledge;  // 0xC0 (0xC0)
	struct FGameplayAttributeData KnowledgeBase;  // 0xD0 (0xD0)
	struct FGameplayAttributeData KnowledgeMod;  // 0xE0 (0xE0)
	struct FGameplayAttributeData Resourcefulness;  // 0xF0 (0xF0)
	struct FGameplayAttributeData ResourcefulnessBase;  // 0x100 (0x100)
	struct FGameplayAttributeData ResourcefulnessMod;  // 0x110 (0x110)
	struct FGameplayAttributeData PhysicalDamageWeaponPrimary;  // 0x120 (0x120)
	struct FGameplayAttributeData PhysicalDamageWeaponSecondary;  // 0x130 (0x130)
	struct FGameplayAttributeData PhysicalDamageBase;  // 0x140 (0x140)
	struct FGameplayAttributeData PhysicalPower;  // 0x150 (0x150)
	struct FGameplayAttributeData PhysicalDamageMod;  // 0x160 (0x160)
	struct FGameplayAttributeData PhysicalDamageAdd;  // 0x170 (0x170)
	struct FGameplayAttributeData PhysicalDamageTrue;  // 0x180 (0x180)
	struct FGameplayAttributeData PhysicalBackstabPower;  // 0x190 (0x190)
	struct FGameplayAttributeData PhysicalHeadshotPower;  // 0x1A0 (0x1A0)
	struct FGameplayAttributeData PhysicalHeadshotPenetration;  // 0x1B0 (0x1B0)
	struct FGameplayAttributeData ArmorPenetration;  // 0x1C0 (0x1C0)
	struct FGameplayAttributeData ArmorRating;  // 0x1D0 (0x1D0)
	struct FGameplayAttributeData ItemArmorRating;  // 0x1E0 (0x1E0)
	struct FGameplayAttributeData ItemArmorRatingMod;  // 0x1F0 (0x1F0)
	struct FGameplayAttributeData PhysicalReduction;  // 0x200 (0x200)
	struct FGameplayAttributeData PhysicalReductionMod;  // 0x210 (0x210)
	struct FGameplayAttributeData PhysicalAbsoluteReduction;  // 0x220 (0x220)
	struct FGameplayAttributeData MagicalDamageWeaponPrimary;  // 0x230 (0x230)
	struct FGameplayAttributeData MagicalDamageWeaponSecondary;  // 0x240 (0x240)
	struct FGameplayAttributeData MagicalDamageBase;  // 0x250 (0x250)
	struct FGameplayAttributeData MagicalPower;  // 0x260 (0x260)
	struct FGameplayAttributeData MagicalDamageMod;  // 0x270 (0x270)
	struct FGameplayAttributeData MagicalDamageAdd;  // 0x280 (0x280)
	struct FGameplayAttributeData MagicalDamageTrue;  // 0x290 (0x290)
	struct FGameplayAttributeData MagicPenetration;  // 0x2A0 (0x2A0)
	struct FGameplayAttributeData MagicalFireDamageBase;  // 0x2B0 (0x2B0)
	struct FGameplayAttributeData MagicalFireDamageMod;  // 0x2C0 (0x2C0)
	struct FGameplayAttributeData MagicalFireDamageAdd;  // 0x2D0 (0x2D0)
	struct FGameplayAttributeData MagicalArcaneDamageBase;  // 0x2E0 (0x2E0)
	struct FGameplayAttributeData MagicalArcaneDamageMod;  // 0x2F0 (0x2F0)
	struct FGameplayAttributeData MagicalArcaneDamageAdd;  // 0x300 (0x300)
	struct FGameplayAttributeData MagicalDarkDamageBase;  // 0x310 (0x310)
	struct FGameplayAttributeData MagicalDarkDamageMod;  // 0x320 (0x320)
	struct FGameplayAttributeData MagicalDarkDamageAdd;  // 0x330 (0x330)
	struct FGameplayAttributeData MagicResistance;  // 0x340 (0x340)
	struct FGameplayAttributeData MagicalReduction;  // 0x350 (0x350)
	struct FGameplayAttributeData MagicalReductionMod;  // 0x360 (0x360)
	struct FGameplayAttributeData MagicalAbsoluteReduction;  // 0x370 (0x370)
	struct FGameplayAttributeData FireMagicResistance;  // 0x380 (0x380)
	struct FGameplayAttributeData FireMagicalReduction;  // 0x390 (0x390)
	struct FGameplayAttributeData FireMagicalReductionMod;  // 0x3A0 (0x3A0)
	struct FGameplayAttributeData WaterMagicResistance;  // 0x3B0 (0x3B0)
	struct FGameplayAttributeData WaterMagicalReduction;  // 0x3C0 (0x3C0)
	struct FGameplayAttributeData WaterMagicalReductionMod;  // 0x3D0 (0x3D0)
	struct FGameplayAttributeData LightningMagicResistance;  // 0x3E0 (0x3E0)
	struct FGameplayAttributeData LightningMagicalReduction;  // 0x3F0 (0x3F0)
	struct FGameplayAttributeData LightningMagicalReductionMod;  // 0x400 (0x400)
	struct FGameplayAttributeData EarthMagicResistance;  // 0x410 (0x410)
	struct FGameplayAttributeData EarthMagicalReduction;  // 0x420 (0x420)
	struct FGameplayAttributeData EarthMagicalReductionMod;  // 0x430 (0x430)
	struct FGameplayAttributeData LightMagicResistance;  // 0x440 (0x440)
	struct FGameplayAttributeData LightMagicalReduction;  // 0x450 (0x450)
	struct FGameplayAttributeData LightMagicalReductionMod;  // 0x460 (0x460)
	struct FGameplayAttributeData DarkMagicResistance;  // 0x470 (0x470)
	struct FGameplayAttributeData DarkMagicalReduction;  // 0x480 (0x480)
	struct FGameplayAttributeData DarkMagicalReductionMod;  // 0x490 (0x490)
	struct FGameplayAttributeData ArcaneMagicResistance;  // 0x4A0 (0x4A0)
	struct FGameplayAttributeData ArcaneMagicalReduction;  // 0x4B0 (0x4B0)
	struct FGameplayAttributeData ArcaneMagicalReductionMod;  // 0x4C0 (0x4C0)
	struct FGameplayAttributeData DivineMagicResistance;  // 0x4D0 (0x4D0)
	struct FGameplayAttributeData DivineMagicalReduction;  // 0x4E0 (0x4E0)
	struct FGameplayAttributeData DivineMagicalReductionMod;  // 0x4F0 (0x4F0)
	struct FGameplayAttributeData EvilMagicResistance;  // 0x500 (0x500)
	struct FGameplayAttributeData EvilMagicalReduction;  // 0x510 (0x510)
	struct FGameplayAttributeData EvilMagicalReductionMod;  // 0x520 (0x520)
	struct FGameplayAttributeData AirMagicResistance;  // 0x530 (0x530)
	struct FGameplayAttributeData AirMagicalReduction;  // 0x540 (0x540)
	struct FGameplayAttributeData AirMagicalReductionMod;  // 0x550 (0x550)
	struct FGameplayAttributeData SpiritMagicResistance;  // 0x560 (0x560)
	struct FGameplayAttributeData SpiritMagicalReduction;  // 0x570 (0x570)
	struct FGameplayAttributeData SpiritMagicalReductionMod;  // 0x580 (0x580)
	struct FGameplayAttributeData HeadshotReductionMod;  // 0x590 (0x590)
	struct FGameplayAttributeData ProjectileReductionMod;  // 0x5A0 (0x5A0)
	struct FGameplayAttributeData ImpactPower;  // 0x5B0 (0x5B0)
	struct FGameplayAttributeData ImpactResistance;  // 0x5C0 (0x5C0)
	struct FGameplayAttributeData ImpactEndurance;  // 0x5D0 (0x5D0)
	struct FGameplayAttributeData MaxImpactEndurance;  // 0x5E0 (0x5E0)
	char pad_1520[8];  // 0x5F0 (0x5F0)
	struct FGameplayAttributeData PhysicalHealBase;  // 0x5F8 (0x5F8)
	struct FGameplayAttributeData PhysicalHealMod;  // 0x608 (0x608)
	struct FGameplayAttributeData MagicalHealBase;  // 0x618 (0x618)
	struct FGameplayAttributeData MagicalHealMod;  // 0x628 (0x628)
	struct FGameplayAttributeData RecoverableHealth;  // 0x638 (0x638)
	struct FGameplayAttributeData Health;  // 0x648 (0x648)
	struct FGameplayAttributeData MaxHealth;  // 0x658 (0x658)
	char pad_1640[8];  // 0x668 (0x668)
	struct FGameplayAttributeData MaxHealthBase;  // 0x670 (0x670)
	struct FGameplayAttributeData MaxHealthMod;  // 0x680 (0x680)
	struct FGameplayAttributeData MaxHealthAdd;  // 0x690 (0x690)
	struct FGameplayAttributeData PhysicalShield;  // 0x6A0 (0x6A0)
	struct FGameplayAttributeData MaxPhysicalShield;  // 0x6B0 (0x6B0)
	struct FGameplayAttributeData MagicalShield;  // 0x6C0 (0x6C0)
	struct FGameplayAttributeData MaxMagicalShield;  // 0x6D0 (0x6D0)
	struct FGameplayAttributeData TotalShield;  // 0x6E0 (0x6E0)
	struct FGameplayAttributeData MaxTotalShield;  // 0x6F0 (0x6F0)
	struct FGameplayAttributeData SpellPayload;  // 0x700 (0x700)
	struct FGameplayAttributeData SpellCapacity;  // 0x710 (0x710)
	struct FGameplayAttributeData SpellCapacityBase;  // 0x720 (0x720)
	struct FGameplayAttributeData SpellCapacityMod;  // 0x730 (0x730)
	struct FGameplayAttributeData SpellCapacityAdd;  // 0x740 (0x740)
	struct FGameplayAttributeData MoveSpeed;  // 0x750 (0x750)
	struct FGameplayAttributeData MoveSpeedBase;  // 0x760 (0x760)
	struct FGameplayAttributeData MoveSpeedMod;  // 0x770 (0x770)
	struct FGameplayAttributeData MoveSpeedAdd;  // 0x780 (0x780)
	struct FGameplayAttributeData MoveSpeedArmorPenalty;  // 0x790 (0x790)
	struct FGameplayAttributeData MoveSpeedArmorPenaltyMod;  // 0x7A0 (0x7A0)
	struct FGameplayAttributeData MoveSpeedWithModifier;  // 0x7B0 (0x7B0)
	struct FGameplayAttributeData ActionSpeed;  // 0x7C0 (0x7C0)
	struct FGameplayAttributeData SpellCastingSpeed;  // 0x7D0 (0x7D0)
	struct FGameplayAttributeData ItemEquipSpeed;  // 0x7E0 (0x7E0)
	struct FGameplayAttributeData RegularInteractionSpeedBase;  // 0x7F0 (0x7F0)
	struct FGameplayAttributeData RegularInteractionSpeed;  // 0x800 (0x800)
	struct FGameplayAttributeData MagicalInteractionSpeed;  // 0x810 (0x810)
	struct FGameplayAttributeData BuffDurationMod;  // 0x820 (0x820)
	struct FGameplayAttributeData DebuffDurationMod;  // 0x830 (0x830)
	struct FGameplayAttributeData UtilityEffectiveness;  // 0x840 (0x840)
	struct FGameplayAttributeData UtilityEffectivenessBase;  // 0x850 (0x850)
	struct FGameplayAttributeData UtilityEffectivenessMod;  // 0x860 (0x860)
	struct FGameplayAttributeData UtilityEffectivenessAdd;  // 0x870 (0x870)
	struct FGameplayAttributeData Weight;  // 0x880 (0x880)
	struct FGameplayAttributeData WeightLimit;  // 0x890 (0x890)
	struct FGameplayAttributeData WeightLimitBase;  // 0x8A0 (0x8A0)
	struct FGameplayAttributeData WeightLimitMod;  // 0x8B0 (0x8B0)
	struct FGameplayAttributeData WeightLimitAdd;  // 0x8C0 (0x8C0)
	struct FGameplayAttributeData Luck;  // 0x8D0 (0x8D0)


	void OnRep_WillMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_WillMod
	void OnRep_WillBase(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_WillBase
	void OnRep_Will(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_Will
	void OnRep_WeightLimitMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_WeightLimitMod
	void OnRep_WeightLimitBase(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_WeightLimitBase
	void OnRep_WeightLimitAdd(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_WeightLimitAdd
	void OnRep_WeightLimit(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_WeightLimit
	void OnRep_Weight(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_Weight
	void OnRep_WaterMagicResistance(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_WaterMagicResistance
	void OnRep_WaterMagicalReductionMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_WaterMagicalReductionMod
	void OnRep_WaterMagicalReduction(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_WaterMagicalReduction
	void OnRep_UtilityEffectivenessMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_UtilityEffectivenessMod
	void OnRep_UtilityEffectivenessBase(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_UtilityEffectivenessBase
	void OnRep_UtilityEffectivenessAdd(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_UtilityEffectivenessAdd
	void OnRep_UtilityEffectiveness(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_UtilityEffectiveness
	void OnRep_TotalShield(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_TotalShield
	void OnRep_StrengthMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_StrengthMod
	void OnRep_StrengthBase(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_StrengthBase
	void OnRep_Strength(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_Strength
	void OnRep_SpiritMagicResistance(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_SpiritMagicResistance
	void OnRep_SpiritMagicalReductionMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_SpiritMagicalReductionMod
	void OnRep_SpiritMagicalReduction(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_SpiritMagicalReduction
	void OnRep_SpellPayload(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_SpellPayload
	void OnRep_SpellCastingSpeed(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_SpellCastingSpeed
	void OnRep_SpellCapacityMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_SpellCapacityMod
	void OnRep_SpellCapacityBase(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_SpellCapacityBase
	void OnRep_SpellCapacityAdd(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_SpellCapacityAdd
	void OnRep_SpellCapacity(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_SpellCapacity
	void OnRep_ResourcefulnessMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_ResourcefulnessMod
	void OnRep_ResourcefulnessBase(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_ResourcefulnessBase
	void OnRep_Resourcefulness(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_Resourcefulness
	void OnRep_RegularInteractionSpeedBase(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_RegularInteractionSpeedBase
	void OnRep_RegularInteractionSpeed(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_RegularInteractionSpeed
	void OnRep_RecoverableHealth(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_RecoverableHealth
	void OnRep_ProjectileReductionMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_ProjectileReductionMod
	void OnRep_PhysicalShield(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalShield
	void OnRep_PhysicalReductionMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalReductionMod
	void OnRep_PhysicalReduction(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalReduction
	void OnRep_PhysicalPower(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalPower
	void OnRep_PhysicalHealMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalHealMod
	void OnRep_PhysicalHealBase(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalHealBase
	void OnRep_PhysicalHeadshotPower(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalHeadshotPower
	void OnRep_PhysicalHeadshotPenetration(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalHeadshotPenetration
	void OnRep_PhysicalDamageWeaponSecondary(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalDamageWeaponSecondary
	void OnRep_PhysicalDamageWeaponPrimary(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalDamageWeaponPrimary
	void OnRep_PhysicalDamageTrue(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalDamageTrue
	void OnRep_PhysicalDamageMod(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalDamageMod
	void OnRep_PhysicalDamageBase(struct FGameplayAttributeData& OldValue); // Function DungeonCrawler.DCAttributeSet.OnRep_PhysicalDamageBase
