#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function Engine.HUD.ReceiveHitBoxClick
struct FReceiveHitBoxClick
{
	struct FName BoxName;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.MaterialInput
struct FMaterialInput
{
	struct UMaterialExpression* Expression;  // 0x0 (0x0)
	int32_t OutputIndex;  // 0x8 (0x8)
	struct FName InputName;  // 0xC (0xC)
	int32_t Mask;  // 0x14 (0x14)
	int32_t MaskR;  // 0x18 (0x18)
	int32_t MaskG;  // 0x1C (0x1C)
	int32_t MaskB;  // 0x20 (0x20)
	int32_t MaskA;  // 0x24 (0x24)


}; 
 
 // ScriptStruct Engine.AnimNode_ConvertLocalToComponentSpace
// Size: 0x20(Inherited: 0x10)
struct FAnimNode_ConvertLocalToComponentSpace : FAnimNode_Base
{
	struct FPoseLink LocalPose;  // 0x10 (0x10)


}; 
 
 // Function Engine.Character.K2_OnMovementModeChanged
struct FK2_OnMovementModeChanged
{
	enum class EMovementMode PrevMovementMode;  // 0x0 (0x0)
	enum class EMovementMode NewMovementMode;  // 0x1 (0x1)
	char PrevCustomMode;  // 0x2 (0x2)
	char NewCustomMode;  // 0x3 (0x3)


}; 
 
 // Function Engine.CheatManager.BugItGo
struct FBugItGo
{
	float X;  // 0x0 (0x0)
	float Y;  // 0x4 (0x4)
	float Z;  // 0x8 (0x8)
	float Pitch;  // 0xC (0xC)
	float Yaw;  // 0x10 (0x10)
	float Roll;  // 0x14 (0x14)


}; 
 
 // Function Engine.GameplayStatics.DoesSaveGameExist
struct FDoesSaveGameExist
{
	struct FString SlotName;  // 0x0 (0x0)
	int32_t UserIndex;  // 0x10 (0x10)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool ReturnValue : 1;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)


}; 
 
 // Function Engine.AnimationDataController.RemoveAllAttributesForBone
struct FRemoveAllAttributesForBone
{
	struct FName BoneName;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bShouldTransact : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)
	int32_t ReturnValue;  // 0xC (0xC)


}; 
 
 // ScriptStruct Engine.AnimNode_SequencePlayerBase
// Size: 0x40(Inherited: 0x38)
struct FAnimNode_SequencePlayerBase : FAnimNode_AssetPlayerBase
{
	struct FInputScaleBiasClampState PlayRateScaleBiasClampState;  // 0x38 (0x38)


}; 
 
 // ScriptStruct Engine.CompositeReroute
struct FCompositeReroute
{
	struct FName Name;  // 0x0 (0x0)
	struct UMaterialExpressionReroute* Expression;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.OnPossessedPawnChanged__DelegateSignature
struct FOnPossessedPawnChanged__DelegateSignature
{
	struct APawn* OldPawn;  // 0x0 (0x0)
	struct APawn* NewPawn;  // 0x8 (0x8)


}; 
 
 // Function Engine.ForceFeedbackComponent.AdjustAttenuation
struct FAdjustAttenuation
{
	struct FForceFeedbackAttenuationSettings InAttenuationSettings;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Vector_Left
struct FVector_Left
{
	struct FVector ReturnValue;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.LandedSignature__DelegateSignature
struct FLandedSignature__DelegateSignature
{
	struct FHitResult Hit;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Multiply_VectorInt
struct FMultiply_VectorInt
{
	struct FVector A;  // 0x0 (0x0)
	int32_t B;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)
	struct FVector ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.GameplayStatics.SetActiveSpatialPluginByName
struct FSetActiveSpatialPluginByName
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FName InPluginName;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // ScriptStruct Engine.ExpressionOutput
struct FExpressionOutput
{
	struct FName OutputName;  // 0x0 (0x0)
	int32_t Mask;  // 0x8 (0x8)
	int32_t MaskR;  // 0xC (0xC)
	int32_t MaskG;  // 0x10 (0x10)
	int32_t MaskB;  // 0x14 (0x14)
	int32_t MaskA;  // 0x18 (0x18)


}; 
 
 // ScriptStruct Engine.ColorMaterialInput
// Size: 0x30(Inherited: 0x28)
struct FColorMaterialInput : FMaterialInput
{
	char UseConstant : 1;  // 0x28 (0x28)
	char pad_40_1 : 7;  // 0x28 (0x28)
	char pad_41[4];  // 0x29 (0x29)
	struct FColor Constant;  // 0x2C (0x2C)


}; 
 
 // Function Engine.KismetRenderingLibrary.ReadRenderTargetRaw
struct FReadRenderTargetRaw
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct UTextureRenderTarget2D* TextureRenderTarget;  // 0x8 (0x8)
	struct TArray<struct FLinearColor> OutLinearSamples;  // 0x10 (0x10)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool bNormalize : 1;  // 0x20 (0x20)
	char pad_33_1 : 7;  // 0x21 (0x21)
	bool ReturnValue : 1;  // 0x21 (0x21)
	char pad_34[6];  // 0x22 (0x22)


}; 
 
 // Function Engine.KismetMathLibrary.Matrix_GetFrustumRightPlane
struct FMatrix_GetFrustumRightPlane
{
	struct FMatrix M;  // 0x0 (0x0)
	struct FPlane OutPlane;  // 0x80 (0x80)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool ReturnValue : 1;  // 0xA0 (0xA0)
	char pad_161[15];  // 0xA1 (0xA1)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_InvalidateTimerHandle
struct FK2_InvalidateTimerHandle
{
	struct FTimerHandle Handle;  // 0x0 (0x0)
	struct FTimerHandle ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.ParseCommandLine
struct FParseCommandLine
{
	struct FString InCmdLine;  // 0x0 (0x0)
	struct TArray<struct FString> OutTokens;  // 0x10 (0x10)
	struct TArray<struct FString> OutSwitches;  // 0x20 (0x20)
	struct TMap<struct FString, struct FString> OutParams;  // 0x30 (0x30)


}; 
 
 // ScriptStruct Engine.A2Pose
struct FA2Pose
{
	struct TArray<struct FTransform> Bones;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.DistributionLookupTable
struct FDistributionLookupTable
{
	float TimeScale;  // 0x0 (0x0)
	float TimeBias;  // 0x4 (0x4)
	struct TArray<float> Values;  // 0x8 (0x8)
	char Op;  // 0x18 (0x18)
	char EntryCount;  // 0x19 (0x19)
	char EntryStride;  // 0x1A (0x1A)
	char SubEntryStride;  // 0x1B (0x1B)
	char LockFlag;  // 0x1C (0x1C)
	char pad_29[3];  // 0x1D (0x1D)


}; 
 
 // Function Engine.PrimitiveComponent.SetEmissiveLightSource
struct FSetEmissiveLightSource
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool NewEmissiveLightSource : 1;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnSubmixEnvelope__DelegateSignature
struct FOnSubmixEnvelope__DelegateSignature
{
	struct TArray<float> Envelope;  // 0x0 (0x0)


}; 
 
 // Function Engine.GameplayStatics.GetIntOption
struct FGetIntOption
{
	struct FString Options;  // 0x0 (0x0)
	struct FString Key;  // 0x10 (0x10)
	int32_t DefaultValue;  // 0x20 (0x20)
	int32_t ReturnValue;  // 0x24 (0x24)


}; 
 
 // ScriptStruct Engine.LatentActionInfo
struct FLatentActionInfo
{
	int32_t Linkage;  // 0x0 (0x0)
	int32_t UUID;  // 0x4 (0x4)
	struct FName ExecutionFunction;  // 0x8 (0x8)
	struct UObject* CallbackTarget;  // 0x10 (0x10)


}; 
 
 // Function Engine.GameViewportClient.SetConsoleTarget
struct FSetConsoleTarget
{
	int32_t PlayerIndex;  // 0x0 (0x0)


}; 
 
 // Function Engine.InstancedStaticMeshComponent.SetCullDistances
struct FSetCullDistances
{
	int32_t StartCullDistance;  // 0x0 (0x0)
	int32_t EndCullDistance;  // 0x4 (0x4)


}; 
 
 // DelegateFunction Engine.OnQueueSubtitles__DelegateSignature
struct FOnQueueSubtitles__DelegateSignature
{
	struct TArray<struct FSubtitleCue> Subtitles;  // 0x0 (0x0)
	float CueDuration;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // ScriptStruct Engine.SoundWaveSpectralData
struct FSoundWaveSpectralData
{
	float FrequencyHz;  // 0x0 (0x0)
	float Magnitude;  // 0x4 (0x4)
	float NormalizedMagnitude;  // 0x8 (0x8)


}; 
 
 // Function Engine.ActorComponent.SetAutoActivate
struct FSetAutoActivate
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewAutoActivate : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetDistanceTo
struct FGetDistanceTo
{
	struct AActor* OtherActor;  // 0x0 (0x0)
	float ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // DelegateFunction Engine.OnActorReady__DelegateSignature
struct FOnActorReady__DelegateSignature
{
	struct FActorInstanceHandle InHandle;  // 0x0 (0x0)
	struct FActorInstanceHandle ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetInputLibrary.InputEvent_IsLeftShiftDown
struct FInputEvent_IsLeftShiftDown
{
	struct FInputEvent Input;  // 0x0 (0x0)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)


}; 
 
 // Function Engine.Actor.GetActorRelativeScale3D
struct FGetActorRelativeScale3D
{
	struct FVector ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.SoundSubmix.AddSpectralAnalysisDelegate
struct FAddSpectralAnalysisDelegate
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct TArray<struct FSoundSubmixSpectralAnalysisBandSettings> InBandSettings;  // 0x8 (0x8)
	struct FDelegate OnSubmixSpectralAnalysisBP;  // 0x18 (0x18)
	float UpdateRate;  // 0x28 (0x28)
	float DecibelNoiseFloor;  // 0x2C (0x2C)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool bDoNormalize : 1;  // 0x30 (0x30)
	char pad_49_1 : 7;  // 0x31 (0x31)
	bool bDoAutoRange : 1;  // 0x31 (0x31)
	char pad_50[2];  // 0x32 (0x32)
	float AutoRangeAttackTime;  // 0x34 (0x34)
	float AutoRangeReleaseTime;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)


}; 
 
 // ScriptStruct Engine.ExpressionInput
struct FExpressionInput
{
	struct UMaterialExpression* Expression;  // 0x0 (0x0)
	int32_t OutputIndex;  // 0x8 (0x8)
	struct FName InputName;  // 0xC (0xC)
	int32_t Mask;  // 0x14 (0x14)
	int32_t MaskR;  // 0x18 (0x18)
	int32_t MaskG;  // 0x1C (0x1C)
	int32_t MaskB;  // 0x20 (0x20)
	int32_t MaskA;  // 0x24 (0x24)


}; 
 
 // Function Engine.DirectionalLightComponent.SetDynamicShadowDistanceStationaryLight
struct FSetDynamicShadowDistanceStationaryLight
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.SetObjectPropertyByName
struct FSetObjectPropertyByName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)
	struct UObject* Value;  // 0x10 (0x10)


}; 
 
 // DelegateFunction Engine.OnSubmixEnvelopeBP__DelegateSignature
struct FOnSubmixEnvelopeBP__DelegateSignature
{
	struct TArray<float> Envelope;  // 0x0 (0x0)


}; 
 
 // Function Engine.GameModeBase.K2_OnSwapPlayerControllers
struct FK2_OnSwapPlayerControllers
{
	struct APlayerController* OldPC;  // 0x0 (0x0)
	struct APlayerController* NewPC;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.HitResult
struct FHitResult
{
	int32_t FaceIndex;  // 0x0 (0x0)
	float Time;  // 0x4 (0x4)
	float Distance;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct FVector_NetQuantize Location;  // 0x10 (0x10)
	struct FVector_NetQuantize ImpactPoint;  // 0x28 (0x28)
	struct FVector_NetQuantizeNormal Normal;  // 0x40 (0x40)
	struct FVector_NetQuantizeNormal ImpactNormal;  // 0x58 (0x58)
	struct FVector_NetQuantize TraceStart;  // 0x70 (0x70)
	struct FVector_NetQuantize TraceEnd;  // 0x88 (0x88)
	float PenetrationDepth;  // 0xA0 (0xA0)
	int32_t MyItem;  // 0xA4 (0xA4)
	int32_t Item;  // 0xA8 (0xA8)
	char ElementIndex;  // 0xAC (0xAC)
	char bBlockingHit : 1;  // 0xAD (0xAD)
	char bStartPenetrating : 1;  // 0xAD (0xAD)
	char pad_173_1 : 6;  // 0xAD (0xAD)
	char pad_174[3];  // 0xAE (0xAE)
	struct TWeakObjectPtr<UPhysicalMaterial> PhysMaterial;  // 0xB0 (0xB0)
	struct FActorInstanceHandle HitObjectHandle;  // 0xB8 (0xB8)
	struct TWeakObjectPtr<UPrimitiveComponent> Component;  // 0xD0 (0xD0)
	struct FName BoneName;  // 0xD8 (0xD8)
	struct FName MyBoneName;  // 0xE0 (0xE0)


}; 
 
 // Function Engine.KismetSystemLibrary.ResetGamepadAssignmentToController
struct FResetGamepadAssignmentToController
{
	int32_t ControllerId;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.GetMassScale
struct FGetMassScale
{
	struct FName BoneName;  // 0x0 (0x0)
	float ReturnValue;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.FloatDistribution
struct FFloatDistribution
{
	struct FDistributionLookupTable Table;  // 0x0 (0x0)


}; 
 
 // Function Engine.SplineComponent.GetTransformAtSplineInputKey
struct FGetTransformAtSplineInputKey
{
	float InKey;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool bUseScale : 1;  // 0x5 (0x5)
	char pad_6[10];  // 0x6 (0x6)
	struct FTransform ReturnValue;  // 0x10 (0x10)


}; 
 
 // DelegateFunction Engine.MovementModeChangedSignature__DelegateSignature
struct FMovementModeChangedSignature__DelegateSignature
{
	struct ACharacter* Character;  // 0x0 (0x0)
	enum class EMovementMode PrevMovementMode;  // 0x8 (0x8)
	char PreviousCustomMode;  // 0x9 (0x9)
	char pad_10[6];  // 0xA (0xA)


}; 
 
 // Function Engine.KismetMathLibrary.Conv_ByteToInt64
struct FConv_ByteToInt64
{
	char InByte;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	int64_t ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.PrimitiveComponent.SetVisibleInRayTracing
struct FSetVisibleInRayTracing
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewVisibleInRayTracing : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.CameraComponent.SetAspectRatio
struct FSetAspectRatio
{
	float InAspectRatio;  // 0x0 (0x0)


}; 
 
 // Function Engine.SceneComponent.K2_SetWorldLocation
struct FK2_SetWorldLocation
{
	struct FVector NewLocation;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bSweep : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FHitResult SweepHitResult;  // 0x20 (0x20)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool bTeleport : 1;  // 0x108 (0x108)
	char pad_265[7];  // 0x109 (0x109)


}; 
 
 // Function Engine.KismetMathLibrary.BooleanNOR
struct FBooleanNOR
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool A : 1;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool B : 1;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool ReturnValue : 1;  // 0x2 (0x2)


}; 
 
 // ScriptStruct Engine.FloatRK4SpringInterpolator
struct FFloatRK4SpringInterpolator
{
	float StiffnessConstant;  // 0x0 (0x0)
	float DampeningRatio;  // 0x4 (0x4)


}; 
 
 // Function Engine.ImportanceSamplingLibrary.ImportanceSample
struct FImportanceSample
{
	struct FImportanceTexture Texture;  // 0x0 (0x0)
	struct FVector2D Rand;  // 0x50 (0x50)
	int32_t Samples;  // 0x60 (0x60)
	float Intensity;  // 0x64 (0x64)
	struct FVector2D SamplePosition;  // 0x68 (0x68)
	struct FLinearColor SampleColor;  // 0x78 (0x78)
	float SampleIntensity;  // 0x88 (0x88)
	float SampleSize;  // 0x8C (0x8C)


}; 
 
 // DelegateFunction Engine.OnQuartzCommandEvent__DelegateSignature
struct FOnQuartzCommandEvent__DelegateSignature
{
	uint8_t EventType;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	struct FName Name;  // 0x4 (0x4)


}; 
 
 // ScriptStruct Engine.Vector_NetQuantizeNormal
// Size: 0x18(Inherited: 0x18)
struct FVector_NetQuantizeNormal : FVector
{


}; 
 
 // Function Engine.Texture2D.Blueprint_GetSizeY
struct FBlueprint_GetSizeY
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.PropertyAccessLibrary
struct FPropertyAccessLibrary
{
	struct TArray<struct FPropertyAccessSegment> PathSegments;  // 0x0 (0x0)
	struct TArray<struct FPropertyAccessPath> SrcPaths;  // 0x10 (0x10)
	struct TArray<struct FPropertyAccessPath> DestPaths;  // 0x20 (0x20)
	struct TArray<struct FPropertyAccessCopyBatch> CopyBatchArray;  // 0x30 (0x30)
	char pad_64[56];  // 0x40 (0x40)


}; 
 
 // DelegateFunction Engine.OnAudioMultiEnvelopeValue__DelegateSignature
struct FOnAudioMultiEnvelopeValue__DelegateSignature
{
	float AverageEnvelopeValue;  // 0x0 (0x0)
	float MaxEnvelope;  // 0x4 (0x4)
	int32_t NumWaveInstances;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.BreakTimespan2
struct FBreakTimespan2
{
	struct FTimespan InTimespan;  // 0x0 (0x0)
	int32_t Days;  // 0x8 (0x8)
	int32_t Hours;  // 0xC (0xC)
	int32_t Minutes;  // 0x10 (0x10)
	int32_t Seconds;  // 0x14 (0x14)
	int32_t FractionNano;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // DelegateFunction Engine.OnMontageEndedMCDelegate__DelegateSignature
struct FOnMontageEndedMCDelegate__DelegateSignature
{
	struct UAnimMontage* Montage;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bInterrupted : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.AnimInstance.GetPropagateNotifiesToLinkedInstances
struct FGetPropagateNotifiesToLinkedInstances
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnAudioPlaybackPercent__DelegateSignature
struct FOnAudioPlaybackPercent__DelegateSignature
{
	struct USoundWave* PlayingSoundWave;  // 0x0 (0x0)
	float PlaybackPercent;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.KismetSystemLibrary.SetUserActivity
struct FSetUserActivity
{
	struct FUserActivity UserActivity;  // 0x0 (0x0)


}; 
 
 // Function Engine.GameplayStatics.FindNearestActor
struct FFindNearestActor
{
	struct FVector Origin;  // 0x0 (0x0)
	struct TArray<struct AActor*> ActorsToCheck;  // 0x18 (0x18)
	float Distance;  // 0x28 (0x28)
	char pad_44[4];  // 0x2C (0x2C)
	struct AActor* ReturnValue;  // 0x30 (0x30)


}; 
 
 // ScriptStruct Engine.FormatArgumentData
struct FFormatArgumentData
{
	struct FString ArgumentName;  // 0x0 (0x0)
	enum class EFormatArgumentType ArgumentValueType;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct FText ArgumentValue;  // 0x18 (0x18)
	int64_t ArgumentValueInt;  // 0x30 (0x30)
	float ArgumentValueFloat;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)
	double ArgumentValueDouble;  // 0x40 (0x40)
	uint8_t ArgumentValueGender;  // 0x48 (0x48)
	char pad_73[7];  // 0x49 (0x49)


}; 
 
 // ScriptStruct Engine.DataCacheDuplicatedObjectData
struct FDataCacheDuplicatedObjectData
{
	char pad_0[16];  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetActorEnableCollision
struct FGetActorEnableCollision
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.DataTableRowHandle
struct FDataTableRowHandle
{
	struct UDataTable* DataTable;  // 0x0 (0x0)
	struct FName RowName;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.OnMontageBlendingOutStartedMCDelegate__DelegateSignature
struct FOnMontageBlendingOutStartedMCDelegate__DelegateSignature
{
	struct UAnimMontage* Montage;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bInterrupted : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetMathLibrary.VSizeXY
struct FVSizeXY
{
	struct FVector A;  // 0x0 (0x0)
	double ReturnValue;  // 0x18 (0x18)


}; 
 
 // ScriptStruct Engine.MaterialParameterCollectionInfo
struct FMaterialParameterCollectionInfo
{
	struct FGuid StateId;  // 0x0 (0x0)
	struct UMaterialParameterCollection* ParameterCollection;  // 0x10 (0x10)


}; 
 
 // Function Engine.GameplayStatics.AreSubtitlesEnabled
struct FAreSubtitlesEnabled
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.CollisionProfileName
struct FCollisionProfileName
{
	struct FName Name;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.PerPlatformFloat
struct FPerPlatformFloat
{
	float Default;  // 0x0 (0x0)


}; 
 
 // Function Engine.FXSystemComponent.SetUseAutoManageAttachment
struct FSetUseAutoManageAttachment
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bAutoManage : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.AtmosphericFogComponent.SetPrecomputeParams
struct FSetPrecomputeParams
{
	float DensityHeight;  // 0x0 (0x0)
	int32_t MaxScatteringOrder;  // 0x4 (0x4)
	int32_t InscatterAltitudeSampleNum;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.PhysicalAnimationProfile
struct FPhysicalAnimationProfile
{
	struct FName ProfileName;  // 0x0 (0x0)
	struct FPhysicalAnimationData PhysicalAnimationData;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.MaterialAttributesInput
// Size: 0x30(Inherited: 0x28)
struct FMaterialAttributesInput : FExpressionInput
{
	int32_t PropertyConnectedBitmask;  // 0x28 (0x28)
	char pad_44[4];  // 0x2C (0x2C)


}; 
 
 // Function Engine.PlayerState.GetPlayerId
struct FGetPlayerId
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ConstrainComponentPropName
struct FConstrainComponentPropName
{
	struct FName ComponentName;  // 0x0 (0x0)


}; 
 
 // Function Engine.InputSettings.GetActionMappingByName
struct FGetActionMappingByName
{
	struct FName InActionName;  // 0x0 (0x0)
	struct TArray<struct FInputActionKeyMapping> OutMappings;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.NonBlendableQuaternionAnimationAttribute
// Size: 0x20(Inherited: 0x20)
struct FNonBlendableQuaternionAnimationAttribute : FQuaternionAnimationAttribute
{


}; 
 
 // Function Engine.Actor.ReceiveTick
struct FReceiveTick
{
	float DeltaSeconds;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnQuartzCommandEventBP__DelegateSignature
struct FOnQuartzCommandEventBP__DelegateSignature
{
	uint8_t EventType;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	struct FName Name;  // 0x4 (0x4)


}; 
 
 // Function Engine.KismetMathLibrary.RandomUnitVectorInEllipticalConeInRadiansFromStream
struct FRandomUnitVectorInEllipticalConeInRadiansFromStream
{
	struct FVector ConeDir;  // 0x0 (0x0)
	float MaxYawInRadians;  // 0x18 (0x18)
	float MaxPitchInRadians;  // 0x1C (0x1C)
	struct FRandomStream Stream;  // 0x20 (0x20)
	struct FVector ReturnValue;  // 0x28 (0x28)


}; 
 
 // Function Engine.BlueprintPlatformLibrary.GetLaunchNotification
struct FGetLaunchNotification
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool NotificationLaunchedApp : 1;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FString ActivationEvent;  // 0x8 (0x8)
	int32_t FireDate;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // Function Engine.KismetMathLibrary.Conv_IntToVector
struct FConv_IntToVector
{
	int32_t inInt;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.MakeRotFromY
struct FMakeRotFromY
{
	struct FVector Y;  // 0x0 (0x0)
	struct FRotator ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.Character.ServerMove
struct FServerMove
{
	float Timestamp;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector_NetQuantize10 InAccel;  // 0x8 (0x8)
	struct FVector_NetQuantize100 ClientLoc;  // 0x20 (0x20)
	char CompressedMoveFlags;  // 0x38 (0x38)
	char ClientRoll;  // 0x39 (0x39)
	char pad_58[2];  // 0x3A (0x3A)
	uint32_t View;  // 0x3C (0x3C)
	struct UPrimitiveComponent* ClientMovementBase;  // 0x40 (0x40)
	struct FName ClientBaseBoneName;  // 0x48 (0x48)
	char ClientMovementMode;  // 0x50 (0x50)
	char pad_81[7];  // 0x51 (0x51)


}; 
 
 // ScriptStruct Engine.EquirectProps
struct FEquirectProps
{
	struct FBox2D LeftUVRect;  // 0x0 (0x0)
	struct FBox2D RightUVRect;  // 0x28 (0x28)
	struct FVector2D LeftScale;  // 0x50 (0x50)
	struct FVector2D RightScale;  // 0x60 (0x60)
	struct FVector2D LeftBias;  // 0x70 (0x70)
	struct FVector2D RightBias;  // 0x80 (0x80)


}; 
 
 // DelegateFunction Engine.InstigatedAnyDamageSignature__DelegateSignature
struct FInstigatedAnyDamageSignature__DelegateSignature
{
	float Damage;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UDamageType* DamageType;  // 0x8 (0x8)
	struct AActor* DamagedActor;  // 0x10 (0x10)
	struct AActor* DamageCauser;  // 0x18 (0x18)


}; 
 
 // ScriptStruct Engine.RawDistribution
struct FRawDistribution
{
	struct FDistributionLookupTable Table;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.IntegerAnimationAttribute
struct FIntegerAnimationAttribute
{
	int32_t Value;  // 0x0 (0x0)


}; 
 
 // SparseDelegateFunction Engine.ComponentPhysicsStateChanged__DelegateSignature
struct FComponentPhysicsStateChanged__DelegateSignature
{
	struct UPrimitiveComponent* ChangedComponent;  // 0x0 (0x0)
	uint8_t StateChange;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.CheatManager.CheatScript
struct FCheatScript
{
	struct FString ScriptName;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.BlendParameter
struct FBlendParameter
{
	struct FString DisplayName;  // 0x0 (0x0)
	float Min;  // 0x10 (0x10)
	float Max;  // 0x14 (0x14)
	int32_t GridNum;  // 0x18 (0x18)
	char pad_28_1 : 7;  // 0x1C (0x1C)
	bool bSnapToGrid : 1;  // 0x1C (0x1C)
	char pad_29_1 : 7;  // 0x1D (0x1D)
	bool bWrapInput : 1;  // 0x1D (0x1D)
	char pad_30[2];  // 0x1E (0x1E)


}; 
 
 // DelegateFunction Engine.InputVectorAxisHandlerDynamicSignature__DelegateSignature
struct FInputVectorAxisHandlerDynamicSignature__DelegateSignature
{
	struct FVector AxisValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.InputComponent.GetControllerAnalogKeyState
struct FGetControllerAnalogKeyState
{
	struct FKey Key;  // 0x0 (0x0)
	float ReturnValue;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // Function Engine.AnimNotifyState.Received_NotifyTick
struct FReceived_NotifyTick
{
	struct USkeletalMeshComponent* MeshComp;  // 0x0 (0x0)
	struct UAnimSequenceBase* Animation;  // 0x8 (0x8)
	float FrameDeltaTime;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)
	struct FAnimNotifyEventReference EventReference;  // 0x18 (0x18)
	char pad_64_1 : 7;  // 0x40 (0x40)
	bool ReturnValue : 1;  // 0x40 (0x40)
	char pad_65[7];  // 0x41 (0x41)


}; 
 
 // Function Engine.Actor.K2_SetActorLocation
struct FK2_SetActorLocation
{
	struct FVector NewLocation;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bSweep : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FHitResult SweepHitResult;  // 0x20 (0x20)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool bTeleport : 1;  // 0x108 (0x108)
	char pad_265_1 : 7;  // 0x109 (0x109)
	bool ReturnValue : 1;  // 0x109 (0x109)
	char pad_266[6];  // 0x10A (0x10A)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPrimaryAssetsWithBundleState
struct FGetPrimaryAssetsWithBundleState
{
	struct TArray<struct FName> RequiredBundles;  // 0x0 (0x0)
	struct TArray<struct FName> ExcludedBundles;  // 0x10 (0x10)
	struct TArray<struct FPrimaryAssetType> ValidTypes;  // 0x20 (0x20)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool bForceCurrentState : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)
	struct TArray<struct FPrimaryAssetId> OutPrimaryAssetIdList;  // 0x38 (0x38)


}; 
 
 // Function Engine.Character.IsPlayingRootMotion
struct FIsPlayingRootMotion
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.LightComponent.SetEnableLightShaftBloom
struct FSetEnableLightShaftBloom
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.IsOverlappingComponent
struct FIsOverlappingComponent
{
	struct UPrimitiveComponent* OtherComp;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // ScriptStruct Engine.VectorRK4SpringInterpolator
struct FVectorRK4SpringInterpolator
{
	float StiffnessConstant;  // 0x0 (0x0)
	float DampeningRatio;  // 0x4 (0x4)


}; 
 
 // Function Engine.CurveSourceInterface.GetCurves
struct FGetCurves
{
	struct TArray<struct FNamedCurveValue> OutValues;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.BreakVector
struct FBreakVector
{
	struct FVector InVec;  // 0x0 (0x0)
	double X;  // 0x18 (0x18)
	double Y;  // 0x20 (0x20)
	double Z;  // 0x28 (0x28)


}; 
 
 // Function Engine.SkeletalMesh.K2_GetAllMorphTargetNames
struct FK2_GetAllMorphTargetNames
{
	struct TArray<struct FString> ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.CanLaunchURL
struct FCanLaunchURL
{
	struct FString URL;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // ScriptStruct Engine.ActorDataLayer
struct FActorDataLayer
{
	struct FName Name;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ScalarMaterialInput
// Size: 0x30(Inherited: 0x28)
struct FScalarMaterialInput : FMaterialInput
{
	char UseConstant : 1;  // 0x28 (0x28)
	char pad_40_1 : 7;  // 0x28 (0x28)
	char pad_41[4];  // 0x29 (0x29)
	float Constant;  // 0x2C (0x2C)


}; 
 
 // ScriptStruct Engine.VectorDistribution
struct FVectorDistribution
{
	struct FDistributionLookupTable Table;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetTextLibrary.AsTimespan_Timespan
struct FAsTimespan_Timespan
{
	struct FTimespan InTimespan;  // 0x0 (0x0)
	struct FText ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.SubsystemBlueprintLibrary.GetEngineSubsystem
struct FGetEngineSubsystem
{
	UEngineSubsystem* Class;  // 0x0 (0x0)
	struct UEngineSubsystem* ReturnValue;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.TimecodeCustomAttributeNameSettings
struct FTimecodeCustomAttributeNameSettings
{
	struct FName HourAttributeName;  // 0x0 (0x0)
	struct FName MinuteAttributeName;  // 0x8 (0x8)
	struct FName SecondAttributeName;  // 0x10 (0x10)
	struct FName FrameAttributeName;  // 0x18 (0x18)
	struct FName SubframeAttributeName;  // 0x20 (0x20)
	struct FName RateAttributeName;  // 0x28 (0x28)
	struct FName TakenameAttributeName;  // 0x30 (0x30)


}; 
 
 // Function Engine.SceneComponent.K2_GetComponentRotation
struct FK2_GetComponentRotation
{
	struct FRotator ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetTickableWhenPaused
struct FGetTickableWhenPaused
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.ReceiveActorOnInputTouchLeave
struct FReceiveActorOnInputTouchLeave
{
	enum class ETouchIndex FingerIndex;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.BlueprintInputKeyDelegateBinding
// Size: 0x38(Inherited: 0x4)
struct FBlueprintInputKeyDelegateBinding : FBlueprintInputDelegateBinding
{
	char pad_4[4];  // 0x4 (0x4)
	struct FInputChord InputChord;  // 0x8 (0x8)
	enum class EInputEvent InputKeyEvent;  // 0x28 (0x28)
	char pad_41[3];  // 0x29 (0x29)
	struct FName FunctionNameToBind;  // 0x2C (0x2C)
	char pad_52[4];  // 0x34 (0x34)


}; 
 
 // ScriptStruct Engine.PaintedVertex
struct FPaintedVertex
{
	struct FVector Position;  // 0x0 (0x0)
	struct FColor Color;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)
	struct FVector4 Normal;  // 0x20 (0x20)


}; 
 
 // Function Engine.PlayerCameraManager.RemoveGenericCameraLensEffect
struct FRemoveGenericCameraLensEffect
{
	struct TScriptInterface<ICameraLensEffectInterface> Emitter;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Not_Int
struct FNot_Int
{
	int32_t A;  // 0x0 (0x0)
	int32_t ReturnValue;  // 0x4 (0x4)


}; 
 
 // Function Engine.FXSystemComponent.GetFXSystemAsset
struct FGetFXSystemAsset
{
	struct UFXSystemAsset* ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.LightComponentBase.SetCastVolumetricShadow
struct FSetCastVolumetricShadow
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetInputAxisKeyValue
struct FGetInputAxisKeyValue
{
	struct FKey InputAxisKey;  // 0x0 (0x0)
	float ReturnValue;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // Function Engine.KismetMathLibrary.Conv_Vector4ToQuaternion
struct FConv_Vector4ToQuaternion
{
	struct FVector4 InVec;  // 0x0 (0x0)
	struct FQuat ReturnValue;  // 0x20 (0x20)


}; 
 
 // ScriptStruct Engine.StartPhysicsTickFunction
// Size: 0x30(Inherited: 0x28)
struct FStartPhysicsTickFunction : FTickFunction
{
	char pad_40[8];  // 0x28 (0x28)


}; 
 
 // ScriptStruct Engine.ShadingModelMaterialInput
// Size: 0x28(Inherited: 0x28)
struct FShadingModelMaterialInput : FMaterialInput
{


}; 
 
 // ScriptStruct Engine.AssetEditorOrbitCameraPosition
struct FAssetEditorOrbitCameraPosition
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bIsSet : 1;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FVector CamOrbitPoint;  // 0x8 (0x8)
	struct FVector CamOrbitZoom;  // 0x20 (0x20)
	struct FRotator CamOrbitRotation;  // 0x38 (0x38)


}; 
 
 // ScriptStruct Engine.StrataMaterialInput
// Size: 0x28(Inherited: 0x28)
struct FStrataMaterialInput : FMaterialInput
{


}; 
 
 // ScriptStruct Engine.RuntimeCurveLinearColor
struct FRuntimeCurveLinearColor
{
	struct FRichCurve ColorCurves[4];  // 0x0 (0x0)
	struct UCurveLinearColor* ExternalCurve;  // 0x200 (0x200)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_SoftObjRefToSoftClassPath
struct FConv_SoftObjRefToSoftClassPath
{
	struct TSoftClassPtr<UObject> SoftClassReference;  // 0x0 (0x0)
	struct FSoftClassPath ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.Actor.SetActorTickEnabled
struct FSetActorTickEnabled
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bEnabled : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.SplineComponent.GetRightVectorAtDistanceAlongSpline
struct FGetRightVectorAtDistanceAlongSpline
{
	float Distance;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.OnAudioVirtualizationChanged__DelegateSignature
struct FOnAudioVirtualizationChanged__DelegateSignature
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bIsVirtualized : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.AnimNode_UseCachedPose
// Size: 0x28(Inherited: 0x10)
struct FAnimNode_UseCachedPose : FAnimNode_Base
{
	struct FPoseLink LinkToCachingNode;  // 0x10 (0x10)
	struct FName CachePoseName;  // 0x20 (0x20)


}; 
 
 // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroupAndClass
struct FGetLinkedAnimLayerInstanceByGroupAndClass
{
	struct FName InGroup;  // 0x0 (0x0)
	UAnimInstance* InClass;  // 0x8 (0x8)
	struct UAnimInstance* ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetInternationalizationLibrary.SetCurrentLocale
struct FSetCurrentLocale
{
	struct FString culture;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool SaveToConfig : 1;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool ReturnValue : 1;  // 0x11 (0x11)
	char pad_18[6];  // 0x12 (0x12)


}; 
 
 // Function Engine.DataLayer.GetDataLayerLabel
struct FGetDataLayerLabel
{
	struct FName ReturnValue;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnAsyncHandleSaveGame__DelegateSignature
struct FOnAsyncHandleSaveGame__DelegateSignature
{
	struct USaveGame* SaveGame;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bSuccess : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.Actor.K2_SetActorLocationAndRotation
struct FK2_SetActorLocationAndRotation
{
	struct FVector NewLocation;  // 0x0 (0x0)
	struct FRotator NewRotation;  // 0x18 (0x18)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool bSweep : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)
	struct FHitResult SweepHitResult;  // 0x38 (0x38)
	char pad_288_1 : 7;  // 0x120 (0x120)
	bool bTeleport : 1;  // 0x120 (0x120)
	char pad_289_1 : 7;  // 0x121 (0x121)
	bool ReturnValue : 1;  // 0x121 (0x121)
	char pad_290[6];  // 0x122 (0x122)


}; 
 
 // Function Engine.Controller.SetIgnoreLookInput
struct FSetIgnoreLookInput
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewLookInput : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.SetCollisionResponseToAllChannels
struct FSetCollisionResponseToAllChannels
{
	enum class ECollisionResponse NewResponse;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Matrix_InverseTransformVector
struct FMatrix_InverseTransformVector
{
	struct FMatrix M;  // 0x0 (0x0)
	struct FVector V;  // 0x80 (0x80)
	struct FVector ReturnValue;  // 0x98 (0x98)


}; 
 
 // Function Engine.SkeletalMeshComponent.GetTeleportDistanceThreshold
struct FGetTeleportDistanceThreshold
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.Vector2MaterialInput
// Size: 0x38(Inherited: 0x28)
struct FVector2MaterialInput : FMaterialInput
{
	char UseConstant : 1;  // 0x28 (0x28)
	char pad_40_1 : 7;  // 0x28 (0x28)
	char pad_41[4];  // 0x29 (0x29)
	float ConstantX;  // 0x2C (0x2C)
	float ConstantY;  // 0x30 (0x30)
	char pad_52[4];  // 0x34 (0x34)


}; 
 
 // Function Engine.KismetInternationalizationLibrary.ClearCurrentAssetGroupCulture
struct FClearCurrentAssetGroupCulture
{
	struct FName AssetGroup;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool SaveToConfig : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.PrimitiveComponent.SetVisibleInSceneCaptureOnly
struct FSetVisibleInSceneCaptureOnly
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.SetMaterialByName
struct FSetMaterialByName
{
	struct FName MaterialSlotName;  // 0x0 (0x0)
	struct UMaterialInterface* Material;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.OnPrimaryAssetListLoaded__DelegateSignature
struct FOnPrimaryAssetListLoaded__DelegateSignature
{
	struct TArray<struct UObject*> Loaded;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Greater_Int64Int64
struct FGreater_Int64Int64
{
	int64_t A;  // 0x0 (0x0)
	int64_t B;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_SoftObjectReferenceToString
struct FConv_SoftObjectReferenceToString
{
	struct TSoftObjectPtr<UObject> SoftObjectReference;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x30 (0x30)


}; 
 
 // ScriptStruct Engine.Vector4Distribution
struct FVector4Distribution
{
	struct FDistributionLookupTable Table;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Matrix_TransformVector4
struct FMatrix_TransformVector4
{
	struct FMatrix M;  // 0x0 (0x0)
	struct FVector4 V;  // 0x80 (0x80)
	struct FVector4 ReturnValue;  // 0xA0 (0xA0)


}; 
 
 // Function Engine.Actor.K2_AttachToComponent
struct FK2_AttachToComponent
{
	struct USceneComponent* Parent;  // 0x0 (0x0)
	struct FName SocketName;  // 0x8 (0x8)
	uint8_t LocationRule;  // 0x10 (0x10)
	uint8_t RotationRule;  // 0x11 (0x11)
	uint8_t ScaleRule;  // 0x12 (0x12)
	char pad_19_1 : 7;  // 0x13 (0x13)
	bool bWeldSimulatedBodies : 1;  // 0x13 (0x13)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // ScriptStruct Engine.VectorMaterialInput
// Size: 0x38(Inherited: 0x28)
struct FVectorMaterialInput : FMaterialInput
{
	char UseConstant : 1;  // 0x28 (0x28)
	char pad_40_1 : 7;  // 0x28 (0x28)
	char pad_41[4];  // 0x29 (0x29)
	struct FVector3f Constant;  // 0x2C (0x2C)


}; 
 
 // Function Engine.KismetMathLibrary.MakeBoxSphereBounds
struct FMakeBoxSphereBounds
{
	struct FVector Origin;  // 0x0 (0x0)
	struct FVector BoxExtent;  // 0x18 (0x18)
	float SphereRadius;  // 0x30 (0x30)
	char pad_52[4];  // 0x34 (0x34)
	struct FBoxSphereBounds ReturnValue;  // 0x38 (0x38)


}; 
 
 // Function Engine.PlayerController.ClientGameEnded
struct FClientGameEnded
{
	struct AActor* EndGameFocus;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bIsWinner : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetMathLibrary.EqualExactly_Vector2DVector2D
struct FEqualExactly_Vector2DVector2D
{
	struct FVector2D A;  // 0x0 (0x0)
	struct FVector2D B;  // 0x10 (0x10)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)


}; 
 
 // DelegateFunction Engine.AnimDataModelModifiedDynamicEvent__DelegateSignature
struct FAnimDataModelModifiedDynamicEvent__DelegateSignature
{
	uint8_t NotifType;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct UAnimDataModel* Model;  // 0x8 (0x8)
	struct FAnimDataModelNotifPayload Payload;  // 0x10 (0x10)


}; 
 
 // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataFloat
struct FSetDefaultCustomPrimitiveDataFloat
{
	int32_t DataIndex;  // 0x0 (0x0)
	float Value;  // 0x4 (0x4)


}; 
 
 // Function Engine.BlueprintPathsLibrary.SourceConfigDir
struct FSourceConfigDir
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.HUD.DrawRect
struct FDrawRect
{
	struct FLinearColor RectColor;  // 0x0 (0x0)
	float ScreenX;  // 0x10 (0x10)
	float ScreenY;  // 0x14 (0x14)
	float ScreenW;  // 0x18 (0x18)
	float ScreenH;  // 0x1C (0x1C)


}; 
 
 // Function Engine.KismetSystemLibrary.SetDoublePropertyByName
struct FSetDoublePropertyByName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)
	double Value;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetStringLibrary.LeftPad
struct FLeftPad
{
	struct FString SourceString;  // 0x0 (0x0)
	int32_t ChCount;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)
	struct FString ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.SceneComponent.K2_DetachFromComponent
struct FK2_DetachFromComponent
{
	uint8_t LocationRule;  // 0x0 (0x0)
	uint8_t RotationRule;  // 0x1 (0x1)
	uint8_t ScaleRule;  // 0x2 (0x2)
	char pad_3_1 : 7;  // 0x3 (0x3)
	bool bCallModify : 1;  // 0x3 (0x3)


}; 
 
 // ScriptStruct Engine.AnimDataModelNotifPayload
struct FAnimDataModelNotifPayload
{
	char pad_0[16];  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_UnPauseTimer
struct FK2_UnPauseTimer
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)


}; 
 
 // Function Engine.ExponentialHeightFogComponent.SetSecondFogData
struct FSetSecondFogData
{
	struct FExponentialHeightFogData NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.Character.GetCurrentMontage
struct FGetCurrentMontage
{
	struct UAnimMontage* ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.VertexOffsetUsage
struct FVertexOffsetUsage
{
	int32_t Usage;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.CharacterMovementUpdatedSignature__DelegateSignature
struct FCharacterMovementUpdatedSignature__DelegateSignature
{
	float DeltaSeconds;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector OldLocation;  // 0x8 (0x8)
	struct FVector OldVelocity;  // 0x20 (0x20)


}; 
 
 // SparseDelegateFunction Engine.ComponentCollisionSettingsChangedSignature__DelegateSignature
struct FComponentCollisionSettingsChangedSignature__DelegateSignature
{
	struct UPrimitiveComponent* ChangedComponent;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.InputAxisHandlerDynamicSignature__DelegateSignature
struct FInputAxisHandlerDynamicSignature__DelegateSignature
{
	float AxisValue;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.ConstraintBrokenSignature__DelegateSignature
struct FConstraintBrokenSignature__DelegateSignature
{
	int32_t ConstraintIndex;  // 0x0 (0x0)


}; 
 
 // Function Engine.RawAnimSequenceTrackExtensions.GetRotationalKeys
struct FGetRotationalKeys
{
	struct FRawAnimSequenceTrack Track;  // 0x0 (0x0)
	struct TArray<struct FQuat> ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.ActorComponent.SetComponentTickEnabled
struct FSetComponentTickEnabled
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bEnabled : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.GameModeBase.ChoosePlayerStart
struct FChoosePlayerStart
{
	struct AController* Player;  // 0x0 (0x0)
	struct AActor* ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.GameUserSettings.GetDefaultWindowMode
struct FGetDefaultWindowMode
{
	enum class EWindowMode ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.ConstraintInstanceBlueprintLibrary.SetAngularSoftTwistLimitParams
struct FSetAngularSoftTwistLimitParams
{
	struct FConstraintInstanceAccessor Accessor;  // 0x0 (0x0)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool bSoftTwistLimit : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)
	float TwistLimitStiffness;  // 0x10 (0x10)
	float TwistLimitDamping;  // 0x14 (0x14)
	float TwistLimitRestitution;  // 0x18 (0x18)
	float TwistLimitContactDistance;  // 0x1C (0x1C)


}; 
 
 // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector3
struct FSetCustomPrimitiveDataVector3
{
	int32_t DataIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector Value;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.ClusterNode_DEPRECATED
struct FClusterNode_DEPRECATED
{
	struct FVector3f BoundMin;  // 0x0 (0x0)
	int32_t FirstChild;  // 0xC (0xC)
	struct FVector3f BoundMax;  // 0x10 (0x10)
	int32_t LastChild;  // 0x1C (0x1C)
	int32_t FirstInstance;  // 0x20 (0x20)
	int32_t LastInstance;  // 0x24 (0x24)


}; 
 
 // DelegateFunction Engine.OnSubmixRecordedFileDone__DelegateSignature
struct FOnSubmixRecordedFileDone__DelegateSignature
{
	struct USoundWave* ResultingSoundWave;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimInstance.GetRelevantAnimLength
struct FGetRelevantAnimLength
{
	int32_t MachineIndex;  // 0x0 (0x0)
	int32_t StateIndex;  // 0x4 (0x4)
	float ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_SoftObjRefToSoftObjPath
struct FConv_SoftObjRefToSoftObjPath
{
	struct TSoftObjectPtr<UObject> SoftObjectReference;  // 0x0 (0x0)
	struct FSoftObjectPath ReturnValue;  // 0x30 (0x30)


}; 
 
 // DelegateFunction Engine.InputActionHandlerDynamicSignature__DelegateSignature
struct FInputActionHandlerDynamicSignature__DelegateSignature
{
	struct FKey Key;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.DepthFieldGlowInfo
struct FDepthFieldGlowInfo
{
	char bEnableGlow : 1;  // 0x0 (0x0)
	char pad_0_1 : 7;  // 0x0 (0x0)
	char pad_1[4];  // 0x1 (0x1)
	struct FLinearColor GlowColor;  // 0x4 (0x4)
	char pad_20[4];  // 0x14 (0x14)
	struct FVector2D GlowOuterRadius;  // 0x18 (0x18)
	struct FVector2D GlowInnerRadius;  // 0x28 (0x28)


}; 
 
 // Function Engine.KismetStringTableLibrary.GetTableNamespace
struct FGetTableNamespace
{
	struct FName TableId;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.PlayerInput.SetBind
struct FSetBind
{
	struct FName BindName;  // 0x0 (0x0)
	struct FString Command;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.GetPI
struct FGetPI
{
	double ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetInputVectorAxisValue
struct FGetInputVectorAxisValue
{
	struct FKey InputAxisKey;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetArrayLibrary.Array_RandomFromStream
struct FArray_RandomFromStream
{
	struct TArray<int32_t> TargetArray;  // 0x0 (0x0)
	struct FRandomStream RandomStream;  // 0x10 (0x10)
	int32_t OutItem;  // 0x18 (0x18)
	int32_t OutIndex;  // 0x1C (0x1C)


}; 
 
 // Function Engine.SceneComponent.GetSocketRotation
struct FGetSocketRotation
{
	struct FName InSocketName;  // 0x0 (0x0)
	struct FRotator ReturnValue;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.InputGestureHandlerDynamicSignature__DelegateSignature
struct FInputGestureHandlerDynamicSignature__DelegateSignature
{
	float Value;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerController.StreamingSourceShouldActivate
struct FStreamingSourceShouldActivate
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ISMComponentInstance
struct FISMComponentInstance
{
	int32_t ClientIndex;  // 0x0 (0x0)
	int32_t InstanceIndex;  // 0x4 (0x4)
	int32_t InstanceSubIndex;  // 0x8 (0x8)


}; 
 
 // Function Engine.AnimSingleNodeInstance.SetMirrorDataTable
struct FSetMirrorDataTable
{
	struct UMirrorDataTable* MirrorDataTable;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetVolumeButtonsHandledBySystem
struct FGetVolumeButtonsHandledBySystem
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.SceneComponent.SetRelativeScale3D
struct FSetRelativeScale3D
{
	struct FVector NewScale3D;  // 0x0 (0x0)


}; 
 
 // Function Engine.SkeletalMeshComponent.HasValidAnimationInstance
struct FHasValidAnimationInstance
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.SubtitleCue
struct FSubtitleCue
{
	struct FText Text;  // 0x0 (0x0)
	float Time;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // Function Engine.KismetMathLibrary.RandomIntegerFromStream
struct FRandomIntegerFromStream
{
	int32_t Max;  // 0x0 (0x0)
	struct FRandomStream Stream;  // 0x4 (0x4)
	int32_t ReturnValue;  // 0xC (0xC)


}; 
 
 // Function Engine.HUD.DrawText
struct FDrawText
{
	struct FString Text;  // 0x0 (0x0)
	struct FLinearColor TextColor;  // 0x10 (0x10)
	float ScreenX;  // 0x20 (0x20)
	float ScreenY;  // 0x24 (0x24)
	struct UFont* Font;  // 0x28 (0x28)
	float Scale;  // 0x30 (0x30)
	char pad_52_1 : 7;  // 0x34 (0x34)
	bool bScalePosition : 1;  // 0x34 (0x34)
	char pad_53[3];  // 0x35 (0x35)


}; 
 
 // Function Engine.GameplayStatics.SetWorldOriginLocation
struct FSetWorldOriginLocation
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FIntVector NewLocation;  // 0x8 (0x8)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // DelegateFunction Engine.InputTouchHandlerDynamicSignature__DelegateSignature
struct FInputTouchHandlerDynamicSignature__DelegateSignature
{
	enum class ETouchIndex FingerIndex;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FVector Location;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.BlendSpaceTriangleEdgeInfo
struct FBlendSpaceTriangleEdgeInfo
{
	struct FVector2D Normal;  // 0x0 (0x0)
	int32_t NeighbourTriangleIndex;  // 0x10 (0x10)
	int32_t AdjacentPerimeterTriangleIndices[2];  // 0x14 (0x14)
	int32_t AdjacentPerimeterVertexIndices[2];  // 0x1C (0x1C)
	char pad_36[4];  // 0x24 (0x24)


}; 
 
 // ScriptStruct Engine.RPCDoSStateConfig
// Size: 0x78(Inherited: 0x48)
struct FRPCDoSStateConfig : FRPCDoSState
{
	char pad_72[48];  // 0x48 (0x48)


}; 
 
 // Function Engine.GameplayStatics.GetAvailableSpatialPluginNames
struct FGetAvailableSpatialPluginNames
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct TArray<struct FName> ReturnValue;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.ActorInstanceHandle
struct FActorInstanceHandle
{
	struct TWeakObjectPtr<AActor> Actor;  // 0x0 (0x0)
	char pad_8[16];  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.Vector_NetQuantize
// Size: 0x18(Inherited: 0x18)
struct FVector_NetQuantize : FVector
{


}; 
 
 // Function Engine.PlayerCameraManager.GetCameraRotation
struct FGetCameraRotation
{
	struct FRotator ReturnValue;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.PlatformGameInstance.PlatformRegisteredForUserNotificationsDelegate__DelegateSignature
struct FPlatformRegisteredForUserNotificationsDelegate__DelegateSignature
{
	int32_t inInt;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ParticleCurvePair
struct FParticleCurvePair
{
	struct FString CurveName;  // 0x0 (0x0)
	struct UObject* CurveObject;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetMathLibrary.MultiplyMultiply_FloatFloat
struct FMultiplyMultiply_FloatFloat
{
	double Base;  // 0x0 (0x0)
	double Exp;  // 0x8 (0x8)
	double ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.SplineComponent.SetLocationAtSplinePoint
struct FSetLocationAtSplinePoint
{
	int32_t PointIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector InLocation;  // 0x8 (0x8)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x20 (0x20)
	char pad_33_1 : 7;  // 0x21 (0x21)
	bool bUpdateSpline : 1;  // 0x21 (0x21)
	char pad_34[6];  // 0x22 (0x22)


}; 
 
 // Function Engine.SkeletalMeshComponent.UnbindClothFromLeaderPoseComponent
struct FUnbindClothFromLeaderPoseComponent
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bRestoreSimulationSpace : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.EndTransaction
struct FEndTransaction
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.URL
struct FURL
{
	struct FString Protocol;  // 0x0 (0x0)
	struct FString Host;  // 0x10 (0x10)
	int32_t Port;  // 0x20 (0x20)
	int32_t Valid;  // 0x24 (0x24)
	struct FString Map;  // 0x28 (0x28)
	struct FString RedirectURL;  // 0x38 (0x38)
	struct TArray<struct FString> Op;  // 0x48 (0x48)
	struct FString Portal;  // 0x58 (0x58)


}; 
 
 // Function Engine.KismetInputLibrary.InputEvent_IsShiftDown
struct FInputEvent_IsShiftDown
{
	struct FInputEvent Input;  // 0x0 (0x0)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)


}; 
 
 // Function Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights
struct FSetSingleSampleShadowFromStationaryLights
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewSingleSampleShadowFromStationaryLights : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.CameraShakeUpdateParams
struct FCameraShakeUpdateParams
{
	float DeltaTime;  // 0x0 (0x0)
	float ShakeScale;  // 0x4 (0x4)
	float DynamicScale;  // 0x8 (0x8)
	float BlendingWeight;  // 0xC (0xC)
	struct FMinimalViewInfo POV;  // 0x10 (0x10)


}; 
 
 // Function Engine.Emitter.IsActive
struct FIsActive
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.SetOnlyOwnerSee
struct FSetOnlyOwnerSee
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewOnlyOwnerSee : 1;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnAudioFadeChangeSignature__DelegateSignature
struct FOnAudioFadeChangeSignature__DelegateSignature
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bFadeOut : 1;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	float FadeTime;  // 0x4 (0x4)


}; 
 
 // Function Engine.Actor.K2_DetachFromActor
struct FK2_DetachFromActor
{
	uint8_t LocationRule;  // 0x0 (0x0)
	uint8_t RotationRule;  // 0x1 (0x1)
	uint8_t ScaleRule;  // 0x2 (0x2)


}; 
 
 // ScriptStruct Engine.AnimNodeConstantData
struct FAnimNodeConstantData
{
	struct TScriptInterface<IAnimClassInterface> AnimClassInterface;  // 0x0 (0x0)
	int32_t NodeIndex;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // DelegateFunction Engine.OnPrimaryAssetClassListLoaded__DelegateSignature
struct FOnPrimaryAssetClassListLoaded__DelegateSignature
{
	struct TArray<UObject*> Loaded;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnAudioPlayStateChanged__DelegateSignature
struct FOnAudioPlayStateChanged__DelegateSignature
{
	uint8_t PlayState;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Clamp
struct FClamp
{
	int32_t Value;  // 0x0 (0x0)
	int32_t Min;  // 0x4 (0x4)
	int32_t Max;  // 0x8 (0x8)
	int32_t ReturnValue;  // 0xC (0xC)


}; 
 
 // DelegateFunction Engine.OnAudioSingleEnvelopeValue__DelegateSignature
struct FOnAudioSingleEnvelopeValue__DelegateSignature
{
	struct USoundWave* PlayingSoundWave;  // 0x0 (0x0)
	float EnvelopeValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.SceneComponent.K2_AttachTo
struct FK2_AttachTo
{
	struct USceneComponent* InParent;  // 0x0 (0x0)
	struct FName InSocketName;  // 0x8 (0x8)
	enum class EAttachLocation AttachType;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool bWeldSimulatedBodies : 1;  // 0x11 (0x11)
	char pad_18_1 : 7;  // 0x12 (0x12)
	bool ReturnValue : 1;  // 0x12 (0x12)
	char pad_19[5];  // 0x13 (0x13)


}; 
 
 // ScriptStruct Engine.AnimationTrackAddedPayload
// Size: 0xC(Inherited: 0x8)
struct FAnimationTrackAddedPayload : FAnimationTrackPayload
{
	int32_t TrackIndex;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.OnCanvasRenderTargetUpdate__DelegateSignature
struct FOnCanvasRenderTargetUpdate__DelegateSignature
{
	struct UCanvas* Canvas;  // 0x0 (0x0)
	int32_t Width;  // 0x8 (0x8)
	int32_t Height;  // 0xC (0xC)


}; 
 
 // Function Engine.AudioComponent.SetPaused
struct FSetPaused
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bPause : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.EditorMapPerformanceTestDefinition
struct FEditorMapPerformanceTestDefinition
{
	struct FSoftObjectPath PerformanceTestmap;  // 0x0 (0x0)
	int32_t TestTimer;  // 0x20 (0x20)
	char pad_36[4];  // 0x24 (0x24)


}; 
 
 // Function Engine.Actor.SetActorRelativeScale3D
struct FSetActorRelativeScale3D
{
	struct FVector NewRelativeScale;  // 0x0 (0x0)


}; 
 
 // Function Engine.PhysicsFieldStatics.EvalPhysicsVectorField
struct FEvalPhysicsVectorField
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector WorldPosition;  // 0x8 (0x8)
	enum class EFieldVectorType VectorType;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)
	struct FVector ReturnValue;  // 0x28 (0x28)


}; 
 
 // Function Engine.SphereComponent.GetUnscaledSphereRadius
struct FGetUnscaledSphereRadius
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.SplineMeshComponent.SetStartScale
struct FSetStartScale
{
	struct FVector2D StartScale;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool bUpdateMesh : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.PrimitiveComponent.SetCastInsetShadow
struct FSetCastInsetShadow
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bInCastInsetShadow : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.GameStateBase.GetPlayerRespawnDelay
struct FGetPlayerRespawnDelay
{
	struct AController* Controller;  // 0x0 (0x0)
	float ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.KismetSystemLibrary.SetGamepadsBlockDeviceFeedback
struct FSetGamepadsBlockDeviceFeedback
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bBlock : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ResponseChannel
struct FResponseChannel
{
	struct FName Channel;  // 0x0 (0x0)
	enum class ECollisionResponse Response;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.MeshComponent.SetVectorParameterValueOnMaterials
struct FSetVectorParameterValueOnMaterials
{
	struct FName ParameterName;  // 0x0 (0x0)
	struct FVector ParameterValue;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.AnimationGroupReference
struct FAnimationGroupReference
{
	uint8_t Method;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	struct FName GroupName;  // 0x4 (0x4)
	enum class EAnimGroupRole GroupRole;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)


}; 
 
 // DelegateFunction Engine.OnDataLayerRuntimeStateChanged__DelegateSignature
struct FOnDataLayerRuntimeStateChanged__DelegateSignature
{
	struct UDataLayerInstance* DataLayer;  // 0x0 (0x0)
	uint8_t State;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.ConstraintInstanceBlueprintLibrary.GetAngularDriveParams
struct FGetAngularDriveParams
{
	struct FConstraintInstanceAccessor Accessor;  // 0x0 (0x0)
	float OutPositionStrength;  // 0xC (0xC)
	float OutVelocityStrength;  // 0x10 (0x10)
	float OutForceLimit;  // 0x14 (0x14)


}; 
 
 // ScriptStruct Engine.FontCharacter
struct FFontCharacter
{
	int32_t StartU;  // 0x0 (0x0)
	int32_t StartV;  // 0x4 (0x4)
	int32_t USize;  // 0x8 (0x8)
	int32_t VSize;  // 0xC (0xC)
	char TextureIndex;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)
	int32_t VerticalOffset;  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetSystemLibrary.LoadAsset_Blocking
struct FLoadAsset_Blocking
{
	struct TSoftObjectPtr<UObject> Asset;  // 0x0 (0x0)
	struct UObject* ReturnValue;  // 0x30 (0x30)


}; 
 
 // DelegateFunction Engine.OnForceFeedbackFinished__DelegateSignature
struct FOnForceFeedbackFinished__DelegateSignature
{
	struct UForceFeedbackComponent* ForceFeedbackComponent;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.RandomRotatorFromStream
struct FRandomRotatorFromStream
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bRoll : 1;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	struct FRandomStream Stream;  // 0x4 (0x4)
	char pad_12[4];  // 0xC (0xC)
	struct FRotator ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.MovementComponent.ConstrainLocationToPlane
struct FConstrainLocationToPlane
{
	struct FVector Location;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.Actor.ReceiveActorOnInputTouchEnd
struct FReceiveActorOnInputTouchEnd
{
	enum class ETouchIndex FingerIndex;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnMontageStartedMCDelegate__DelegateSignature
struct FOnMontageStartedMCDelegate__DelegateSignature
{
	struct UAnimMontage* Montage;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnPawnControllerChanged__DelegateSignature
struct FOnPawnControllerChanged__DelegateSignature
{
	struct APawn* Pawn;  // 0x0 (0x0)
	struct AController* Controller;  // 0x8 (0x8)


}; 
 
 // Function Engine.PhysicsConstraintComponent.SetLinearBreakable
struct FSetLinearBreakable
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bLinearBreakable : 1;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	float LinearBreakThreshold;  // 0x4 (0x4)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_SoftClassReferenceToString
struct FConv_SoftClassReferenceToString
{
	struct TSoftClassPtr<UObject> SoftClassReference;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.SkeletalMeshComponent.SetTeleportRotationThreshold
struct FSetTeleportRotationThreshold
{
	float Threshold;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.FMod64
struct FFMod64
{
	double Dividend;  // 0x0 (0x0)
	double Divisor;  // 0x8 (0x8)
	double Remainder;  // 0x10 (0x10)
	int64_t ReturnValue;  // 0x18 (0x18)


}; 
 
 // ScriptStruct Engine.BaseAttenuationSettings
struct FBaseAttenuationSettings
{
	char pad_0[8];  // 0x0 (0x0)
	uint8_t DistanceAlgorithm;  // 0x8 (0x8)
	enum class EAttenuationShape AttenuationShape;  // 0x9 (0x9)
	uint8_t FalloffMode;  // 0xA (0xA)
	char pad_11[1];  // 0xB (0xB)
	float dBAttenuationAtMax;  // 0xC (0xC)
	struct FVector AttenuationShapeExtents;  // 0x10 (0x10)
	float ConeOffset;  // 0x28 (0x28)
	float FalloffDistance;  // 0x2C (0x2C)
	float ConeSphereRadius;  // 0x30 (0x30)
	float ConeSphereFalloffDistance;  // 0x34 (0x34)
	struct FRuntimeFloatCurve CustomAttenuationCurve;  // 0x38 (0x38)


}; 
 
 // Function Engine.AnimationDataController.SetCurveFlags
struct FSetCurveFlags
{
	struct FAnimationCurveIdentifier CurveId;  // 0x0 (0x0)
	int32_t Flags;  // 0x10 (0x10)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool bShouldTransact : 1;  // 0x14 (0x14)
	char pad_21_1 : 7;  // 0x15 (0x15)
	bool ReturnValue : 1;  // 0x15 (0x15)
	char pad_22[2];  // 0x16 (0x16)


}; 
 
 // Function Engine.KismetRenderingLibrary.BreakSkinWeightInfo
struct FBreakSkinWeightInfo
{
	struct FSkelMeshSkinWeightInfo InWeight;  // 0x0 (0x0)
	int32_t Bone0;  // 0x3C (0x3C)
	char Weight0;  // 0x40 (0x40)
	char pad_65[3];  // 0x41 (0x41)
	int32_t Bone1;  // 0x44 (0x44)
	char Weight1;  // 0x48 (0x48)
	char pad_73[3];  // 0x49 (0x49)
	int32_t Bone2;  // 0x4C (0x4C)
	char Weight2;  // 0x50 (0x50)
	char pad_81[3];  // 0x51 (0x51)
	int32_t Bone3;  // 0x54 (0x54)
	char Weight3;  // 0x58 (0x58)
	char pad_89[3];  // 0x59 (0x59)


}; 
 
 // Function Engine.KismetSystemLibrary.CapsuleTraceSingleByProfile
struct FCapsuleTraceSingleByProfile
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	float HalfHeight;  // 0x3C (0x3C)
	struct FName ProfileName;  // 0x40 (0x40)
	char pad_72_1 : 7;  // 0x48 (0x48)
	bool bTraceComplex : 1;  // 0x48 (0x48)
	char pad_73[7];  // 0x49 (0x49)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x50 (0x50)
	enum class EDrawDebugTrace DrawDebugType;  // 0x60 (0x60)
	char pad_97[7];  // 0x61 (0x61)
	struct FHitResult OutHit;  // 0x68 (0x68)
	char pad_336_1 : 7;  // 0x150 (0x150)
	bool bIgnoreSelf : 1;  // 0x150 (0x150)
	char pad_337[3];  // 0x151 (0x151)
	struct FLinearColor TraceColor;  // 0x154 (0x154)
	struct FLinearColor TraceHitColor;  // 0x164 (0x164)
	float DrawTime;  // 0x174 (0x174)
	char pad_376_1 : 7;  // 0x178 (0x178)
	bool ReturnValue : 1;  // 0x178 (0x178)
	char pad_377[7];  // 0x179 (0x179)


}; 
 
 // DelegateFunction Engine.OnPlayerStatePawnSet__DelegateSignature
struct FOnPlayerStatePawnSet__DelegateSignature
{
	struct APlayerState* Player;  // 0x0 (0x0)
	struct APawn* NewPawn;  // 0x8 (0x8)
	struct APawn* OldPawn;  // 0x10 (0x10)


}; 
 
 // Function Engine.BlueprintPathsLibrary.RootDir
struct FRootDir
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.PlatformGameInstance.PlatformScreenOrientationChangedDelegate__DelegateSignature
struct FPlatformScreenOrientationChangedDelegate__DelegateSignature
{
	enum class EScreenOrientation inScreenOrientation;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.BoneReference
struct FBoneReference
{
	struct FName BoneName;  // 0x0 (0x0)
	char pad_8[8];  // 0x8 (0x8)


}; 
 
 // Function Engine.AnimDataModel.GetBoneTrackNames
struct FGetBoneTrackNames
{
	struct TArray<struct FName> OutNames;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.DoesImplementInterface
struct FDoesImplementInterface
{
	struct UObject* TestObject;  // 0x0 (0x0)
	UInterface* Interface;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.GameplayStatics.FinishSpawningActor
struct FFinishSpawningActor
{
	struct AActor* Actor;  // 0x0 (0x0)
	char pad_8[8];  // 0x8 (0x8)
	struct FTransform SpawnTransform;  // 0x10 (0x10)
	struct AActor* ReturnValue;  // 0x70 (0x70)
	char pad_120[8];  // 0x78 (0x78)


}; 
 
 // DelegateFunction Engine.OnPrimaryAssetClassLoaded__DelegateSignature
struct FOnPrimaryAssetClassLoaded__DelegateSignature
{
	UObject* Loaded;  // 0x0 (0x0)


}; 
 
 // Function Engine.SplineComponent.GetLocationAndTangentAtSplinePoint
struct FGetLocationAndTangentAtSplinePoint
{
	int32_t PointIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector Location;  // 0x8 (0x8)
	struct FVector Tangent;  // 0x20 (0x20)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)


}; 
 
 // DelegateFunction Engine.OnPrimaryAssetLoaded__DelegateSignature
struct FOnPrimaryAssetLoaded__DelegateSignature
{
	struct UObject* Loaded;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Conv_TransformToMatrix
struct FConv_TransformToMatrix
{
	struct FTransform Transform;  // 0x0 (0x0)
	struct FMatrix ReturnValue;  // 0x60 (0x60)


}; 
 
 // DelegateFunction Engine.OnQuartzMetronomeEvent__DelegateSignature
struct FOnQuartzMetronomeEvent__DelegateSignature
{
	struct FName ClockName;  // 0x0 (0x0)
	uint8_t QuantizationType;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)
	int32_t NumBars;  // 0xC (0xC)
	int32_t Beat;  // 0x10 (0x10)
	float BeatFraction;  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetMathLibrary.Vector4_IsNAN
struct FVector4_IsNAN
{
	struct FVector4 A;  // 0x0 (0x0)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[15];  // 0x21 (0x21)


}; 
 
 // ScriptStruct Engine.NavAvoidanceMask
struct FNavAvoidanceMask
{
	char bGroup0 : 1;  // 0x0 (0x0)
	char bGroup1 : 1;  // 0x0 (0x0)
	char bGroup2 : 1;  // 0x0 (0x0)
	char bGroup3 : 1;  // 0x0 (0x0)
	char bGroup4 : 1;  // 0x0 (0x0)
	char bGroup5 : 1;  // 0x0 (0x0)
	char bGroup6 : 1;  // 0x0 (0x0)
	char bGroup7 : 1;  // 0x0 (0x0)
	char bGroup8 : 1;  // 0x1 (0x1)
	char bGroup9 : 1;  // 0x1 (0x1)
	char bGroup10 : 1;  // 0x1 (0x1)
	char bGroup11 : 1;  // 0x1 (0x1)
	char bGroup12 : 1;  // 0x1 (0x1)
	char bGroup13 : 1;  // 0x1 (0x1)
	char bGroup14 : 1;  // 0x1 (0x1)
	char bGroup15 : 1;  // 0x1 (0x1)
	char bGroup16 : 1;  // 0x2 (0x2)
	char bGroup17 : 1;  // 0x2 (0x2)
	char bGroup18 : 1;  // 0x2 (0x2)
	char bGroup19 : 1;  // 0x2 (0x2)
	char bGroup20 : 1;  // 0x2 (0x2)
	char bGroup21 : 1;  // 0x2 (0x2)
	char bGroup22 : 1;  // 0x2 (0x2)
	char bGroup23 : 1;  // 0x2 (0x2)
	char bGroup24 : 1;  // 0x3 (0x3)
	char bGroup25 : 1;  // 0x3 (0x3)
	char bGroup26 : 1;  // 0x3 (0x3)
	char bGroup27 : 1;  // 0x3 (0x3)
	char bGroup28 : 1;  // 0x3 (0x3)
	char bGroup29 : 1;  // 0x3 (0x3)
	char bGroup30 : 1;  // 0x3 (0x3)
	char bGroup31 : 1;  // 0x3 (0x3)


}; 
 
 // Function Engine.SceneComponent.K2_SetRelativeLocation
struct FK2_SetRelativeLocation
{
	struct FVector NewLocation;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bSweep : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FHitResult SweepHitResult;  // 0x20 (0x20)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool bTeleport : 1;  // 0x108 (0x108)
	char pad_265[7];  // 0x109 (0x109)


}; 
 
 // Function Engine.AnimInstance.GetOwningComponent
struct FGetOwningComponent
{
	struct USkeletalMeshComponent* ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerController.IsInputKeyDown
struct FIsInputKeyDown
{
	struct FKey Key;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool ReturnValue : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // Function Engine.KismetSystemLibrary.MakeARFilter
struct FMakeARFilter
{
	struct TArray<struct FName> PackageNames;  // 0x0 (0x0)
	struct TArray<struct FName> PackagePaths;  // 0x10 (0x10)
	struct TArray<struct FSoftObjectPath> SoftObjectPaths;  // 0x20 (0x20)
	struct TArray<struct FTopLevelAssetPath> ClassPaths;  // 0x30 (0x30)
	struct TSet<struct FTopLevelAssetPath> RecursiveClassPathsExclusionSet;  // 0x40 (0x40)
	struct TArray<struct FName> ClassNames;  // 0x90 (0x90)
	struct TSet<struct FName> RecursiveClassesExclusionSet;  // 0xA0 (0xA0)
	char pad_240_1 : 7;  // 0xF0 (0xF0)
	bool bRecursivePaths : 1;  // 0xF0 (0xF0)
	char pad_241_1 : 7;  // 0xF1 (0xF1)
	bool bRecursiveClasses : 1;  // 0xF1 (0xF1)
	char pad_242_1 : 7;  // 0xF2 (0xF2)
	bool bIncludeOnlyOnDiskAssets : 1;  // 0xF2 (0xF2)
	char pad_243[5];  // 0xF3 (0xF3)
	struct FARFilter ReturnValue;  // 0xF8 (0xF8)


}; 
 
 // ScriptStruct Engine.VectorParameterValue
struct FVectorParameterValue
{
	struct FMaterialParameterInfo ParameterInfo;  // 0x0 (0x0)
	struct FLinearColor ParameterValue;  // 0x10 (0x10)
	struct FGuid ExpressionGUID;  // 0x20 (0x20)


}; 
 
 // SparseDelegateFunction Engine.TakeAnyDamageSignature__DelegateSignature
struct FTakeAnyDamageSignature__DelegateSignature
{
	struct AActor* DamagedActor;  // 0x0 (0x0)
	float Damage;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct UDamageType* DamageType;  // 0x10 (0x10)
	struct AController* InstigatedBy;  // 0x18 (0x18)
	struct AActor* DamageCauser;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetInputLibrary.Key_GetNavigationDirectionFromAnalog
struct FKey_GetNavigationDirectionFromAnalog
{
	struct FAnalogInputEvent InAnalogEvent;  // 0x0 (0x0)
	uint8_t ReturnValue;  // 0x48 (0x48)
	char pad_73[7];  // 0x49 (0x49)


}; 
 
 // Function Engine.BlueprintPathsLibrary.CreateTempFilename
struct FCreateTempFilename
{
	struct FString Path;  // 0x0 (0x0)
	struct FString Prefix;  // 0x10 (0x10)
	struct FString Extension;  // 0x20 (0x20)
	struct FString ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.LightComponent.SetShadowBias
struct FSetShadowBias
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.LayerActorStats
struct FLayerActorStats
{
	 Type;  // 0x0 (0x0)
	int32_t Total;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // DelegateFunction Engine.OnQuartzMetronomeEventBP__DelegateSignature
struct FOnQuartzMetronomeEventBP__DelegateSignature
{
	struct FName ClockName;  // 0x0 (0x0)
	uint8_t QuantizationType;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)
	int32_t NumBars;  // 0xC (0xC)
	int32_t Beat;  // 0x10 (0x10)
	float BeatFraction;  // 0x14 (0x14)


}; 
 
 // Function Engine.SceneComponent.SetHiddenInGame
struct FSetHiddenInGame
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool NewHidden : 1;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bPropagateToChildren : 1;  // 0x1 (0x1)


}; 
 
 // Function Engine.GameStateBase.HasBegunPlay
struct FHasBegunPlay
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.MakeLiteralInt
struct FMakeLiteralInt
{
	int32_t Value;  // 0x0 (0x0)
	int32_t ReturnValue;  // 0x4 (0x4)


}; 
 
 // Function Engine.Actor.GetGameTimeSinceCreation
struct FGetGameTimeSinceCreation
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetInputLibrary.GetModifierKeysState
struct FGetModifierKeysState
{
	struct FSlateModifierKeysState ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.BlueprintMacroCosmeticInfo
struct FBlueprintMacroCosmeticInfo
{
	char pad_0[1];  // 0x0 (0x0)


}; 
 
 // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularPositionDrive
struct FSetAllMotorsAngularPositionDrive
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bEnableSwingDrive : 1;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bEnableTwistDrive : 1;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool bSkipCustomPhysicsType : 1;  // 0x2 (0x2)


}; 
 
 // Function Engine.KismetMathLibrary.Divide_Int64Int64
struct FDivide_Int64Int64
{
	int64_t A;  // 0x0 (0x0)
	int64_t B;  // 0x8 (0x8)
	int64_t ReturnValue;  // 0x10 (0x10)


}; 
 
 // DelegateFunction Engine.OnSubmixSpectralAnalysis__DelegateSignature
struct FOnSubmixSpectralAnalysis__DelegateSignature
{
	struct TArray<float> Magnitudes;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.LevelStreamingStatus
struct FLevelStreamingStatus
{
	struct FName PackageName;  // 0x0 (0x0)
	char bShouldBeLoaded : 1;  // 0x8 (0x8)
	char bShouldBeVisible : 1;  // 0x8 (0x8)
	char pad_8_1 : 6;  // 0x8 (0x8)
	char pad_9[4];  // 0x9 (0x9)
	uint32_t LODIndex;  // 0xC (0xC)


}; 
 
 // Function Engine.PlayerController.ServerUnmutePlayer
struct FServerUnmutePlayer
{
	struct FUniqueNetIdRepl PlayerId;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.HLODISMComponentDesc
struct FHLODISMComponentDesc
{
	struct UStaticMesh* StaticMesh;  // 0x0 (0x0)
	struct UMaterialInterface* Material;  // 0x8 (0x8)
	struct TArray<struct FTransform> Instances;  // 0x10 (0x10)
	struct TArray<struct FCustomPrimitiveData> InstancesCustomPrimitiveData;  // 0x20 (0x20)


}; 
 
 // DelegateFunction Engine.OnSubmixSpectralAnalysisBP__DelegateSignature
struct FOnSubmixSpectralAnalysisBP__DelegateSignature
{
	struct TArray<float> Magnitude;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnSystemFinished__DelegateSignature
struct FOnSystemFinished__DelegateSignature
{
	struct UParticleSystemComponent* PSystem;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.MontageBlendSettings
struct FMontageBlendSettings
{
	struct UBlendProfile* BlendProfile;  // 0x0 (0x0)
	struct FAlphaBlendArgs Blend;  // 0x8 (0x8)
	uint8_t BlendMode;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromSoftObjectReference
struct FGetPrimaryAssetIdFromSoftObjectReference
{
	struct TSoftObjectPtr<UObject> SoftObjectReference;  // 0x0 (0x0)
	struct FPrimaryAssetId ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetMathLibrary.DegAsin
struct FDegAsin
{
	double A;  // 0x0 (0x0)
	double ReturnValue;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.CameraCacheEntry
struct FCameraCacheEntry
{
	float Timestamp;  // 0x0 (0x0)
	char pad_4[12];  // 0x4 (0x4)
	struct FMinimalViewInfo POV;  // 0x10 (0x10)


}; 
 
 // DelegateFunction Engine.OnTimelineFloat__DelegateSignature
struct FOnTimelineFloat__DelegateSignature
{
	float Output;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.K2_BoxOverlapComponent
struct FK2_BoxOverlapComponent
{
	struct FVector InBoxCentre;  // 0x0 (0x0)
	struct FBox InBox;  // 0x18 (0x18)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool bTraceComplex : 1;  // 0x50 (0x50)
	char pad_81_1 : 7;  // 0x51 (0x51)
	bool bShowTrace : 1;  // 0x51 (0x51)
	char pad_82_1 : 7;  // 0x52 (0x52)
	bool bPersistentShowTrace : 1;  // 0x52 (0x52)
	char pad_83[5];  // 0x53 (0x53)
	struct FVector HitLocation;  // 0x58 (0x58)
	struct FVector HitNormal;  // 0x70 (0x70)
	struct FName BoneName;  // 0x88 (0x88)
	struct FHitResult OutHit;  // 0x90 (0x90)
	char pad_376_1 : 7;  // 0x178 (0x178)
	bool ReturnValue : 1;  // 0x178 (0x178)
	char pad_377[7];  // 0x179 (0x179)


}; 
 
 // Function Engine.TimelineComponent.SetLinearColorCurve
struct FSetLinearColorCurve
{
	struct UCurveLinearColor* NewLinearColorCurve;  // 0x0 (0x0)
	struct FName LinearColorTrackName;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.SlotEvaluationPose
struct FSlotEvaluationPose
{
	enum class EAdditiveAnimationType AdditiveType;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	float Weight;  // 0x4 (0x4)
	char pad_8[136];  // 0x8 (0x8)


}; 
 
 // Function Engine.SkeletalMeshComponent.SetAllowAnimCurveEvaluation
struct FSetAllowAnimCurveEvaluation
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bInAllow : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.CurveLinearColor.GetLinearColorValue
struct FGetLinearColorValue
{
	float InTime;  // 0x0 (0x0)
	struct FLinearColor ReturnValue;  // 0x4 (0x4)


}; 
 
 // Function Engine.Actor.GetSquaredDistanceTo
struct FGetSquaredDistanceTo
{
	struct AActor* OtherActor;  // 0x0 (0x0)
	float ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // DelegateFunction Engine.OnTimelineLinearColor__DelegateSignature
struct FOnTimelineLinearColor__DelegateSignature
{
	struct FLinearColor Output;  // 0x0 (0x0)


}; 
 
 // Function Engine.SkeletalMeshComponent.SetAnimClass
struct FSetAnimClass
{
	UObject* NewClass;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.OnTimelineVector__DelegateSignature
struct FOnTimelineVector__DelegateSignature
{
	struct FVector Output;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimInstance.HasMarkerBeenHitThisFrame
struct FHasMarkerBeenHitThisFrame
{
	struct FName SyncGroup;  // 0x0 (0x0)
	struct FName MarkerName;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)


}; 
 
 // ScriptStruct Engine.MaterialInstanceCachedData
struct FMaterialInstanceCachedData
{
	struct TArray<int32_t> ParentLayerIndexRemap;  // 0x0 (0x0)


}; 
 
 // Function Engine.PhysicsConstraintComponent.SetConstraintReferenceOrientation
struct FSetConstraintReferenceOrientation
{
	enum class EConstraintFrame Frame;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FVector PriAxis;  // 0x8 (0x8)
	struct FVector SecAxis;  // 0x20 (0x20)


}; 
 
 // SparseDelegateFunction Engine.ActorBeginOverlapSignature__DelegateSignature
struct FActorBeginOverlapSignature__DelegateSignature
{
	struct AActor* OverlappedActor;  // 0x0 (0x0)
	struct AActor* OtherActor;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.CInterpTo
struct FCInterpTo
{
	struct FLinearColor Current;  // 0x0 (0x0)
	struct FLinearColor Target;  // 0x10 (0x10)
	float DeltaTime;  // 0x20 (0x20)
	float InterpSpeed;  // 0x24 (0x24)
	struct FLinearColor ReturnValue;  // 0x28 (0x28)


}; 
 
 // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic
struct FCreateAndSetMaterialInstanceDynamic
{
	int32_t ElementIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UMaterialInstanceDynamic* ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.SetActorHiddenInGame
struct FSetActorHiddenInGame
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewHidden : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Divide_VectorVector
struct FDivide_VectorVector
{
	struct FVector A;  // 0x0 (0x0)
	struct FVector B;  // 0x18 (0x18)
	struct FVector ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.PoseableMeshComponent.CopyPoseFromSkeletalComponent
struct FCopyPoseFromSkeletalComponent
{
	struct USkeletalMeshComponent* InComponentToCopy;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.BoxOverlapComponents
struct FBoxOverlapComponents
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector BoxPos;  // 0x8 (0x8)
	struct FVector Extent;  // 0x20 (0x20)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x38 (0x38)
	UObject* ComponentClassFilter;  // 0x48 (0x48)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x50 (0x50)
	struct TArray<struct UPrimitiveComponent*> OutComponents;  // 0x60 (0x60)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool ReturnValue : 1;  // 0x70 (0x70)
	char pad_113[7];  // 0x71 (0x71)


}; 
 
 // Function Engine.KismetStringLibrary.BuildString_Rotator
struct FBuildString_Rotator
{
	struct FString AppendTo;  // 0x0 (0x0)
	struct FString Prefix;  // 0x10 (0x10)
	struct FRotator InRot;  // 0x20 (0x20)
	struct FString Suffix;  // 0x38 (0x38)
	struct FString ReturnValue;  // 0x48 (0x48)


}; 
 
 // Function Engine.SplineComponent.FindRollClosestToWorldLocation
struct FFindRollClosestToWorldLocation
{
	struct FVector WorldLocation;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x18 (0x18)
	char pad_25[3];  // 0x19 (0x19)
	float ReturnValue;  // 0x1C (0x1C)


}; 
 
 // DelegateFunction Engine.OnUserInputDeviceConnectionChange__DelegateSignature
struct FOnUserInputDeviceConnectionChange__DelegateSignature
{
	uint8_t NewConnectionState;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	struct FPlatformUserId PlatformUserId;  // 0x4 (0x4)
	struct FInputDeviceId InputDeviceId;  // 0x8 (0x8)


}; 
 
 // Function Engine.PlayerController.SetVirtualJoystickVisibility
struct FSetVirtualJoystickVisibility
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bVisible : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.SceneComponent.GetAttachParent
struct FGetAttachParent
{
	struct USceneComponent* ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.BracketPayload
// Size: 0x10(Inherited: 0x1)
struct FBracketPayload : FEmptyPayload
{
	struct FString Description;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerState.GetCompressedPing
struct FGetCompressedPing
{
	char ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.LevelStreamingDynamic.LoadLevelInstanceBySoftObjectPtr
struct FLoadLevelInstanceBySoftObjectPtr
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct TSoftObjectPtr<UWorld> Level;  // 0x8 (0x8)
	struct FVector Location;  // 0x38 (0x38)
	struct FRotator Rotation;  // 0x50 (0x50)
	char pad_104_1 : 7;  // 0x68 (0x68)
	bool bOutSuccess : 1;  // 0x68 (0x68)
	char pad_105[7];  // 0x69 (0x69)
	struct FString OptionalLevelNameOverride;  // 0x70 (0x70)
	ULevelStreamingDynamic* OptionalLevelStreamingClass;  // 0x80 (0x80)
	char pad_136_1 : 7;  // 0x88 (0x88)
	bool bLoadAsTempPackage : 1;  // 0x88 (0x88)
	char pad_137[7];  // 0x89 (0x89)
	struct ULevelStreamingDynamic* ReturnValue;  // 0x90 (0x90)


}; 
 
 // Function Engine.KismetMathLibrary.InverseTransformDirection
struct FInverseTransformDirection
{
	struct FTransform T;  // 0x0 (0x0)
	struct FVector Direction;  // 0x60 (0x60)
	struct FVector ReturnValue;  // 0x78 (0x78)


}; 
 
 // ScriptStruct Engine.UniqueNetIdReplNetSerializerNameStruct
struct FUniqueNetIdReplNetSerializerNameStruct
{
	struct FName Name;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_PauseTimer
struct FK2_PauseTimer
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.Normalize2D
struct FNormalize2D
{
	struct FVector2D A;  // 0x0 (0x0)
	float Tolerance;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // DelegateFunction Engine.OnUserInputDevicePairingChange__DelegateSignature
struct FOnUserInputDevicePairingChange__DelegateSignature
{
	struct FInputDeviceId InputDeviceId;  // 0x0 (0x0)
	struct FPlatformUserId NewUserPlatformId;  // 0x4 (0x4)
	struct FPlatformUserId OldUserPlatformId;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.IsActorBeingDestroyed
struct FIsActorBeingDestroyed
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.NavMovementComponent.IsSwimming
struct FIsSwimming
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.ParticleBurstSignature__DelegateSignature
struct FParticleBurstSignature__DelegateSignature
{
	struct FName EventName;  // 0x0 (0x0)
	float EmitterTime;  // 0x8 (0x8)
	int32_t ParticleCount;  // 0xC (0xC)


}; 
 
 // Function Engine.AudioComponent.SetSourceBusSendPreEffect
struct FSetSourceBusSendPreEffect
{
	struct USoundSourceBus* SoundSourceBus;  // 0x0 (0x0)
	float SourceBusSendLevel;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.SplineComponent.GetTangentAtDistanceAlongSpline
struct FGetTangentAtDistanceAlongSpline
{
	float Distance;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.PrimitiveComponentInstanceData
// Size: 0x130(Inherited: 0xB8)
struct FPrimitiveComponentInstanceData : FSceneComponentInstanceData
{
	char pad_184[8];  // 0xB8 (0xB8)
	struct FTransform ComponentTransform;  // 0xC0 (0xC0)
	int32_t VisibilityId;  // 0x120 (0x120)
	char pad_292[4];  // 0x124 (0x124)
	struct UPrimitiveComponent* LODParent;  // 0x128 (0x128)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_PrimaryAssetTypeToString
struct FConv_PrimaryAssetTypeToString
{
	struct FPrimaryAssetType PrimaryAssetType;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.ParticleCollisionSignature__DelegateSignature
struct FParticleCollisionSignature__DelegateSignature
{
	struct FName EventName;  // 0x0 (0x0)
	float EmitterTime;  // 0x8 (0x8)
	int32_t ParticleTime;  // 0xC (0xC)
	struct FVector Location;  // 0x10 (0x10)
	struct FVector Velocity;  // 0x28 (0x28)
	struct FVector Direction;  // 0x40 (0x40)
	struct FVector Normal;  // 0x58 (0x58)
	struct FName BoneName;  // 0x70 (0x70)
	struct UPhysicalMaterial* PhysMat;  // 0x78 (0x78)


}; 
 
 // Function Engine.CameraLensEffectInterfaceClassSupportLibrary.IsInterfaceClassValid
struct FIsInterfaceClassValid
{
	struct FCameraLensInterfaceClassSupport CameraLens;  // 0x0 (0x0)
	uint8_t Result;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugFrustum
struct FDrawDebugFrustum
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	char pad_8[8];  // 0x8 (0x8)
	struct FTransform FrustumTransform;  // 0x10 (0x10)
	struct FLinearColor FrustumColor;  // 0x70 (0x70)
	float Duration;  // 0x80 (0x80)
	float Thickness;  // 0x84 (0x84)
	char pad_136[8];  // 0x88 (0x88)


}; 
 
 // Function Engine.KismetTextLibrary.Conv_ByteToText
struct FConv_ByteToText
{
	char Value;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FText ReturnValue;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.ParticleDeathSignature__DelegateSignature
struct FParticleDeathSignature__DelegateSignature
{
	struct FName EventName;  // 0x0 (0x0)
	float EmitterTime;  // 0x8 (0x8)
	int32_t ParticleTime;  // 0xC (0xC)
	struct FVector Location;  // 0x10 (0x10)
	struct FVector Velocity;  // 0x28 (0x28)
	struct FVector Direction;  // 0x40 (0x40)


}; 
 
 // DelegateFunction Engine.ParticleSpawnSignature__DelegateSignature
struct FParticleSpawnSignature__DelegateSignature
{
	struct FName EventName;  // 0x0 (0x0)
	float EmitterTime;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct FVector Location;  // 0x10 (0x10)
	struct FVector Velocity;  // 0x28 (0x28)


}; 
 
 // Function Engine.StereoLayerComponent.GetUVRect
struct FGetUVRect
{
	struct FBox2D ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.LineTraceSingleByProfile
struct FLineTraceSingleByProfile
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	struct FName ProfileName;  // 0x38 (0x38)
	char pad_64_1 : 7;  // 0x40 (0x40)
	bool bTraceComplex : 1;  // 0x40 (0x40)
	char pad_65[7];  // 0x41 (0x41)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x48 (0x48)
	enum class EDrawDebugTrace DrawDebugType;  // 0x58 (0x58)
	char pad_89[7];  // 0x59 (0x59)
	struct FHitResult OutHit;  // 0x60 (0x60)
	char pad_328_1 : 7;  // 0x148 (0x148)
	bool bIgnoreSelf : 1;  // 0x148 (0x148)
	char pad_329[3];  // 0x149 (0x149)
	struct FLinearColor TraceColor;  // 0x14C (0x14C)
	struct FLinearColor TraceHitColor;  // 0x15C (0x15C)
	float DrawTime;  // 0x16C (0x16C)
	char pad_368_1 : 7;  // 0x170 (0x170)
	bool ReturnValue : 1;  // 0x170 (0x170)
	char pad_369[7];  // 0x171 (0x171)


}; 
 
 // ScriptStruct Engine.AnimatedBoneAttribute
struct FAnimatedBoneAttribute
{
	struct FAnimationAttributeIdentifier Identifier;  // 0x0 (0x0)
	struct FAttributeCurve Curve;  // 0x40 (0x40)


}; 
 
 // Function Engine.KismetMathLibrary.Matrix_RemoveScaling
struct FMatrix_RemoveScaling
{
	struct FMatrix M;  // 0x0 (0x0)
	float Tolerance;  // 0x80 (0x80)
	char pad_132[12];  // 0x84 (0x84)


}; 
 
 // DelegateFunction Engine.PlasticDeformationEventSignature__DelegateSignature
struct FPlasticDeformationEventSignature__DelegateSignature
{
	int32_t ConstraintIndex;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.GetTotalHours
struct FGetTotalHours
{
	struct FTimespan A;  // 0x0 (0x0)
	float ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // ScriptStruct Engine.CachedFloatCurve
struct FCachedFloatCurve
{
	struct FName CurveName;  // 0x0 (0x0)
	char pad_8[12];  // 0x8 (0x8)


}; 
 
 // Function Engine.PrimitiveComponent.GetCollisionResponseToChannel
struct FGetCollisionResponseToChannel
{
	enum class ECollisionChannel Channel;  // 0x0 (0x0)
	enum class ECollisionResponse ReturnValue;  // 0x1 (0x1)


}; 
 
 // ScriptStruct Engine.KTaperedCapsuleElem
// Size: 0x70(Inherited: 0x30)
struct FKTaperedCapsuleElem : FKShapeElem
{
	struct FVector Center;  // 0x30 (0x30)
	struct FRotator Rotation;  // 0x48 (0x48)
	float Radius0;  // 0x60 (0x60)
	float Radius1;  // 0x64 (0x64)
	float Length;  // 0x68 (0x68)
	char pad_108[4];  // 0x6C (0x6C)


}; 
 
 // ScriptStruct Engine.SoundWaveSpectralDataEntry
struct FSoundWaveSpectralDataEntry
{
	float Magnitude;  // 0x0 (0x0)
	float NormalizedMagnitude;  // 0x4 (0x4)


}; 
 
 // ScriptStruct Engine.MaterialTextureInfo
struct FMaterialTextureInfo
{
	float SamplingScale;  // 0x0 (0x0)
	int32_t UVChannelIndex;  // 0x4 (0x4)
	struct FName TextureName;  // 0x8 (0x8)


}; 
 
 // Function Engine.PlayerController.SetAudioListenerOverride
struct FSetAudioListenerOverride
{
	struct USceneComponent* AttachToComponent;  // 0x0 (0x0)
	struct FVector Location;  // 0x8 (0x8)
	struct FRotator Rotation;  // 0x20 (0x20)


}; 
 
 // DelegateFunction Engine.PlatformInterfaceDelegate__DelegateSignature
struct FPlatformInterfaceDelegate__DelegateSignature
{
	struct FPlatformInterfaceDelegateResult Result;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.MaxOfFloatArray
struct FMaxOfFloatArray
{
	struct TArray<float> FloatArray;  // 0x0 (0x0)
	int32_t IndexOfMaxValue;  // 0x10 (0x10)
	float MaxValue;  // 0x14 (0x14)


}; 
 
 // Function Engine.SplineComponent.ConvertSplineSegmentToPolyLine
struct FConvertSplineSegmentToPolyLine
{
	int32_t SplinePointStartIndex;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	float MaxSquareDistanceFromSpline;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct TArray<struct FVector> OutPoints;  // 0x10 (0x10)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)


}; 
 
 // SparseDelegateFunction Engine.ActorBeginTouchOverSignature__DelegateSignature
struct FActorBeginTouchOverSignature__DelegateSignature
{
	enum class ETouchIndex FingerIndex;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct AActor* TouchedActor;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.SetReplicates
struct FSetReplicates
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bInReplicates : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.Vector_NetQuantize10
// Size: 0x18(Inherited: 0x18)
struct FVector_NetQuantize10 : FVector
{


}; 
 
 // Function Engine.AudioComponent.SetAudioBusSendPreEffect
struct FSetAudioBusSendPreEffect
{
	struct UAudioBus* AudioBus;  // 0x0 (0x0)
	float AudioBusSendLevel;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // ScriptStruct Engine.PlatformInterfaceDelegateResult
struct FPlatformInterfaceDelegateResult
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bSuccessful : 1;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FPlatformInterfaceData Data;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.RemoveTickPrerequisiteComponent
struct FRemoveTickPrerequisiteComponent
{
	struct UActorComponent* PrerequisiteComponent;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.GetReflectionVector
struct FGetReflectionVector
{
	struct FVector Direction;  // 0x0 (0x0)
	struct FVector SurfaceNormal;  // 0x18 (0x18)
	struct FVector ReturnValue;  // 0x30 (0x30)


}; 
 
 // ScriptStruct Engine.PlatformInterfaceData
struct FPlatformInterfaceData
{
	struct FName DataName;  // 0x0 (0x0)
	enum class EPlatformInterfaceDataType Type;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)
	int32_t IntValue;  // 0xC (0xC)
	float FloatValue;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)
	struct FString StringValue;  // 0x18 (0x18)
	struct UObject* ObjectValue;  // 0x28 (0x28)


}; 
 
 // Function Engine.ActorComponent.ComponentHasTag
struct FComponentHasTag
{
	struct FName Tag;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // DelegateFunction Engine.PlayMontageAnimNotifyDelegate__DelegateSignature
struct FPlayMontageAnimNotifyDelegate__DelegateSignature
{
	struct FName NotifyName;  // 0x0 (0x0)
	struct FBranchingPointNotifyPayload BranchingPointPayload;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.RootMotionSource_MoveToDynamicForce
// Size: 0x140(Inherited: 0xE0)
struct FRootMotionSource_MoveToDynamicForce : FRootMotionSource
{
	struct FVector StartLocation;  // 0xD8 (0xD8)
	struct FVector InitialTargetLocation;  // 0xF0 (0xF0)
	struct FVector TargetLocation;  // 0x108 (0x108)
	char pad_296_1 : 7;  // 0x128 (0x128)
	bool bRestrictSpeedToExpected : 1;  // 0x120 (0x120)
	struct UCurveVector* PathOffsetCurve;  // 0x128 (0x128)
	struct UCurveFloat* TimeMappingCurve;  // 0x130 (0x130)
	char pad_313[7];  // 0x139 (0x139)


}; 
 
 // ScriptStruct Engine.BranchingPointNotifyPayload
struct FBranchingPointNotifyPayload
{
	char pad_0[32];  // 0x0 (0x0)


}; 
 
 // Function Engine.MaterialInstanceDynamic.K2_InterpolateMaterialInstanceParams
struct FK2_InterpolateMaterialInstanceParams
{
	struct UMaterialInstance* SourceA;  // 0x0 (0x0)
	struct UMaterialInstance* SourceB;  // 0x8 (0x8)
	float Alpha;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_ClearTimerDelegate
struct FK2_ClearTimerDelegate
{
	struct FDelegate Delegate;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.ViewportDisplayCallback__DelegateSignature
struct FViewportDisplayCallback__DelegateSignature
{
	struct FText OutText;  // 0x0 (0x0)
	struct FLinearColor OutColor;  // 0x18 (0x18)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool ReturnValue : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)


}; 
 
 // Function Engine.ActorComponent.Activate
struct FActivate
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bReset : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.UnloadPrimaryAsset
struct FUnloadPrimaryAsset
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_IsTimerActive
struct FK2_IsTimerActive
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool ReturnValue : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // Function Engine.PrimitiveComponent.SetAllMassScale
struct FSetAllMassScale
{
	float InMassScale;  // 0x0 (0x0)


}; 
 
 // Function Engine.SplineComponent.GetWorldDirectionAtDistanceAlongSpline
struct FGetWorldDirectionAtDistanceAlongSpline
{
	float Distance;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.AddTickPrerequisiteActor
struct FAddTickPrerequisiteActor
{
	struct AActor* PrerequisiteActor;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimationDataController.AddAttribute
struct FAddAttribute
{
	struct FAnimationAttributeIdentifier AttributeIdentifier;  // 0x0 (0x0)
	char pad_64_1 : 7;  // 0x40 (0x40)
	bool bShouldTransact : 1;  // 0x40 (0x40)
	char pad_65_1 : 7;  // 0x41 (0x41)
	bool ReturnValue : 1;  // 0x41 (0x41)
	char pad_66[6];  // 0x42 (0x42)


}; 
 
 // Function Engine.Actor.AddTickPrerequisiteComponent
struct FAddTickPrerequisiteComponent
{
	struct UActorComponent* PrerequisiteComponent;  // 0x0 (0x0)


}; 
 
 // Function Engine.SplineComponent.GetLocationAtDistanceAlongSpline
struct FGetLocationAtDistanceAlongSpline
{
	float Distance;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.ActorComponent.GetComponentTickInterval
struct FGetComponentTickInterval
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.SetMassOverrideInKg
struct FSetMassOverrideInKg
{
	struct FName BoneName;  // 0x0 (0x0)
	float MassInKg;  // 0x8 (0x8)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool bOverrideMass : 1;  // 000030777] /Game/DungeonCrawler/Data/Generated/DT_Monster/MonsterEffect/Id_MonsterEffect_ZombiePoisonCloud_Cooldown_Elite (000030777] Package Id_Spawner_Props_OrnateChestLarge_HR)
	char pad_13[3];  // 0xD (0xD)


}; 
 
 // Function Engine.GameUserSettings.IsVSyncDirty
struct FIsVSyncDirty
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetStringLibrary.BuildString_Double
struct FBuildString_Double
{
	struct FString AppendTo;  // 0x0 (0x0)
	struct FString Prefix;  // 0x10 (0x10)
	double InDouble;  // 0x20 (0x20)
	struct FString Suffix;  // 0x28 (0x28)
	struct FString ReturnValue;  // 0x38 (0x38)


}; 
 
 // ScriptStruct Engine.SoundSubmixSendInfo
struct FSoundSubmixSendInfo
{
	uint8_t SendLevelControlMethod;  // 0x0 (0x0)
	uint8_t SendStage;  // 0x1 (0x1)
	char pad_2[6];  // 0x2 (0x2)
	struct USoundSubmixBase* SoundSubmix;  // 0x8 (0x8)
	float SendLevel;  // 0x10 (0x10)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool DisableManualSendClamp : 1;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	float MinSendLevel;  // 0x18 (0x18)
	float MaxSendLevel;  // 0x1C (0x1C)
	float MinSendDistance;  // 0x20 (0x20)
	float MaxSendDistance;  // 0x24 (0x24)
	struct FRuntimeFloatCurve CustomSendLevelCurve;  // 0x28 (0x28)


}; 
 
 // Function Engine.Pawn.ReceiveControllerChanged
struct FReceiveControllerChanged
{
	struct AController* OldController;  // 0x0 (0x0)
	struct AController* NewController;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.FromSeconds
struct FFromSeconds
{
	float Seconds;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FTimespan ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.GetOwner
struct FGetOwner
{
	struct AActor* ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.MaterialExpressionCollection
struct FMaterialExpressionCollection
{
	struct TArray<struct UMaterialExpression*> Expressions;  // 0x0 (0x0)
	struct TArray<struct UMaterialExpressionComment*> EditorComments;  // 0x10 (0x10)
	struct UMaterialExpressionExecBegin* ExpressionExecBegin;  // 0x20 (0x20)
	struct UMaterialExpressionExecEnd* ExpressionExecEnd;  // 0x28 (0x28)


}; 
 
 // Function Engine.KismetArrayLibrary.Array_Contains
struct FArray_Contains
{
	struct TArray<int32_t> TargetArray;  // 0x0 (0x0)
	int32_t ItemToFind;  // 0x10 (0x10)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool ReturnValue : 1;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)


}; 
 
 // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector2
struct FSetDefaultCustomPrimitiveDataVector2
{
	int32_t DataIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector2D Value;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.BoxOverlapActors
struct FBoxOverlapActors
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector BoxPos;  // 0x8 (0x8)
	struct FVector BoxExtent;  // 0x20 (0x20)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x38 (0x38)
	UObject* ActorClassFilter;  // 0x48 (0x48)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x50 (0x50)
	struct TArray<struct AActor*> OutActors;  // 0x60 (0x60)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool ReturnValue : 1;  // 0x70 (0x70)
	char pad_113[7];  // 0x71 (0x71)


}; 
 
 // Function Engine.MovementComponent.SetPlaneConstraintNormal
struct FSetPlaneConstraintNormal
{
	struct FVector PlaneNormal;  // 0x0 (0x0)


}; 
 
 // Function Engine.GameplayStatics.ProjectWorldToScreen
struct FProjectWorldToScreen
{
	struct APlayerController* Player;  // 0x0 (0x0)
	struct FVector WorldPosition;  // 0x8 (0x8)
	struct FVector2D ScreenPosition;  // 0x20 (0x20)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool bPlayerViewportRelative : 1;  // 0x30 (0x30)
	char pad_49_1 : 7;  // 0x31 (0x31)
	bool ReturnValue : 1;  // 0x31 (0x31)
	char pad_50[6];  // 0x32 (0x32)


}; 
 
 // Function Engine.ForceFeedbackComponent.Play
struct FPlay
{
	float StartTime;  // 0x0 (0x0)


}; 
 
 // Function Engine.ActorComponent.IsBeingDestroyed
struct FIsBeingDestroyed
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimInstance.Montage_GetIsStopped
struct FMontage_GetIsStopped
{
	struct UAnimMontage* Montage;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.RectLightComponent.SetBarnDoorLength
struct FSetBarnDoorLength
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_IsTimerPausedHandle
struct FK2_IsTimerPausedHandle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FTimerHandle Handle;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.PrimitiveComponent.SetPhysMaterialOverride
struct FSetPhysMaterialOverride
{
	struct UPhysicalMaterial* NewPhysMaterial;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.GetCollisionObjectType
struct FGetCollisionObjectType
{
	enum class ECollisionChannel ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4
struct FSetCustomPrimitiveDataVector4
{
	int32_t DataIndex;  // 0x0 (0x0)
	char pad_4[12];  // 0x4 (0x4)
	struct FVector4 Value;  // 0x10 (0x10)


}; 
 
 // Function Engine.SceneComponent.SetAbsolute
struct FSetAbsolute
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewAbsoluteLocation : 1;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bNewAbsoluteRotation : 1;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool bNewAbsoluteScale : 1;  // 0x2 (0x2)


}; 
 
 // ScriptStruct Engine.DPMatchingRulestructD
// Size: 0x68(Inherited: 0x48)
struct FDPMatchingRulestructD : FDPMatchingRulestructBase
{
	struct TArray<struct FDPMatchingRulestructC> OnTrue;  // 0x48 (0x48)
	struct TArray<struct FDPMatchingRulestructC> OnFalse;  // 0x58 (0x58)


}; 
 
 // Function Engine.DirectionalLightComponent.SetCascadeDistributionExponent
struct FSetCascadeDistributionExponent
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.RandomBoolWithWeightFromStream
struct FRandomBoolWithWeightFromStream
{
	float Weight;  // 0x0 (0x0)
	struct FRandomStream RandomStream;  // 0x4 (0x4)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool ReturnValue : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)


}; 
 
 // Function Engine.DebugCameraController.ReceiveOnActivate
struct FReceiveOnActivate
{
	struct APlayerController* OriginalPC;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Divide_TimespanFloat
struct FDivide_TimespanFloat
{
	struct FTimespan A;  // 0x0 (0x0)
	float Scalar;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct FTimespan ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.ActorComponent.IsComponentTickEnabled
struct FIsComponentTickEnabled
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.ActorComponent.K2_DestroyComponent
struct FK2_DestroyComponent
{
	struct UObject* Object;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerController.ServerRecvClientInputFrame
struct FServerRecvClientInputFrame
{
	int32_t RecvClientInputFrame;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct TArray<char> Data;  // 0x8 (0x8)


}; 
 
 // Function Engine.SplineComponent.GetWorldDirectionAtTime
struct FGetWorldDirectionAtTime
{
	float Time;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool bUseConstantVelocity : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.ReceiveAsyncPhysicsTick
struct FReceiveAsyncPhysicsTick
{
	float DeltaSeconds;  // 0x0 (0x0)
	float SimSeconds;  // 0x4 (0x4)


}; 
 
 // Function Engine.KismetMathLibrary.MakeTimespan
struct FMakeTimespan
{
	int32_t Days;  // 0x0 (0x0)
	int32_t Hours;  // 0x4 (0x4)
	int32_t Minutes;  // 0x8 (0x8)
	int32_t Seconds;  // 0xC (0xC)
	int32_t Milliseconds;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)
	struct FTimespan ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetSystemLibrary.BoxTraceMultiByProfile
struct FBoxTraceMultiByProfile
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	struct FVector HalfSize;  // 0x38 (0x38)
	struct FRotator Orientation;  // 0x50 (0x50)
	struct FName ProfileName;  // 0x68 (0x68)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool bTraceComplex : 1;  // 0x70 (0x70)
	char pad_113[7];  // 0x71 (0x71)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x78 (0x78)
	enum class EDrawDebugTrace DrawDebugType;  // 0x88 (0x88)
	char pad_137[7];  // 0x89 (0x89)
	struct TArray<struct FHitResult> OutHits;  // 0x90 (0x90)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool bIgnoreSelf : 1;  // 0xA0 (0xA0)
	char pad_161[3];  // 0xA1 (0xA1)
	struct FLinearColor TraceColor;  // 0xA4 (0xA4)
	struct FLinearColor TraceHitColor;  // 0xB4 (0xB4)
	float DrawTime;  // 0xC4 (0xC4)
	char pad_200_1 : 7;  // 0xC8 (0xC8)
	bool ReturnValue : 1;  // 0xC8 (0xC8)
	char pad_201[7];  // 0xC9 (0xC9)


}; 
 
 // Function Engine.KismetSystemLibrary.IsInterstitialAdAvailable
struct FIsInterstitialAdAvailable
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.SkyAtmosphereComponent.SetMieAbsorption
struct FSetMieAbsorption
{
	struct FLinearColor NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimInstance.GetInstanceMachineWeight
struct FGetInstanceMachineWeight
{
	int32_t MachineIndex;  // 0x0 (0x0)
	float ReturnValue;  // 0x4 (0x4)


}; 
 
 // Function Engine.HUD.ReceiveDrawHUD
struct FReceiveDrawHUD
{
	int32_t SizeX;  // 0x0 (0x0)
	int32_t SizeY;  // 0x4 (0x4)


}; 
 
 // ScriptStruct Engine.FXSystemSpawnParameters
struct FFXSystemSpawnParameters
{
	char pad_0[120];  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Quat_SetComponents
struct FQuat_SetComponents
{
	struct FQuat Q;  // 0x0 (0x0)
	float X;  // 0x20 (0x20)
	float Y;  // 0x24 (0x24)
	float Z;  // 0x28 (0x28)
	float W;  // 0x2C (0x2C)


}; 
 
 // Function Engine.Actor.ReceiveEndPlay
struct FReceiveEndPlay
{
	enum class EEndPlayReason EndPlayReason;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.RemoveTickPrerequisiteActor
struct FRemoveTickPrerequisiteActor
{
	struct AActor* PrerequisiteActor;  // 0x0 (0x0)


}; 
 
 // SparseDelegateFunction Engine.ActorComponentActivatedSignature__DelegateSignature
struct FActorComponentActivatedSignature__DelegateSignature
{
	struct UActorComponent* Component;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bReset : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.SkeletalMeshComponent.GetSkeletalMeshAsset
struct FGetSkeletalMeshAsset
{
	struct USkeletalMesh* ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetStringLibrary.Conv_IntPointToString
struct FConv_IntPointToString
{
	struct FIntPoint InIntPoint;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.PrimitiveComponent.SetWalkableSlopeOverride
struct FSetWalkableSlopeOverride
{
	struct FWalkableSlopeOverride NewOverride;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.LessEqual_DateTimeDateTime
struct FLessEqual_DateTimeDateTime
{
	struct FDateTime A;  // 0x0 (0x0)
	struct FDateTime B;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // ScriptStruct Engine.SoundAttenuationSettings
// Size: 0x3C8(Inherited: 0xC0)
struct FSoundAttenuationSettings : FBaseAttenuationSettings
{
	char bAttenuate : 1;  // 0xC0 (0xC0)
	char bSpatialize : 1;  // 0xC0 (0xC0)
	char bAttenuateWithLPF : 1;  // 0xC0 (0xC0)
	char bEnableListenerFocus : 1;  // 0xC0 (0xC0)
	char bEnableFocusInterpolation : 1;  // 0xC0 (0xC0)
	char bEnableOcclusion : 1;  // 0xC0 (0xC0)
	char bUseComplexCollisionForOcclusion : 1;  // 0xC0 (0xC0)
	char bEnableReverbSend : 1;  // 0xC0 (0xC0)
	char bEnablePriorityAttenuation : 1;  // 0xC1 (0xC1)
	char bApplyNormalizationToStereoSounds : 1;  // 0xC1 (0xC1)
	char bEnableLogFrequencyScaling : 1;  // 0xC1 (0xC1)
	char bEnableSubmixSends : 1;  // 0xC1 (0xC1)
	char bEnableSourceDataOverride : 1;  // 0xC1 (0xC1)
	char bEnableSendToAudioLink : 1;  // 0xC1 (0xC1)
	char pad_193_1 : 2;  // 0xC1 (0xC1)
	enum class ESoundSpatializationAlgorithm SpatializationAlgorithm;  // 0xC2 (0xC2)
	char pad_195[5];  // 0xC3 (0xC3)
	struct UAudioLinkSettingsAbstract* AudioLinkSettingsOverride;  // 0xC8 (0xC8)
	float BinauralRadius;  // 0xD0 (0xD0)
	char pad_212[4];  // 0xD4 (0xD4)
	struct FRuntimeFloatCurve CustomLowpassAirAbsorptionCurve;  // 0xD8 (0xD8)
	struct FRuntimeFloatCurve CustomHighpassAirAbsorptionCurve;  // 0x160 (0x160)
	uint8_t AbsorptionMethod;  // 0x1E8 (0x1E8)
	enum class ECollisionChannel OcclusionTraceChannel;  // 0x1E9 (0x1E9)
	uint8_t ReverbSendMethod;  // 0x1EA (0x1EA)
	uint8_t PriorityAttenuationMethod;  // 0x1EB (0x1EB)
	float OmniRadius;  // 0x1EC (0x1EC)
	float StereoSpread;  // 0x1F0 (0x1F0)
	float LPFRadiusMin;  // 0x1F4 (0x1F4)
	float LPFRadiusMax;  // 0x1F8 (0x1F8)
	float LPFFrequencyAtMin;  // 0x1FC (0x1FC)
	float LPFFrequencyAtMax;  // 0x200 (0x200)
	float HPFFrequencyAtMin;  // 0x204 (0x204)
	float HPFFrequencyAtMax;  // 0x208 (0x208)
	float FocusAzimuth;  // 0x20C (0x20C)
	float NonFocusAzimuth;  // 0x210 (0x210)
	float FocusDistanceScale;  // 0x214 (0x214)
	float NonFocusDistanceScale;  // 0x218 (0x218)
	float FocusPriorityScale;  // 0x21C (0x21C)
	float NonFocusPriorityScale;  // 0x220 (0x220)
	float FocusVolumeAttenuation;  // 0x224 (0x224)
	float NonFocusVolumeAttenuation;  // 0x228 (0x228)
	float FocusAttackInterpSpeed;  // 0x22C (0x22C)
	float FocusReleaseInterpSpeed;  // 0x230 (0x230)
	float OcclusionLowPassFilterFrequency;  // 0x234 (0x234)
	float OcclusionVolumeAttenuation;  // 0x238 (0x238)
	float OcclusionInterpolationTime;  // 0x23C (0x23C)
	float ReverbWetLevelMin;  // 0x240 (0x240)
	float ReverbWetLevelMax;  // 0x244 (0x244)
	float ReverbDistanceMin;  // 0x248 (0x248)
	float ReverbDistanceMax;  // 0x24C (0x24C)
	float ManualReverbSendLevel;  // 0x250 (0x250)
	float PriorityAttenuationMin;  // 0x254 (0x254)
	float PriorityAttenuationMax;  // 0x258 (0x258)
	float PriorityAttenuationDistanceMin;  // 0x25C (0x25C)
	float PriorityAttenuationDistanceMax;  // 0x260 (0x260)
	float ManualPriorityAttenuation;  // 0x264 (0x264)
	struct FRuntimeFloatCurve CustomReverbSendCurve;  // 0x268 (0x268)
	struct TArray<struct FAttenuationSubmixSendSettings> SubmixSendSettings;  // 0x2F0 (0x2F0)
	struct FRuntimeFloatCurve CustomPriorityAttenuationCurve;  // 0x300 (0x300)
	struct FSoundAttenuationPluginSettings PluginSettings;  // 0x388 (0x388)


}; 
 
 // ScriptStruct Engine.ParticleEmitterReplayFrame
struct FParticleEmitterReplayFrame
{
	char pad_0[16];  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.IsZero2D
struct FIsZero2D
{
	struct FVector2D A;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.Actor.GetActorBounds
struct FGetActorBounds
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bOnlyCollidingComponents : 1;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct FVector Origin;  // 0x8 (0x8)
	struct FVector BoxExtent;  // 0x20 (0x20)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool bIncludeFromChildActors : 1;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)


}; 
 
 // Function Engine.ActorComponent.SetActive
struct FSetActive
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewActive : 1;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bReset : 1;  // 0x1 (0x1)


}; 
 
 // Function Engine.VOIPTalker.CreateTalkerForPlayer
struct FCreateTalkerForPlayer
{
	struct APlayerState* OwningState;  // 0x0 (0x0)
	struct UVOIPTalker* ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetConvenientWindowedResolutions
struct FGetConvenientWindowedResolutions
{
	struct TArray<struct FIntPoint> Resolutions;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.PointLightComponent.SetSourceLength
struct FSetSourceLength
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.ActorComponent.SetComponentTickInterval
struct FSetComponentTickInterval
{
	float TickInterval;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.InterpControlPoint
struct FInterpControlPoint
{
	struct FVector PositionControlPoint;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bPositionIsRelative : 1;  // 0x18 (0x18)
	char pad_25[15];  // 0x19 (0x19)


}; 
 
 // ScriptStruct Engine.AnimationFrameSnapshot
struct FAnimationFrameSnapshot
{
	char pad_0[1];  // 0x0 (0x0)


}; 
 
 // Function Engine.DataLayer.IsInitiallyActive
struct FIsInitiallyActive
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.SceneComponent.GetNumChildrenComponents
struct FGetNumChildrenComponents
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.PluginRedirect
struct FPluginRedirect
{
	struct FString OldPluginName;  // 0x0 (0x0)
	struct FString NewPluginName;  // 0x10 (0x10)


}; 
 
 // Function Engine.ActorComponent.SetComponentTickIntervalAndCooldown
struct FSetComponentTickIntervalAndCooldown
{
	float TickInterval;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.StreamingRenderAssetPrimitiveInfo
struct FStreamingRenderAssetPrimitiveInfo
{
	struct UStreamableRenderAsset* RenderAsset;  // 0x0 (0x0)
	struct FBoxSphereBounds Bounds;  // 0x8 (0x8)
	float TexelFactor;  // 0x40 (0x40)
	uint32_t PackedRelativeBox;  // 0x44 (0x44)
	char bAllowInvalidTexelFactorWhenUnregistered : 1;  // 0x48 (0x48)
	char bAffectedByComponentScale : 1;  // 0x48 (0x48)
	char pad_72_1 : 6;  // 0x48 (0x48)
	char pad_73[8];  // 0x49 (0x49)


}; 
 
 // Function Engine.PrimitiveComponent.GetCollisionEnabled
struct FGetCollisionEnabled
{
	enum class ECollisionEnabled ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerController.ClientTravel
struct FClientTravel
{
	struct FString URL;  // 0x0 (0x0)
	enum class ETravelType TravelType;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool bSeamless : 1;  // 0x11 (0x11)
	char pad_18[2];  // 0x12 (0x12)
	struct FGuid MapPackageGuid;  // 0x14 (0x14)
	char pad_36[4];  // 0x24 (0x24)


}; 
 
 // Function Engine.KismetInternationalizationLibrary.GetCurrentCulture
struct FGetCurrentCulture
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.ConstraintInstanceBlueprintLibrary.CopyParams
struct FCopyParams
{
	struct FConstraintInstanceAccessor Accessor;  // 0x0 (0x0)
	struct FConstraintInstanceAccessor SourceAccessor;  // 0xC (0xC)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bKeepPosition : 1;  // 0x18 (0x18)
	char pad_25_1 : 7;  // 0x19 (0x19)
	bool bKeepRotation : 1;  // 0x19 (0x19)
	char pad_26[2];  // 0x1A (0x1A)


}; 
 
 // Function Engine.GameplayStatics.IsSplitscreenForceDisabled
struct FIsSplitscreenForceDisabled
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.ActorComponent.SetIsReplicated
struct FSetIsReplicated
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ShouldReplicate : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerController.StreamingSourceShouldBlockOnSlowStreaming
struct FStreamingSourceShouldBlockOnSlowStreaming
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetRenderingLibrary.ExportRenderTarget
struct FExportRenderTarget
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct UTextureRenderTarget2D* TextureRenderTarget;  // 0x8 (0x8)
	struct FString FilePath;  // 0x10 (0x10)
	struct FString Filename;  // 0x20 (0x20)


}; 
 
 // Function Engine.Actor.SetTickableWhenPaused
struct FSetTickableWhenPaused
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bTickableWhenPaused : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.SceneComponent.K2_GetComponentToWorld
struct FK2_GetComponentToWorld
{
	struct FTransform ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerController.ServerViewSelf
struct FServerViewSelf
{
	struct FViewTargetTransitionParams TransitionParams;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ExponentialHeightFogData
struct FExponentialHeightFogData
{
	float FogDensity;  // 0x0 (0x0)
	float FogHeightFalloff;  // 0x4 (0x4)
	float FogHeightOffset;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.ConeConstraint
// Size: 0x20(Inherited: 0x14)
struct FConeConstraint : FConstraintBaseParams
{
	float Swing1LimitDegrees;  // 0x14 (0x14)
	float Swing2LimitDegrees;  // 0x18 (0x18)
	enum class EAngularConstraintMotion Swing1Motion;  // 0x1C (0x1C)
	enum class EAngularConstraintMotion Swing2Motion;  // 0x1D (0x1D)
	char pad_30[2];  // 0x1E (0x1E)


}; 
 
 // Function Engine.Actor.SetTickGroup
struct FSetTickGroup
{
	enum class ETickingGroup NewTickGroup;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetDisplayName
struct FGetDisplayName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.GameplayStatics.SpawnDialogueAtLocation
struct FSpawnDialogueAtLocation
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct UDialogueWave* Dialogue;  // 0x8 (0x8)
	struct FDialogueContext Context;  // 0x10 (0x10)
	struct FVector Location;  // 0x28 (0x28)
	struct FRotator Rotation;  // 0x40 (0x40)
	float VolumeMultiplier;  // 0x58 (0x58)
	float PitchMultiplier;  // 0x5C (0x5C)
	float StartTime;  // 0x60 (0x60)
	char pad_100[4];  // 0x64 (0x64)
	struct USoundAttenuation* AttenuationSettings;  // 0x68 (0x68)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool bAutoDestroy : 1;  // 0x70 (0x70)
	char pad_113[7];  // 0x71 (0x71)
	struct UAudioComponent* ReturnValue;  // 0x78 (0x78)


}; 
 
 // Function Engine.GameplayStatics.SpawnEmitterAtLocation
struct FSpawnEmitterAtLocation
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct UParticleSystem* EmitterTemplate;  // 0x8 (0x8)
	struct FVector Location;  // 0x10 (0x10)
	struct FRotator Rotation;  // 0x28 (0x28)
	struct FVector Scale;  // 0x40 (0x40)
	char pad_88_1 : 7;  // 0x58 (0x58)
	bool bAutoDestroy : 1;  // 0x58 (0x58)
	uint8_t PoolingMethod;  // 0x59 (0x59)
	char pad_90_1 : 7;  // 0x5A (0x5A)
	bool bAutoActivateSystem : 1;  // 0x5A (0x5A)
	char pad_91[5];  // 0x5B (0x5B)
	struct UParticleSystemComponent* ReturnValue;  // 0x60 (0x60)


}; 
 
 // Function Engine.CapsuleComponent.GetUnscaledCapsuleSize
struct FGetUnscaledCapsuleSize
{
	float OutRadius;  // 0x0 (0x0)
	float OutHalfHeight;  // 0x4 (0x4)


}; 
 
 // SparseDelegateFunction Engine.ActorComponentDeactivateSignature__DelegateSignature
struct FActorComponentDeactivateSignature__DelegateSignature
{
	struct UActorComponent* Component;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.TickFunction
struct FTickFunction
{
	char pad_0[8];  // 0x0 (0x0)
	enum class ETickingGroup TickGroup;  // 0x8 (0x8)
	enum class ETickingGroup EndTickGroup;  // 0x9 (0x9)
	char bTickEvenWhenPaused : 1;  // 0xA (0xA)
	char bCanEverTick : 1;  // 0xA (0xA)
	char bStartWithTickEnabled : 1;  // 0xA (0xA)
	char bAllowTickOnDedicatedServer : 1;  // 0xA (0xA)
	char pad_10_1 : 4;  // 0xA (0xA)
	char pad_11[2];  // 0xB (0xB)
	float TickInterval;  // 0xC (0xC)
	char pad_16[24];  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.LogString
struct FLogString
{
	struct FString InString;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool bPrintToLog : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.PlatformEventsComponent.IsInLaptopMode
struct FIsInLaptopMode
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Divide_IntPointIntPoint
struct FDivide_IntPointIntPoint
{
	struct FIntPoint A;  // 0x0 (0x0)
	struct FIntPoint B;  // 0x8 (0x8)
	struct FIntPoint ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.ConstraintInstanceBlueprintLibrary.GetAngularVelocityTarget
struct FGetAngularVelocityTarget
{
	struct FConstraintInstanceAccessor Accessor;  // 0x0 (0x0)
	char pad_12[4];  // 0xC (0xC)
	struct FVector OutVelTarget;  // 0x10 (0x10)


}; 
 
 // Function Engine.StaticMesh.SetStaticMaterials
struct FSetStaticMaterials
{
	struct TArray<struct FStaticMaterial> InStaticMaterials;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ActorComponentTickFunction
// Size: 0x30(Inherited: 0x28)
struct FActorComponentTickFunction : FTickFunction
{
	char pad_40[8];  // 0x28 (0x28)


}; 
 
 // ScriptStruct Engine.DropNoteInfo
struct FDropNoteInfo
{
	struct FVector Location;  // 0x0 (0x0)
	struct FRotator Rotation;  // 0x18 (0x18)
	struct FString Comment;  // 0x30 (0x30)


}; 
 
 // ScriptStruct Engine.MaterialCachedParameterEditorInfo
struct FMaterialCachedParameterEditorInfo
{
	struct FString Description;  // 0x0 (0x0)
	struct FName Group;  // 0x10 (0x10)
	int32_t SortPriority;  // 0x18 (0x18)
	int32_t AssetIndex;  // 0x1C (0x1C)
	struct FGuid ExpressionGUID;  // 0x20 (0x20)


}; 
 
 // SparseDelegateFunction Engine.ActorEndCursorOverSignature__DelegateSignature
struct FActorEndCursorOverSignature__DelegateSignature
{
	struct AActor* TouchedActor;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.BatchedPoint
struct FBatchedPoint
{
	struct FVector Position;  // 0x0 (0x0)
	struct FLinearColor Color;  // 0x18 (0x18)
	float PointSize;  // 0x28 (0x28)
	float RemainingLifeTime;  // 0x2C (0x2C)
	char DepthPriority;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)


}; 
 
 // DelegateFunction Engine.ApplicationLifecycleComponent.OnLowPowerModeDelegate__DelegateSignature
struct FOnLowPowerModeDelegate__DelegateSignature
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bInLowPowerMode : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.BakedStringCustomAttribute
struct FBakedStringCustomAttribute
{
	char pad_0[1];  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetNodeHelperLibrary.GetRandomUnmarkedBit
struct FGetRandomUnmarkedBit
{
	int32_t Data;  // 0x0 (0x0)
	int32_t StartIdx;  // 0x4 (0x4)
	int32_t NumBits;  // 0x8 (0x8)
	int32_t ReturnValue;  // 0xC (0xC)


}; 
 
 // DelegateFunction Engine.ApplicationLifecycleComponent.OnTemperatureChangeDelegate__DelegateSignature
struct FOnTemperatureChangeDelegate__DelegateSignature
{
	uint8_t Severity;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimInstance.GetRelevantAnimTimeRemaining
struct FGetRelevantAnimTimeRemaining
{
	int32_t MachineIndex;  // 0x0 (0x0)
	int32_t StateIndex;  // 0x4 (0x4)
	float ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetSoftClassPath
struct FGetSoftClassPath
{
	UObject* Class;  // 0x0 (0x0)
	struct FSoftClassPath ReturnValue;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.ApplicationLifecycleComponent.ApplicationStartupArgumentsDelegate__DelegateSignature
struct FApplicationStartupArgumentsDelegate__DelegateSignature
{
	struct TArray<struct FString> StartupArguments;  // 0x0 (0x0)


}; 
 
 // Function Engine.MovementComponent.K2_MoveUpdatedComponent
struct FK2_MoveUpdatedComponent
{
	struct FVector Delta;  // 0x0 (0x0)
	struct FRotator NewRotation;  // 0x18 (0x18)
	struct FHitResult OutHit;  // 0x30 (0x30)
	char pad_280_1 : 7;  // 0x118 (0x118)
	bool bSweep : 1;  // 0x118 (0x118)
	char pad_281_1 : 7;  // 0x119 (0x119)
	bool bTeleport : 1;  // 0x119 (0x119)
	char pad_282_1 : 7;  // 0x11A (0x11A)
	bool ReturnValue : 1;  // 0x11A (0x11A)
	char pad_283[5];  // 0x11B (0x11B)


}; 
 
 // Function Engine.KismetSystemLibrary.BoxTraceSingleForObjects
struct FBoxTraceSingleForObjects
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	struct FVector HalfSize;  // 0x38 (0x38)
	struct FRotator Orientation;  // 0x50 (0x50)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x68 (0x68)
	char pad_120_1 : 7;  // 0x78 (0x78)
	bool bTraceComplex : 1;  // 0x78 (0x78)
	char pad_121[7];  // 0x79 (0x79)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x80 (0x80)
	enum class EDrawDebugTrace DrawDebugType;  // 0x90 (0x90)
	char pad_145[7];  // 0x91 (0x91)
	struct FHitResult OutHit;  // 0x98 (0x98)
	char pad_384_1 : 7;  // 0x180 (0x180)
	bool bIgnoreSelf : 1;  // 0x180 (0x180)
	char pad_385[3];  // 0x181 (0x181)
	struct FLinearColor TraceColor;  // 0x184 (0x184)
	struct FLinearColor TraceHitColor;  // 0x194 (0x194)
	float DrawTime;  // 0x1A4 (0x1A4)
	char pad_424_1 : 7;  // 0x1A8 (0x1A8)
	bool ReturnValue : 1;  // 0x1A8 (0x1A8)
	char pad_425[7];  // 0x1A9 (0x1A9)


}; 
 
 // ScriptStruct Engine.ConstraintBaseParams
struct FConstraintBaseParams
{
	float Stiffness;  // 0x0 (0x0)
	float Damping;  // 0x4 (0x4)
	float Restitution;  // 0x8 (0x8)
	float ContactDistance;  // 0xC (0xC)
	char bSoftConstraint : 1;  // 0x10 (0x10)
	char pad_16_1 : 7;  // 0x10 (0x10)
	char pad_17[4];  // 0x11 (0x11)


}; 
 
 // ScriptStruct Engine.ChannelDefinition
struct FChannelDefinition
{
	struct FName ChannelName;  // 0x0 (0x0)
	struct FName ClassName;  // 0x8 (0x8)
	 ChannelClass;  // 0x10 (0x10)
	int32_t StaticChannelIndex;  // 0x18 (0x18)
	char bTickOnCreate : 1;  // 0x1C (0x1C)
	char bServerOpen : 1;  // 0x1C (0x1C)
	char bClientOpen : 1;  // 0x1C (0x1C)
	char bInitialServer : 1;  // 0x1C (0x1C)
	char bInitialClient : 1;  // 0x1C (0x1C)
	char pad_28_1 : 3;  // 0x1C (0x1C)
	char pad_29[4];  // 0x1D (0x1D)


}; 
 
 // DelegateFunction Engine.DataDrivenCVarEngineSubsystem.OnDataDrivenCVarChanged__DelegateSignature
struct FOnDataDrivenCVarChanged__DelegateSignature
{
	struct FString CVarName;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_ClearTimerHandle
struct FK2_ClearTimerHandle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FTimerHandle Handle;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetConsoleVariableBoolValue
struct FGetConsoleVariableBoolValue
{
	struct FString VariableName;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.KismetMathLibrary.ComposeRotators
struct FComposeRotators
{
	struct FRotator A;  // 0x0 (0x0)
	struct FRotator B;  // 0x18 (0x18)
	struct FRotator ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.MovementComponent.ConstrainDirectionToPlane
struct FConstrainDirectionToPlane
{
	struct FVector Direction;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetRenderingLibrary.ReadRenderTargetRawUVArea
struct FReadRenderTargetRawUVArea
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct UTextureRenderTarget2D* TextureRenderTarget;  // 0x8 (0x8)
	struct FBox2D Area;  // 0x10 (0x10)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool bNormalize : 1;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)
	struct TArray<struct FLinearColor> ReturnValue;  // 0x40 (0x40)


}; 
 
 // Function Engine.PhysicsConstraintComponent.GetCurrentSwing2
struct FGetCurrentSwing2
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.SplineComponent.SetSplinePointType
struct FSetSplinePointType
{
	int32_t PointIndex;  // 0x0 (0x0)
	enum class ESplinePointType Type;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool bUpdateSpline : 1;  // 0x5 (0x5)
	char pad_6[2];  // 0x6 (0x6)


}; 
 
 // ScriptStruct Engine.IntegralCurve
// Size: 0x80(Inherited: 0x68)
struct FIntegralCurve : FIndexedCurve
{
	struct TArray<struct FIntegralKey> Keys;  // 0x68 (0x68)
	int32_t DefaultValue;  // 0x78 (0x78)
	char pad_124_1 : 7;  // 0x7C (0x7C)
	bool bUseDefaultValueBeforeFirstKey : 1;  // 0x7C (0x7C)
	char pad_125[3];  // 0x7D (0x7D)


}; 
 
 // Function Engine.MovementComponent.ConstrainNormalToPlane
struct FConstrainNormalToPlane
{
	struct FVector Normal;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x18 (0x18)


}; 
 
 // ScriptStruct Engine.CachedPoseIndices
struct FCachedPoseIndices
{
	struct TArray<int32_t> OrderedSavedPoseNodeIndices;  // 0x0 (0x0)


}; 
 
 // Function Engine.MovementComponent.GetGravityZ
struct FGetGravityZ
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.CameraLensEffectInterfaceClassSupportLibrary.SetInterfaceClass
struct FSetInterfaceClass
{
	AActor* Class;  // 0x0 (0x0)
	struct FCameraLensInterfaceClassSupport Var;  // 0x8 (0x8)
	uint8_t Result;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.SplineComponent.GetLocationAtSplinePoint
struct FGetLocationAtSplinePoint
{
	int32_t PointIndex;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_ObjectToClass
struct FConv_ObjectToClass
{
	struct UObject* Object;  // 0x0 (0x0)
	UObject* Class;  // 0x8 (0x8)
	UObject* ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.PrimitiveComponent.SetHiddenInSceneCapture
struct FSetHiddenInSceneCapture
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.StereoLayerComponent.SetTexture
struct FSetTexture
{
	struct UTexture* InTexture;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlatformInputDeviceMapperLibrary.NotEqual_InputDeviceId
struct FNotEqual_InputDeviceId
{
	struct FInputDeviceId A;  // 0x0 (0x0)
	struct FInputDeviceId B;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.MovementComponent.GetMaxSpeed
struct FGetMaxSpeed
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.ClampVectorSize
struct FClampVectorSize
{
	struct FVector A;  // 0x0 (0x0)
	double Min;  // 0x18 (0x18)
	double Max;  // 0x20 (0x20)
	struct FVector ReturnValue;  // 0x28 (0x28)


}; 
 
 // Function Engine.KismetSystemLibrary.ConvertToRelativePath
struct FConvertToRelativePath
{
	struct FString Filename;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride
struct FSetSkinWeightOverride
{
	int32_t LODIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct TArray<struct FSkelMeshSkinWeightInfo> SkinWeights;  // 0x8 (0x8)


}; 
 
 // Function Engine.PrimitiveComponent.GetGenerateOverlapEvents
struct FGetGenerateOverlapEvents
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.LinearColor_ToNewOpacity
struct FLinearColor_ToNewOpacity
{
	struct FLinearColor InColor;  // 0x0 (0x0)
	float InOpacity;  // 0x10 (0x10)
	struct FLinearColor ReturnValue;  // 0x14 (0x14)


}; 
 
 // Function Engine.SceneComponent.GetSocketTransform
struct FGetSocketTransform
{
	struct FName InSocketName;  // 0x0 (0x0)
	enum class ERelativeTransformSpace TransformSpace;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)
	struct FTransform ReturnValue;  // 0x10 (0x10)


}; 
 
 // ScriptStruct Engine.CompilerNativizationOptions
struct FCompilerNativizationOptions
{
	struct FName PlatformName;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ServerOnlyPlatform : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool ClientOnlyPlatform : 1;  // 0x9 (0x9)
	char pad_10_1 : 7;  // 0xA (0xA)
	bool bExcludeMonolithicHeaders : 1;  // 0xA (0xA)
	char pad_11[5];  // 0xB (0xB)
	struct TArray<struct FName> ExcludedModules;  // 0x10 (0x10)
	struct TSet<struct FSoftObjectPath> ExcludedAssets;  // 0x20 (0x20)
	struct TArray<struct FString> ExcludedFolderPaths;  // 0x70 (0x70)


}; 
 
 // ScriptStruct Engine.LODSoloTrack
struct FLODSoloTrack
{
	struct TArray<char> SoloEnableSetting;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.EqualEqual_DateTimeDateTime
struct FEqualEqual_DateTimeDateTime
{
	struct FDateTime A;  // 0x0 (0x0)
	struct FDateTime B;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.SceneComponent.GetPhysicsVolume
struct FGetPhysicsVolume
{
	struct APhysicsVolume* ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.SkinnedMeshComponent.TransformToBoneSpace
struct FTransformToBoneSpace
{
	struct FName BoneName;  // 0x0 (0x0)
	struct FVector InPosition;  // 0x8 (0x8)
	struct FRotator InRotation;  // 0x20 (0x20)
	struct FVector OutPosition;  // 0x38 (0x38)
	struct FRotator OutRotation;  // 0x50 (0x50)


}; 
 
 // Function Engine.KismetSystemLibrary.ShowPlatformSpecificAchievementsScreen
struct FShowPlatformSpecificAchievementsScreen
{
	struct APlayerController* SpecificPlayer;  // 0x0 (0x0)


}; 
 
 // Function Engine.MovementComponent.GetPlaneConstraintAxisSetting
struct FGetPlaneConstraintAxisSetting
{
	uint8_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.BreakSoftClassPath
struct FBreakSoftClassPath
{
	struct FSoftClassPath InSoftClassPath;  // 0x0 (0x0)
	struct FString PathString;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetTextLibrary.Conv_Vector2dToText
struct FConv_Vector2dToText
{
	struct FVector2D InVec;  // 0x0 (0x0)
	struct FText ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetMathLibrary.RotatorFromAxisAndAngle
struct FRotatorFromAxisAndAngle
{
	struct FVector Axis;  // 0x0 (0x0)
	float Angle;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)
	struct FRotator ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationBadgeAtTime
struct FScheduleLocalNotificationBadgeAtTime
{
	struct FDateTime FireDateTime;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool LocalTime : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)
	struct FString ActivationEvent;  // 0x10 (0x10)
	int32_t ReturnValue;  // 0x20 (0x20)
	char pad_36[4];  // 0x24 (0x24)


}; 
 
 // Function Engine.MovementComponent.GetPlaneConstraintNormal
struct FGetPlaneConstraintNormal
{
	struct FVector ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.NotEqualExactly_Vector2DVector2D
struct FNotEqualExactly_Vector2DVector2D
{
	struct FVector2D A;  // 0x0 (0x0)
	struct FVector2D B;  // 0x10 (0x10)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)


}; 
 
 // ScriptStruct Engine.CollectionReference
struct FCollectionReference
{
	struct FName CollectionName;  // 0x0 (0x0)


}; 
 
 // Function Engine.BlueprintSetLibrary.Set_ToArray
struct FSet_ToArray
{
	struct TSet<int32_t> A;  // 0x0 (0x0)
	struct TArray<int32_t> Result;  // 0x50 (0x50)


}; 
 
 // Function Engine.DataLayerSubsystem.GetDataLayerRuntimeStateByLabel
struct FGetDataLayerRuntimeStateByLabel
{
	struct FName InDataLayerLabel;  // 0x0 (0x0)
	uint8_t ReturnValue;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetSystemLibrary.SetVector3fPropertyByName
struct FSetVector3fPropertyByName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)
	struct FVector3f Value;  // 0x10 (0x10)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // Function Engine.StaticMesh.GetMaterial
struct FGetMaterial
{
	int32_t MaterialIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UMaterialInterface* ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.Vector_ComponentMin
struct FVector_ComponentMin
{
	struct FVector A;  // 0x0 (0x0)
	struct FVector B;  // 0x18 (0x18)
	struct FVector ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.MovementComponent.GetPlaneConstraintOrigin
struct FGetPlaneConstraintOrigin
{
	struct FVector ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.RGBToHSV
struct FRGBToHSV
{
	struct FLinearColor InColor;  // 0x0 (0x0)
	float H;  // 0x10 (0x10)
	float S;  // 0x14 (0x14)
	float V;  // 0x18 (0x18)
	float A;  // 0x1C (0x1C)


}; 
 
 // Function Engine.SceneComponent.GetSocketQuaternion
struct FGetSocketQuaternion
{
	struct FName InSocketName;  // 0x0 (0x0)
	char pad_8[8];  // 0x8 (0x8)
	struct FQuat ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetMathLibrary.Matrix_InverseTransformPosition
struct FMatrix_InverseTransformPosition
{
	struct FMatrix M;  // 0x0 (0x0)
	struct FVector V;  // 0x80 (0x80)
	struct FVector ReturnValue;  // 0x98 (0x98)


}; 
 
 // Function Engine.GameStateBase.GetServerWorldTimeSeconds
struct FGetServerWorldTimeSeconds
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // SparseDelegateFunction Engine.ActorDestroyedSignature__DelegateSignature
struct FActorDestroyedSignature__DelegateSignature
{
	struct AActor* DestroyedActor;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.K2_GetRootComponent
struct FK2_GetRootComponent
{
	struct USceneComponent* ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ColorGradePerRangeSettings
struct FColorGradePerRangeSettings
{
	struct FVector4 Saturation;  // 0x0 (0x0)
	struct FVector4 Contrast;  // 0x20 (0x20)
	struct FVector4 Gamma;  // 0x40 (0x40)
	struct FVector4 Gain;  // 0x60 (0x60)
	struct FVector4 Offset;  // 0x80 (0x80)


}; 
 
 // Function Engine.MovementComponent.IsExceedingMaxSpeed
struct FIsExceedingMaxSpeed
{
	float MaxSpeed;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)


}; 
 
 // Function Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate
struct FGetAllowedAnimCurveEvaluate
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimInstance.GetLinkedAnimLayerInstancesByGroup
struct FGetLinkedAnimLayerInstancesByGroup
{
	struct FName InGroup;  // 0x0 (0x0)
	struct TArray<struct UAnimInstance*> OutLinkedInstances;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMaterialLibrary.CreateDynamicMaterialInstance
struct FCreateDynamicMaterialInstance
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct UMaterialInterface* Parent;  // 0x8 (0x8)
	struct FName OptionalName;  // 0x10 (0x10)
	uint8_t CreationFlags;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct UMaterialInstanceDynamic* ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.AudioComponent.PlayQuantized
struct FPlayQuantized
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct UQuartzClockHandle* InClockHandle;  // 0x8 (0x8)
	struct FQuartzQuantizationBoundary InQuantizationBoundary;  // 0x10 (0x10)
	struct FDelegate InDelegate;  // 0x30 (0x30)
	float InStartTime;  // 0x40 (0x40)
	float InFadeInDuration;  // 0x44 (0x44)
	float InFadeVolumeLevel;  // 0x48 (0x48)
	uint8_t InFadeCurve;  // 0x4C (0x4C)
	char pad_77[3];  // 0x4D (0x4D)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_SetTimer
struct FK2_SetTimer
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)
	float Time;  // 0x18 (0x18)
	char pad_28_1 : 7;  // 0x1C (0x1C)
	bool bLooping : 1;  // 0x1C (0x1C)
	char pad_29[3];  // 0x1D (0x1D)
	float InitialStartDelay;  // 0x20 (0x20)
	float InitialStartDelayVariance;  // 0x24 (0x24)
	struct FTimerHandle ReturnValue;  // 0x28 (0x28)


}; 
 
 // Function Engine.MovementComponent.PhysicsVolumeChanged
struct FPhysicsVolumeChanged
{
	struct APhysicsVolume* NewVolume;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetStringLibrary.BuildString_Name
struct FBuildString_Name
{
	struct FString AppendTo;  // 0x0 (0x0)
	struct FString Prefix;  // 0x10 (0x10)
	struct FName InName;  // 0x20 (0x20)
	struct FString Suffix;  // 0x28 (0x28)
	struct FString ReturnValue;  // 0x38 (0x38)


}; 
 
 // ScriptStruct Engine.SceneViewExtensionIsActiveFunctor
struct FSceneViewExtensionIsActiveFunctor
{
	char pad_0[80];  // 0x0 (0x0)


}; 
 
 // SparseDelegateFunction Engine.ActorEndTouchOverSignature__DelegateSignature
struct FActorEndTouchOverSignature__DelegateSignature
{
	enum class ETouchIndex FingerIndex;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct AActor* TouchedActor;  // 0x8 (0x8)


}; 
 
 // Function Engine.MovementComponent.SetPlaneConstraintAxisSetting
struct FSetPlaneConstraintAxisSetting
{
	uint8_t NewAxisSetting;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ParameterChannelNames
struct FParameterChannelNames
{
	struct FText R;  // 0x0 (0x0)
	struct FText G;  // 0x18 (0x18)
	struct FText B;  // 0x30 (0x30)
	struct FText A;  // 0x48 (0x48)


}; 
 
 // Function Engine.AnimInstance.GetInstanceAssetPlayerLength
struct FGetInstanceAssetPlayerLength
{
	int32_t AssetPlayerIndex;  // 0x0 (0x0)
	float ReturnValue;  // 0x4 (0x4)


}; 
 
 // Function Engine.MovementComponent.SetPlaneConstraintEnabled
struct FSetPlaneConstraintEnabled
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bEnabled : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Divide_IntPointInt
struct FDivide_IntPointInt
{
	struct FIntPoint A;  // 0x0 (0x0)
	int32_t B;  // 0x8 (0x8)
	struct FIntPoint ReturnValue;  // 0xC (0xC)


}; 
 
 // Function Engine.Actor.SetNetDormancy
struct FSetNetDormancy
{
	enum class ENetDormancy NewDormancy;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.IgnoreComponentWhenMoving
struct FIgnoreComponentWhenMoving
{
	struct UPrimitiveComponent* Component;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bShouldIgnore : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // ScriptStruct Engine.CurveEdTab
struct FCurveEdTab
{
	struct FString TabName;  // 0x0 (0x0)
	struct TArray<struct FCurveEdEntry> Curves;  // 0x10 (0x10)
	float ViewStartInput;  // 0x20 (0x20)
	float ViewEndInput;  // 0x24 (0x24)
	float ViewStartOutput;  // 0x28 (0x28)
	float ViewEndOutput;  // 0x2C (0x2C)


}; 
 
 // Function Engine.MovementComponent.SetPlaneConstraintFromVectors
struct FSetPlaneConstraintFromVectors
{
	struct FVector Forward;  // 0x0 (0x0)
	struct FVector Up;  // 0x18 (0x18)


}; 
 
 // Function Engine.Character.ClientAdjustPosition
struct FClientAdjustPosition
{
	float Timestamp;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector NewLoc;  // 0x8 (0x8)
	struct FVector NewVel;  // 0x20 (0x20)
	struct UPrimitiveComponent* NewBase;  // 0x38 (0x38)
	struct FName NewBaseBoneName;  // 0x40 (0x40)
	char pad_72_1 : 7;  // 0x48 (0x48)
	bool bHasBase : 1;  // 0x48 (0x48)
	char pad_73_1 : 7;  // 0x49 (0x49)
	bool bBaseRelativePosition : 1;  // 0x49 (0x49)
	char ServerMovementMode;  // 0x4A (0x4A)
	char pad_75[5];  // 0x4B (0x4B)


}; 
 
 // Function Engine.MovementComponent.SetPlaneConstraintOrigin
struct FSetPlaneConstraintOrigin
{
	struct FVector PlaneOrigin;  // 0x0 (0x0)


}; 
 
 // Function Engine.MovementComponent.SetUpdatedComponent
struct FSetUpdatedComponent
{
	struct USceneComponent* NewUpdatedComponent;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.SetActorEnableCollision
struct FSetActorEnableCollision
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewActorEnableCollision : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetSupportedFullscreenResolutions
struct FGetSupportedFullscreenResolutions
{
	struct TArray<struct FIntPoint> Resolutions;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.KismetMathLibrary.Add_DoubleDouble
struct FAdd_DoubleDouble
{
	double A;  // 0x0 (0x0)
	double B;  // 0x8 (0x8)
	double ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.GameplayStatics.SetViewportMouseCaptureMode
struct FSetViewportMouseCaptureMode
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	uint8_t MouseCaptureMode;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugCone
struct FDrawDebugCone
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Origin;  // 0x8 (0x8)
	struct FVector Direction;  // 0x20 (0x20)
	float Length;  // 0x38 (0x38)
	float AngleWidth;  // 0x3C (0x3C)
	float AngleHeight;  // 0x40 (0x40)
	int32_t NumSides;  // 0x44 (0x44)
	struct FLinearColor LineColor;  // 0x48 (0x48)
	float Duration;  // 0x58 (0x58)
	float Thickness;  // 0x5C (0x5C)


}; 
 
 // Function Engine.SplineComponent.GetDirectionAtSplinePoint
struct FGetDirectionAtSplinePoint
{
	int32_t PointIndex;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.InterpToMovementComponent.AddControlPointPosition
struct FAddControlPointPosition
{
	struct FVector Pos;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bPositionIsRelative : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // Function Engine.TextRenderComponent.SetVerticalAlignment
struct FSetVerticalAlignment
{
	enum class EVerticalTextAligment Value;  // 0x0 (0x0)


}; 
 
 // SparseDelegateFunction Engine.ComponentBeginCursorOverSignature__DelegateSignature
struct FComponentBeginCursorOverSignature__DelegateSignature
{
	struct UPrimitiveComponent* TouchedComponent;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.K2_GetComponentsByClass
struct FK2_GetComponentsByClass
{
	UActorComponent* ComponentClass;  // 0x0 (0x0)
	struct TArray<struct UActorComponent*> ReturnValue;  // 0x8 (0x8)


}; 
 
 // DelegateFunction Engine.InterpToMovementComponent.OnInterpToResetDelegate__DelegateSignature
struct FOnInterpToResetDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0 (0x0)
	float Time;  // 0xE8 (0xE8)
	char pad_236[4];  // 0xEC (0xEC)


}; 
 
 // Function Engine.TimelineComponent.SetFloatCurve
struct FSetFloatCurve
{
	struct UCurveFloat* NewFloatCurve;  // 0x0 (0x0)
	struct FName FloatTrackName;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.Quat_SetFromEuler
struct FQuat_SetFromEuler
{
	struct FQuat Q;  // 0x0 (0x0)
	struct FVector Euler;  // 0x20 (0x20)
	char pad_56[8];  // 0x38 (0x38)


}; 
 
 // Function Engine.AnimationDataController.RemoveAttributeKey
struct FRemoveAttributeKey
{
	struct FAnimationAttributeIdentifier AttributeIdentifier;  // 0x0 (0x0)
	float Time;  // 0x40 (0x40)
	char pad_68_1 : 7;  // 0x44 (0x44)
	bool bShouldTransact : 1;  // 0x44 (0x44)
	char pad_69_1 : 7;  // 0x45 (0x45)
	bool ReturnValue : 1;  // 0x45 (0x45)
	char pad_70[2];  // 0x46 (0x46)


}; 
 
 // Function Engine.KismetMathLibrary.Max
struct FMax
{
	int32_t A;  // 0x0 (0x0)
	int32_t B;  // 0x4 (0x4)
	int32_t ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.SceneComponent.K2_GetComponentLocation
struct FK2_GetComponentLocation
{
	struct FVector ReturnValue;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.InterpToMovementComponent.OnInterpToReverseDelegate__DelegateSignature
struct FOnInterpToReverseDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0 (0x0)
	float Time;  // 0xE8 (0xE8)
	char pad_236[4];  // 0xEC (0xEC)


}; 
 
 // Function Engine.KismetMathLibrary.Matrix_GetInverse
struct FMatrix_GetInverse
{
	struct FMatrix M;  // 0x0 (0x0)
	struct FMatrix ReturnValue;  // 0x80 (0x80)


}; 
 
 // DelegateFunction Engine.InterpToMovementComponent.OnInterpToStopDelegate__DelegateSignature
struct FOnInterpToStopDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0 (0x0)
	float Time;  // 0xE8 (0xE8)
	char pad_236[4];  // 0xEC (0xEC)


}; 
 
 // Function Engine.ParticleSystemComponent.SetBeamEndPoint
struct FSetBeamEndPoint
{
	int32_t EmitterIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector NewEndPoint;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.SpatialHashStreamingGridLevel
struct FSpatialHashStreamingGridLevel
{
	struct TArray<struct FSpatialHashStreamingGridLayerCell> LayerCells;  // 0x0 (0x0)
	struct TMap<int64_t, int32_t> LayerCellsMapping;  // 0x10 (0x10)


}; 
 
 // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature
struct FOnProjectileStopDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.PostProcessSettings
struct FPostProcessSettings
{
	char bOverride_TemperatureType : 1;  // 0x0 (0x0)
	char bOverride_WhiteTemp : 1;  // 0x0 (0x0)
	char bOverride_WhiteTint : 1;  // 0x0 (0x0)
	char bOverride_ColorSaturation : 1;  // 0x0 (0x0)
	char bOverride_ColorContrast : 1;  // 0x0 (0x0)
	char bOverride_ColorGamma : 1;  // 0x0 (0x0)
	char bOverride_ColorGain : 1;  // 0x0 (0x0)
	char bOverride_ColorOffset : 1;  // 0x0 (0x0)
	char bOverride_ColorSaturationShadows : 1;  // 0x1 (0x1)
	char bOverride_ColorContrastShadows : 1;  // 0x1 (0x1)
	char bOverride_ColorGammaShadows : 1;  // 0x1 (0x1)
	char bOverride_ColorGainShadows : 1;  // 0x1 (0x1)
	char bOverride_ColorOffsetShadows : 1;  // 0x1 (0x1)
	char bOverride_ColorSaturationMidtones : 1;  // 0x1 (0x1)
	char bOverride_ColorContrastMidtones : 1;  // 0x1 (0x1)
	char bOverride_ColorGammaMidtones : 1;  // 0x1 (0x1)
	char bOverride_ColorGainMidtones : 1;  // 0x2 (0x2)
	char bOverride_ColorOffsetMidtones : 1;  // 0x2 (0x2)
	char bOverride_ColorSaturationHighlights : 1;  // 0x2 (0x2)
	char bOverride_ColorContrastHighlights : 1;  // 0x2 (0x2)
	char bOverride_ColorGammaHighlights : 1;  // 0x2 (0x2)
	char bOverride_ColorGainHighlights : 1;  // 0x2 (0x2)
	char bOverride_ColorOffsetHighlights : 1;  // 0x2 (0x2)
	char bOverride_ColorCorrectionShadowsMax : 1;  // 0x2 (0x2)
	char bOverride_ColorCorrectionHighlightsMin : 1;  // 0x3 (0x3)
	char bOverride_ColorCorrectionHighlightsMax : 1;  // 0x3 (0x3)
	char bOverride_BlueCorrection : 1;  // 0x3 (0x3)
	char bOverride_ExpandGamut : 1;  // 0x3 (0x3)
	char bOverride_ToneCurveAmount : 1;  // 0x3 (0x3)
	char bOverride_FilmSlope : 1;  // 0x3 (0x3)
	char bOverride_FilmToe : 1;  // 0x3 (0x3)
	char bOverride_FilmShoulder : 1;  // 0x3 (0x3)
	char bOverride_FilmBlackClip : 1;  // 0x4 (0x4)
	char bOverride_FilmWhiteClip : 1;  // 0x4 (0x4)
	char bOverride_SceneColorTint : 1;  // 0x4 (0x4)
	char bOverride_SceneFringeIntensity : 1;  // 0x4 (0x4)
	char bOverride_ChromaticAberrationStartOffset : 1;  // 0x4 (0x4)
	char bOverride_AmbientCubemapTint : 1;  // 0x4 (0x4)
	char bOverride_AmbientCubemapIntensity : 1;  // 0x4 (0x4)
	char bOverride_BloomMethod : 1;  // 0x4 (0x4)
	char bOverride_BloomIntensity : 1;  // 0x5 (0x5)
	char bOverride_BloomThreshold : 1;  // 0x5 (0x5)
	char bOverride_Bloom1Tint : 1;  // 0x5 (0x5)
	char bOverride_Bloom1Size : 1;  // 0x5 (0x5)
	char bOverride_Bloom2Size : 1;  // 0x5 (0x5)
	char bOverride_Bloom2Tint : 1;  // 0x5 (0x5)
	char bOverride_Bloom3Tint : 1;  // 0x5 (0x5)
	char bOverride_Bloom3Size : 1;  // 0x5 (0x5)
	char bOverride_Bloom4Tint : 1;  // 0x6 (0x6)
	char bOverride_Bloom4Size : 1;  // 0x6 (0x6)
	char bOverride_Bloom5Tint : 1;  // 0x6 (0x6)
	char bOverride_Bloom5Size : 1;  // 0x6 (0x6)
	char bOverride_Bloom6Tint : 1;  // 0x6 (0x6)
	char bOverride_Bloom6Size : 1;  // 0x6 (0x6)
	char bOverride_BloomSizeScale : 1;  // 0x6 (0x6)
	char bOverride_BloomConvolutionTexture : 1;  // 0x6 (0x6)
	char bOverride_BloomConvolutionScatterDispersion : 1;  // 0x7 (0x7)
	char bOverride_BloomConvolutionSize : 1;  // 0x7 (0x7)
	char bOverride_BloomConvolutionCenterUV : 1;  // 0x7 (0x7)
	char bOverride_BloomConvolutionPreFilter : 1;  // 0x7 (0x7)
	char bOverride_BloomConvolutionPreFilterMin : 1;  // 0x7 (0x7)
	char bOverride_BloomConvolutionPreFilterMax : 1;  // 0x7 (0x7)
	char bOverride_BloomConvolutionPreFilterMult : 1;  // 0x7 (0x7)
	char bOverride_BloomConvolutionBufferScale : 1;  // 0x7 (0x7)
	char bOverride_BloomDirtMaskIntensity : 1;  // 0x8 (0x8)
	char bOverride_BloomDirtMaskTint : 1;  // 0x8 (0x8)
	char bOverride_BloomDirtMask : 1;  // 0x8 (0x8)
	char bOverride_CameraShutterSpeed : 1;  // 0x8 (0x8)
	char bOverride_CameraISO : 1;  // 0x8 (0x8)
	char bOverride_AutoExposureMethod : 1;  // 0x8 (0x8)
	char bOverride_AutoExposureLowPercent : 1;  // 0x8 (0x8)
	char bOverride_AutoExposureHighPercent : 1;  // 0x8 (0x8)
	char bOverride_AutoExposureMinBrightness : 1;  // 0x9 (0x9)
	char bOverride_AutoExposureMaxBrightness : 1;  // 0x9 (0x9)
	char bOverride_AutoExposureCalibrationConstant : 1;  // 0x9 (0x9)
	char bOverride_AutoExposureSpeedUp : 1;  // 0x9 (0x9)
	char bOverride_AutoExposureSpeedDown : 1;  // 0x9 (0x9)
	char bOverride_AutoExposureBias : 1;  // 0x9 (0x9)
	char bOverride_AutoExposureBiasCurve : 1;  // 0x9 (0x9)
	char bOverride_AutoExposureMeterMask : 1;  // 0x9 (0x9)
	char bOverride_AutoExposureApplyPhysicalCameraExposure : 1;  // 0xA (0xA)
	char bOverride_HistogramLogMin : 1;  // 0xA (0xA)
	char bOverride_HistogramLogMax : 1;  // 0xA (0xA)
	char bOverride_LocalExposureContrastScale : 1;  // 0xA (0xA)
	char bOverride_LocalExposureHighlightContrastScale : 1;  // 0xA (0xA)
	char bOverride_LocalExposureShadowContrastScale : 1;  // 0xA (0xA)
	char bOverride_LocalExposureDetailStrength : 1;  // 0xA (0xA)
	char bOverride_LocalExposureBlurredLuminanceBlend : 1;  // 0xA (0xA)
	char bOverride_LocalExposureBlurredLuminanceKernelSizePercent : 1;  // 0xB (0xB)
	char bOverride_LocalExposureMiddleGreyBias : 1;  // 0xB (0xB)
	char bOverride_LensFlareIntensity : 1;  // 0xB (0xB)
	char bOverride_LensFlareTint : 1;  // 0xB (0xB)
	char bOverride_LensFlareTints : 1;  // 0xB (0xB)
	char bOverride_LensFlareBokehSize : 1;  // 0xB (0xB)
	char bOverride_LensFlareBokehShape : 1;  // 0xB (0xB)
	char bOverride_LensFlareThreshold : 1;  // 0xB (0xB)
	char bOverride_VignetteIntensity : 1;  // 0xC (0xC)
	char bOverride_GrainIntensity : 1;  // 0xC (0xC)
	char bOverride_GrainJitter : 1;  // 0xC (0xC)
	char bOverride_FilmGrainIntensity : 1;  // 0xC (0xC)
	char bOverride_FilmGrainIntensityShadows : 1;  // 0xC (0xC)
	char bOverride_FilmGrainIntensityMidtones : 1;  // 0xC (0xC)
	char bOverride_FilmGrainIntensityHighlights : 1;  // 0xC (0xC)
	char bOverride_FilmGrainShadowsMax : 1;  // 0xC (0xC)
	char bOverride_FilmGrainHighlightsMin : 1;  // 0xD (0xD)
	char bOverride_FilmGrainHighlightsMax : 1;  // 0xD (0xD)
	char bOverride_FilmGrainTexelSize : 1;  // 0xD (0xD)
	char bOverride_FilmGrainTexture : 1;  // 0xD (0xD)
	char bOverride_AmbientOcclusionIntensity : 1;  // 0xD (0xD)
	char bOverride_AmbientOcclusionStaticFraction : 1;  // 0xD (0xD)
	char bOverride_AmbientOcclusionRadius : 1;  // 0xD (0xD)
	char bOverride_AmbientOcclusionFadeDistance : 1;  // 0xD (0xD)
	char bOverride_AmbientOcclusionFadeRadius : 1;  // 0xE (0xE)
	char bOverride_AmbientOcclusionDistance : 1;  // 0xE (0xE)
	char bOverride_AmbientOcclusionRadiusInWS : 1;  // 0xE (0xE)
	char bOverride_AmbientOcclusionPower : 1;  // 0xE (0xE)
	char bOverride_AmbientOcclusionBias : 1;  // 0xE (0xE)
	char bOverride_AmbientOcclusionQuality : 1;  // 0xE (0xE)
	char bOverride_AmbientOcclusionMipBlend : 1;  // 0xE (0xE)
	char bOverride_AmbientOcclusionMipScale : 1;  // 0xE (0xE)
	char bOverride_AmbientOcclusionMipThreshold : 1;  // 0xF (0xF)
	char bOverride_AmbientOcclusionTemporalBlendWeight : 1;  // 0xF (0xF)
	char pad_15_1 : 6;  // 0xF (0xF)
	char bOverride_RayTracingAO : 1;  // 0x10 (0x10)
	char bOverride_RayTracingAOSamplesPerPixel : 1;  // 0x10 (0x10)
	char bOverride_RayTracingAOIntensity : 1;  // 0x10 (0x10)
	char bOverride_RayTracingAORadius : 1;  // 0x10 (0x10)
	char pad_16_1 : 4;  // 0x10 (0x10)
	char pad_17[4];  // 0x11 (0x11)
	char bOverride_LPVIntensity : 1;  // 0x14 (0x14)
	char bOverride_LPVDirectionalOcclusionIntensity : 1;  // 0x14 (0x14)
	char bOverride_LPVDirectionalOcclusionRadius : 1;  // 0x14 (0x14)
	char bOverride_LPVDiffuseOcclusionExponent : 1;  // 0x14 (0x14)
	char bOverride_LPVSpecularOcclusionExponent : 1;  // 0x14 (0x14)
	char bOverride_LPVDiffuseOcclusionIntensity : 1;  // 0x14 (0x14)
	char bOverride_LPVSpecularOcclusionIntensity : 1;  // 0x14 (0x14)
	char bOverride_LPVSize : 1;  // 0x14 (0x14)
	char bOverride_LPVSecondaryOcclusionIntensity : 1;  // 0x15 (0x15)
	char bOverride_LPVSecondaryBounceIntensity : 1;  // 0x15 (0x15)
	char bOverride_LPVGeometryVolumeBias : 1;  // 0x15 (0x15)
	char bOverride_LPVVplInjectionBias : 1;  // 0x15 (0x15)
	char bOverride_LPVEmissiveInjectionIntensity : 1;  // 0x15 (0x15)
	char bOverride_LPVFadeRange : 1;  // 0x15 (0x15)
	char bOverride_LPVDirectionalOcclusionFadeRange : 1;  // 0x15 (0x15)
	char bOverride_IndirectLightingColor : 1;  // 0x15 (0x15)
	char bOverride_IndirectLightingIntensity : 1;  // 0x16 (0x16)
	char bOverride_ColorGradingIntensity : 1;  // 0x16 (0x16)
	char bOverride_ColorGradingLUT : 1;  // 0x16 (0x16)
	char bOverride_DepthOfFieldFocalDistance : 1;  // 0x16 (0x16)
	char bOverride_DepthOfFieldFstop : 1;  // 0x16 (0x16)
	char bOverride_DepthOfFieldMinFstop : 1;  // 0x16 (0x16)
	char bOverride_DepthOfFieldBladeCount : 1;  // 0x16 (0x16)
	char bOverride_DepthOfFieldSensorWidth : 1;  // 0x16 (0x16)
	char bOverride_DepthOfFieldSqueezeFactor : 1;  // 0x17 (0x17)
	char bOverride_DepthOfFieldDepthBlurRadius : 1;  // 0x17 (0x17)
	char bOverride_DepthOfFieldDepthBlurAmount : 1;  // 0x17 (0x17)
	char bOverride_DepthOfFieldFocalRegion : 1;  // 0x17 (0x17)
	char bOverride_DepthOfFieldNearTransitionRegion : 1;  // 0x17 (0x17)
	char bOverride_DepthOfFieldFarTransitionRegion : 1;  // 0x17 (0x17)
	char bOverride_DepthOfFieldScale : 1;  // 0x17 (0x17)
	char bOverride_DepthOfFieldNearBlurSize : 1;  // 0x17 (0x17)
	char bOverride_DepthOfFieldFarBlurSize : 1;  // 0x18 (0x18)
	char bOverride_MobileHQGaussian : 1;  // 0x18 (0x18)
	char bOverride_DepthOfFieldOcclusion : 1;  // 0x18 (0x18)
	char bOverride_DepthOfFieldSkyFocusDistance : 1;  // 0x18 (0x18)
	char bOverride_DepthOfFieldVignetteSize : 1;  // 0x18 (0x18)
	char bOverride_MotionBlurAmount : 1;  // 0x18 (0x18)
	char bOverride_MotionBlurMax : 1;  // 0x18 (0x18)
	char bOverride_MotionBlurTargetFPS : 1;  // 0x18 (0x18)
	char bOverride_MotionBlurPerObjectSize : 1;  // 0x19 (0x19)
	char bOverride_ScreenPercentage : 1;  // 0x19 (0x19)
	char bOverride_ReflectionMethod : 1;  // 0x19 (0x19)
	char bOverride_LumenReflectionQuality : 1;  // 0x19 (0x19)
	char bOverride_ScreenSpaceReflectionIntensity : 1;  // 0x19 (0x19)
	char bOverride_ScreenSpaceReflectionQuality : 1;  // 0x19 (0x19)
	char bOverride_ScreenSpaceReflectionMaxRoughness : 1;  // 0x19 (0x19)
	char bOverride_ScreenSpaceReflectionRoughnessScale : 1;  // 0x19 (0x19)
	char pad_26[2];  // 0x1A (0x1A)
	char bOverride_ReflectionsType : 1;  // 0x1C (0x1C)
	char bOverride_RayTracingReflectionsMaxRoughness : 1;  // 0x1C (0x1C)
	char bOverride_RayTracingReflectionsMaxBounces : 1;  // 0x1C (0x1C)
	char bOverride_RayTracingReflectionsSamplesPerPixel : 1;  // 0x1C (0x1C)
	char bOverride_RayTracingReflectionsShadows : 1;  // 0x1C (0x1C)
	char bOverride_RayTracingReflectionsTranslucency : 1;  // 0x1C (0x1C)
	char bOverride_TranslucencyType : 1;  // 0x1C (0x1C)
	char bOverride_RayTracingTranslucencyMaxRoughness : 1;  // 0x1C (0x1C)
	char bOverride_RayTracingTranslucencyRefractionRays : 1;  // 0x1D (0x1D)
	char bOverride_RayTracingTranslucencySamplesPerPixel : 1;  // 0x1D (0x1D)
	char bOverride_RayTracingTranslucencyShadows : 1;  // 0x1D (0x1D)
	char bOverride_RayTracingTranslucencyRefraction : 1;  // 0x1D (0x1D)
	char bOverride_DynamicGlobalIlluminationMethod : 1;  // 0x1D (0x1D)
	char bOverride_LumenSceneLightingQuality : 1;  // 0x1D (0x1D)
	char bOverride_LumenSceneDetail : 1;  // 0x1D (0x1D)
	char bOverride_LumenSceneViewDistance : 1;  // 0x1D (0x1D)
	char bOverride_LumenSceneLightingUpdateSpeed : 1;  // 0x1E (0x1E)
	char bOverride_LumenFinalGatherQuality : 1;  // 0x1E (0x1E)
	char bOverride_LumenFinalGatherLightingUpdateSpeed : 1;  // 0x1E (0x1E)
	char bOverride_LumenMaxTraceDistance : 1;  // 0x1E (0x1E)
	char bOverride_LumenDiffuseColorBoost : 1;  // 0x1E (0x1E)
	char bOverride_LumenSkylightLeaking : 1;  // 0x1E (0x1E)
	char bOverride_LumenFullSkylightLeakingDistance : 1;  // 0x1E (0x1E)
	char pad_30_1 : 1;  // 0x1E (0x1E)
	char pad_31[2];  // 0x1F (0x1F)
	char bOverride_LumenRayLightingMode : 1;  // 0x20 (0x20)
	char bOverride_LumenFrontLayerTranslucencyReflections : 1;  // 0x20 (0x20)
	char bOverride_LumenSurfaceCacheResolution : 1;  // 0x20 (0x20)
	char pad_32_1 : 5;  // 0x20 (0x20)
	char pad_33[4];  // 0x21 (0x21)
	char bOverride_RayTracingGI : 1;  // 0x24 (0x24)
	char bOverride_RayTracingGIMaxBounces : 1;  // 0x24 (0x24)
	char bOverride_RayTracingGISamplesPerPixel : 1;  // 0x24 (0x24)
	char bOverride_PathTracingMaxBounces : 1;  // 0x24 (0x24)
	char bOverride_PathTracingSamplesPerPixel : 1;  // 0x24 (0x24)
	char bOverride_PathTracingFilterWidth : 1;  // 0x24 (0x24)
	char bOverride_PathTracingEnableEmissive : 1;  // 0x24 (0x24)
	char bOverride_PathTracingMaxPathExposure : 1;  // 0x24 (0x24)
	char bOverride_PathTracingEnableReferenceDOF : 1;  // 0x25 (0x25)
	char bOverride_PathTracingEnableReferenceAtmosphere : 1;  // 0x25 (0x25)
	char bOverride_PathTracingEnableDenoiser : 1;  // 0x25 (0x25)
	char pad_37_1 : 5;  // 0x25 (0x25)
	char pad_38[3];  // 0x26 (0x26)
	char bMobileHQGaussian : 1;  // 0x28 (0x28)
	char pad_40_1 : 7;  // 0x28 (0x28)
	enum class EBloomMethod BloomMethod;  // 0x29 (0x29)
	enum class EAutoExposureMethod AutoExposureMethod;  // 0x2A (0x2A)
	enum class ETemperatureMethod TemperatureType;  // 0x2B (0x2B)
	float WhiteTemp;  // 0x2C (0x2C)
	float WhiteTint;  // 0x30 (0x30)
	char pad_52[12];  // 0x34 (0x34)
	struct FVector4 ColorSaturation;  // 0x40 (0x40)
	struct FVector4 ColorContrast;  // 0x60 (0x60)
	struct FVector4 ColorGamma;  // 0x80 (0x80)
	struct FVector4 ColorGain;  // 0xA0 (0xA0)
	struct FVector4 ColorOffset;  // 0xC0 (0xC0)
	struct FVector4 ColorSaturationShadows;  // 0xE0 (0xE0)
	struct FVector4 ColorContrastShadows;  // 0x100 (0x100)
	struct FVector4 ColorGammaShadows;  // 0x120 (0x120)
	struct FVector4 ColorGainShadows;  // 0x140 (0x140)
	struct FVector4 ColorOffsetShadows;  // 0x160 (0x160)
	struct FVector4 ColorSaturationMidtones;  // 0x180 (0x180)
	struct FVector4 ColorContrastMidtones;  // 0x1A0 (0x1A0)
	struct FVector4 ColorGammaMidtones;  // 0x1C0 (0x1C0)
	struct FVector4 ColorGainMidtones;  // 0x1E0 (0x1E0)
	struct FVector4 ColorOffsetMidtones;  // 0x200 (0x200)
	struct FVector4 ColorSaturationHighlights;  // 0x220 (0x220)
	struct FVector4 ColorContrastHighlights;  // 0x240 (0x240)
	struct FVector4 ColorGammaHighlights;  // 0x260 (0x260)
	struct FVector4 ColorGainHighlights;  // 0x280 (0x280)
	struct FVector4 ColorOffsetHighlights;  // 0x2A0 (0x2A0)
	float ColorCorrectionHighlightsMin;  // 0x2C0 (0x2C0)
	float ColorCorrectionHighlightsMax;  // 0x2C4 (0x2C4)
	float ColorCorrectionShadowsMax;  // 0x2C8 (0x2C8)
	float BlueCorrection;  // 0x2CC (0x2CC)
	float ExpandGamut;  // 0x2D0 (0x2D0)
	float ToneCurveAmount;  // 0x2D4 (0x2D4)
	float FilmSlope;  // 0x2D8 (0x2D8)
	float FilmToe;  // 0x2DC (0x2DC)
	float FilmShoulder;  // 0x2E0 (0x2E0)
	float FilmBlackClip;  // 0x2E4 (0x2E4)
	float FilmWhiteClip;  // 0x2E8 (0x2E8)
	struct FLinearColor SceneColorTint;  // 0x2EC (0x2EC)
	float SceneFringeIntensity;  // 0x2FC (0x2FC)
	float ChromaticAberrationStartOffset;  // 0x300 (0x300)
	float BloomIntensity;  // 0x304 (0x304)
	float BloomThreshold;  // 0x308 (0x308)
	float BloomSizeScale;  // 0x30C (0x30C)
	float Bloom1Size;  // 0x310 (0x310)
	float Bloom2Size;  // 0x314 (0x314)
	float Bloom3Size;  // 0x318 (0x318)
	float Bloom4Size;  // 0x31C (0x31C)
	float Bloom5Size;  // 0x320 (0x320)
	float Bloom6Size;  // 0x324 (0x324)
	struct FLinearColor Bloom1Tint;  // 0x328 (0x328)
	struct FLinearColor Bloom2Tint;  // 0x338 (0x338)
	struct FLinearColor Bloom3Tint;  // 0x348 (0x348)
	struct FLinearColor Bloom4Tint;  // 0x358 (0x358)
	struct FLinearColor Bloom5Tint;  // 0x368 (0x368)
	struct FLinearColor Bloom6Tint;  // 0x378 (0x378)
	float BloomConvolutionScatterDispersion;  // 0x388 (0x388)
	float BloomConvolutionSize;  // 0x38C (0x38C)
	struct UTexture2D* BloomConvolutionTexture;  // 0x390 (0x390)
	struct FVector2D BloomConvolutionCenterUV;  // 0x398 (0x398)
	float BloomConvolutionPreFilterMin;  // 0x3A8 (0x3A8)
	float BloomConvolutionPreFilterMax;  // 0x3AC (0x3AC)
	float BloomConvolutionPreFilterMult;  // 0x3B0 (0x3B0)
	float BloomConvolutionBufferScale;  // 0x3B4 (0x3B4)
	struct UTexture* BloomDirtMask;  // 0x3B8 (0x3B8)
	float BloomDirtMaskIntensity;  // 0x3C0 (0x3C0)
	struct FLinearColor BloomDirtMaskTint;  // 0x3C4 (0x3C4)
	enum class EDynamicGlobalIlluminationMethod DynamicGlobalIlluminationMethod;  // 0x3D4 (0x3D4)
	char pad_981[3];  // 0x3D5 (0x3D5)
	struct FLinearColor IndirectLightingColor;  // 0x3D8 (0x3D8)
	float IndirectLightingIntensity;  // 0x3E8 (0x3E8)
	float LumenSceneLightingQuality;  // 0x3EC (0x3EC)
	float LumenSceneDetail;  // 0x3F0 (0x3F0)
	float LumenSceneViewDistance;  // 0x3F4 (0x3F4)
	float LumenSceneLightingUpdateSpeed;  // 0x3F8 (0x3F8)
	float LumenFinalGatherQuality;  // 0x3FC (0x3FC)
	float LumenFinalGatherLightingUpdateSpeed;  // 0x400 (0x400)
	float LumenMaxTraceDistance;  // 0x404 (0x404)
	float LumenDiffuseColorBoost;  // 0x408 (0x408)
	float LumenSkylightLeaking;  // 0x40C (0x40C)
	float LumenFullSkylightLeakingDistance;  // 0x410 (0x410)
	float LumenSurfaceCacheResolution;  // 0x414 (0x414)
	uint8_t RayTracingGIType;  // 0x418 (0x418)
	char pad_1049[3];  // 0x419 (0x419)
	int32_t RayTracingGIMaxBounces;  // 0x41C (0x41C)
	int32_t RayTracingGISamplesPerPixel;  // 0x420 (0x420)
	enum class EReflectionMethod ReflectionMethod;  // 0x424 (0x424)
	uint8_t ReflectionsType;  // 0x425 (0x425)
	char pad_1062[2];  // 0x426 (0x426)
	float LumenReflectionQuality;  // 0x428 (0x428)
	uint8_t LumenRayLightingMode;  // 0x42C (0x42C)
	char LumenFrontLayerTranslucencyReflections : 1;  // 0x42D (0x42D)
	char pad_1069_1 : 7;  // 0x42D (0x42D)
	char pad_1070[3];  // 0x42E (0x42E)
	float ScreenSpaceReflectionIntensity;  // 0x430 (0x430)
	float ScreenSpaceReflectionQuality;  // 0x434 (0x434)
	float ScreenSpaceReflectionMaxRoughness;  // 0x438 (0x438)
	float RayTracingReflectionsMaxRoughness;  // 0x43C (0x43C)
	int32_t RayTracingReflectionsMaxBounces;  // 0x440 (0x440)
	int32_t RayTracingReflectionsSamplesPerPixel;  // 0x444 (0x444)
	uint8_t RayTracingReflectionsShadows;  // 0x448 (0x448)
	char RayTracingReflectionsTranslucency : 1;  // 0x449 (0x449)
	char pad_1097_1 : 7;  // 0x449 (0x449)
	char pad_1098[3];  // 0x44A (0x44A)
	struct FLinearColor AmbientCubemapTint;  // 0x44C (0x44C)
	float AmbientCubemapIntensity;  // 0x45C (0x45C)
	struct UTextureCube* AmbientCubemap;  // 0x460 (0x460)
	float CameraShutterSpeed;  // 0x468 (0x468)
	float CameraISO;  // 0x46C (0x46C)
	float DepthOfFieldFstop;  // 0x470 (0x470)
	float DepthOfFieldMinFstop;  // 0x474 (0x474)
	int32_t DepthOfFieldBladeCount;  // 0x478 (0x478)
	float AutoExposureBias;  // 0x47C (0x47C)
	float AutoExposureBiasBackup;  // 0x480 (0x480)
	char bOverride_AutoExposureBiasBackup : 1;  // 0x484 (0x484)
	char pad_1156_1 : 7;  // 0x484 (0x484)
	char pad_1157[4];  // 0x485 (0x485)
	char AutoExposureApplyPhysicalCameraExposure : 1;  // 0x488 (0x488)
	char pad_1160_1 : 7;  // 0x488 (0x488)
	char pad_1161[8];  // 0x489 (0x489)
	struct UCurveFloat* AutoExposureBiasCurve;  // 0x490 (0x490)
	struct UTexture* AutoExposureMeterMask;  // 0x498 (0x498)
	float AutoExposureLowPercent;  // 0x4A0 (0x4A0)
	float AutoExposureHighPercent;  // 0x4A4 (0x4A4)
	float AutoExposureMinBrightness;  // 0x4A8 (0x4A8)
	float AutoExposureMaxBrightness;  // 0x4AC (0x4AC)
	float AutoExposureSpeedUp;  // 0x4B0 (0x4B0)
	float AutoExposureSpeedDown;  // 0x4B4 (0x4B4)
	float HistogramLogMin;  // 0x4B8 (0x4B8)
	float HistogramLogMax;  // 0x4BC (0x4BC)
	float AutoExposureCalibrationConstant;  // 0x4C0 (0x4C0)
	float LocalExposureContrastScale;  // 0x4C4 (0x4C4)
	float LocalExposureHighlightContrastScale;  // 0x4C8 (0x4C8)
	float LocalExposureShadowContrastScale;  // 0x4CC (0x4CC)
	float LocalExposureDetailStrength;  // 0x4D0 (0x4D0)
	float LocalExposureBlurredLuminanceBlend;  // 0x4D4 (0x4D4)
	float LocalExposureBlurredLuminanceKernelSizePercent;  // 0x4D8 (0x4D8)
	float LocalExposureMiddleGreyBias;  // 0x4DC (0x4DC)
	float LensFlareIntensity;  // 0x4E0 (0x4E0)
	struct FLinearColor LensFlareTint;  // 0x4E4 (0x4E4)
	float LensFlareBokehSize;  // 0x4F4 (0x4F4)
	float LensFlareThreshold;  // 0x4F8 (0x4F8)
	char pad_1276[4];  // 0x4FC (0x4FC)
	struct UTexture* LensFlareBokehShape;  // 0x500 (0x500)
	struct FLinearColor LensFlareTints[8];  // 0x508 (0x508)
	float VignetteIntensity;  // 0x588 (0x588)
	float GrainJitter;  // 0x58C (0x58C)
	float GrainIntensity;  // 0x590 (0x590)
	float FilmGrainIntensity;  // 0x594 (0x594)
	float FilmGrainIntensityShadows;  // 0x598 (0x598)
	float FilmGrainIntensityMidtones;  // 0x59C (0x59C)
	float FilmGrainIntensityHighlights;  // 0x5A0 (0x5A0)
	float FilmGrainShadowsMax;  // 0x5A4 (0x5A4)
	float FilmGrainHighlightsMin;  // 0x5A8 (0x5A8)
	float FilmGrainHighlightsMax;  // 0x5AC (0x5AC)
	float FilmGrainTexelSize;  // 0x5B0 (0x5B0)
	char pad_1460[4];  // 0x5B4 (0x5B4)
	struct UTexture2D* FilmGrainTexture;  // 0x5B8 (0x5B8)
	float AmbientOcclusionIntensity;  // 0x5C0 (0x5C0)
	float AmbientOcclusionStaticFraction;  // 0x5C4 (0x5C4)
	float AmbientOcclusionRadius;  // 0x5C8 (0x5C8)
	char AmbientOcclusionRadiusInWS : 1;  // 0x5CC (0x5CC)
	char pad_1484_1 : 7;  // 0x5CC (0x5CC)
	char pad_1485[4];  // 0x5CD (0x5CD)
	float AmbientOcclusionFadeDistance;  // 0x5D0 (0x5D0)
	float AmbientOcclusionFadeRadius;  // 0x5D4 (0x5D4)
	float AmbientOcclusionDistance;  // 0x5D8 (0x5D8)
	float AmbientOcclusionPower;  // 0x5DC (0x5DC)
	float AmbientOcclusionBias;  // 0x5E0 (0x5E0)
	float AmbientOcclusionQuality;  // 0x5E4 (0x5E4)
	float AmbientOcclusionMipBlend;  // 0x5E8 (0x5E8)
	float AmbientOcclusionMipScale;  // 0x5EC (0x5EC)
	float AmbientOcclusionMipThreshold;  // 0x5F0 (0x5F0)
	float AmbientOcclusionTemporalBlendWeight;  // 0x5F4 (0x5F4)
	char RayTracingAO : 1;  // 0x5F8 (0x5F8)
	char pad_1528_1 : 7;  // 0x5F8 (0x5F8)
	char pad_1529[4];  // 0x5F9 (0x5F9)
	int32_t RayTracingAOSamplesPerPixel;  // 0x5FC (0x5FC)
	float RayTracingAOIntensity;  // 0x600 (0x600)
	float RayTracingAORadius;  // 0x604 (0x604)
	float ColorGradingIntensity;  // 0x608 (0x608)
	char pad_1548[4];  // 0x60C (0x60C)
	struct UTexture* ColorGradingLUT;  // 0x610 (0x610)
	float DepthOfFieldSensorWidth;  // 0x618 (0x618)
	float DepthOfFieldSqueezeFactor;  // 0x61C (0x61C)
	float DepthOfFieldFocalDistance;  // 0x620 (0x620)
	float DepthOfFieldDepthBlurAmount;  // 0x624 (0x624)
	float DepthOfFieldDepthBlurRadius;  // 0x628 (0x628)
	float DepthOfFieldFocalRegion;  // 0x62C (0x62C)
	float DepthOfFieldNearTransitionRegion;  // 0x630 (0x630)
	float DepthOfFieldFarTransitionRegion;  // 0x634 (0x634)
	float DepthOfFieldScale;  // 0x638 (0x638)
	float DepthOfFieldNearBlurSize;  // 0x63C (0x63C)
	float DepthOfFieldFarBlurSize;  // 0x640 (0x640)
	float DepthOfFieldOcclusion;  // 0x644 (0x644)
	float DepthOfFieldSkyFocusDistance;  // 0x648 (0x648)
	float DepthOfFieldVignetteSize;  // 0x64C (0x64C)
	float MotionBlurAmount;  // 0x650 (0x650)
	float MotionBlurMax;  // 0x654 (0x654)
	int32_t MotionBlurTargetFPS;  // 0x658 (0x658)
	float MotionBlurPerObjectSize;  // 0x65C (0x65C)
	float LPVIntensity;  // 0x660 (0x660)
	float LPVVplInjectionBias;  // 0x664 (0x664)
	float LPVSize;  // 0x668 (0x668)
	float LPVSecondaryOcclusionIntensity;  // 0x66C (0x66C)
	float LPVSecondaryBounceIntensity;  // 0x670 (0x670)
	float LPVGeometryVolumeBias;  // 0x674 (0x674)
	float LPVEmissiveInjectionIntensity;  // 0x678 (0x678)
	float LPVDirectionalOcclusionIntensity;  // 0x67C (0x67C)
	float LPVDirectionalOcclusionRadius;  // 0x680 (0x680)
	float LPVDiffuseOcclusionExponent;  // 0x684 (0x684)
	float LPVSpecularOcclusionExponent;  // 0x688 (0x688)
	float LPVDiffuseOcclusionIntensity;  // 0x68C (0x68C)
	float LPVSpecularOcclusionIntensity;  // 0x690 (0x690)
	uint8_t TranslucencyType;  // 0x694 (0x694)
	char pad_1685[3];  // 0x695 (0x695)
	float RayTracingTranslucencyMaxRoughness;  // 0x698 (0x698)
	int32_t RayTracingTranslucencyRefractionRays;  // 0x69C (0x69C)
	int32_t RayTracingTranslucencySamplesPerPixel;  // 0x6A0 (0x6A0)
	uint8_t RayTracingTranslucencyShadows;  // 0x6A4 (0x6A4)
	char RayTracingTranslucencyRefraction : 1;  // 0x6A5 (0x6A5)
	char pad_1701_1 : 7;  // 0x6A5 (0x6A5)
	char pad_1702[3];  // 0x6A6 (0x6A6)
	int32_t PathTracingMaxBounces;  // 0x6A8 (0x6A8)
	int32_t PathTracingSamplesPerPixel;  // 0x6AC (0x6AC)
	float PathTracingFilterWidth;  // 0x6B0 (0x6B0)
	char PathTracingEnableEmissive : 1;  // 0x6B4 (0x6B4)
	char pad_1716_1 : 7;  // 0x6B4 (0x6B4)
	char pad_1717[4];  // 0x6B5 (0x6B5)
	float PathTracingMaxPathExposure;  // 0x6B8 (0x6B8)
	char PathTracingEnableReferenceDOF : 1;  // 0x6BC (0x6BC)
	char PathTracingEnableReferenceAtmosphere : 1;  // 0x6BC (0x6BC)
	char PathTracingEnableDenoiser : 1;  // 0x6BC (0x6BC)
	char pad_1724_1 : 5;  // 0x6BC (0x6BC)
	char pad_1725[4];  // 0x6BD (0x6BD)
	float LPVFadeRange;  // 0x6C0 (0x6C0)
	float LPVDirectionalOcclusionFadeRange;  // 0x6C4 (0x6C4)
	float ScreenPercentage;  // 0x6C8 (0x6C8)
	char pad_1740[4];  // 0x6CC (0x6CC)
	struct FWeightedBlendables WeightedBlendables;  // 0x6D0 (0x6D0)


}; 
 
 // Function Engine.AudioComponent.SetLowPassFilterEnabled
struct FSetLowPassFilterEnabled
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool InLowPassFilterEnabled : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.LoadAssetClass
struct FLoadAssetClass
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct TSoftClassPtr<UObject> AssetClass;  // 0x8 (0x8)
	struct FDelegate OnLoaded;  // 0x38 (0x38)
	struct FLatentActionInfo LatentInfo;  // 0x48 (0x48)


}; 
 
 // Function Engine.KismetMathLibrary.Vector_GetAbsMin
struct FVector_GetAbsMin
{
	struct FVector A;  // 0x0 (0x0)
	double ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.SplineComponent.GetFloatPropertyAtSplineInputKey
struct FGetFloatPropertyAtSplineInputKey
{
	float InKey;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x4 (0x4)
	float ReturnValue;  // 0xC (0xC)


}; 
 
 // DelegateFunction Engine.InterpToMovementComponent.OnInterpToWaitBeginDelegate__DelegateSignature
struct FOnInterpToWaitBeginDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0 (0x0)
	float Time;  // 0xE8 (0xE8)
	char pad_236[4];  // 0xEC (0xEC)


}; 
 
 // Function Engine.LevelStreaming.IsLevelVisible
struct FIsLevelVisible
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimDataModel.GetNumberOfTransformCurves
struct FGetNumberOfTransformCurves
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.SoundClassProperties
struct FSoundClassProperties
{
	float Volume;  // 0x0 (0x0)
	float Pitch;  // 0x4 (0x4)
	float LowPassFilterFrequency;  // 0x8 (0x8)
	float AttenuationDistanceScale;  // 0xC (0xC)
	float LFEBleed;  // 0x10 (0x10)
	float VoiceCenterChannelVolume;  // 0x14 (0x14)
	float RadioFilterVolume;  // 0x18 (0x18)
	float RadioFilterVolumeThreshold;  // 0x1C (0x1C)
	char bApplyEffects : 1;  // 0x20 (0x20)
	char bAlwaysPlay : 1;  // 0x20 (0x20)
	char bIsUISound : 1;  // 0x20 (0x20)
	char bIsMusic : 1;  // 0x20 (0x20)
	char bCenterChannelOnly : 1;  // 0x20 (0x20)
	char bApplyAmbientVolumes : 1;  // 0x20 (0x20)
	char bReverb : 1;  // 0x20 (0x20)
	char pad_32_1 : 1;  // 0x20 (0x20)
	char pad_33[4];  // 0x21 (0x21)
	float Default2DReverbSendAmount;  // 0x24 (0x24)
	struct FSoundModulationDefaultSettings ModulationSettings;  // 0x28 (0x28)
	enum class EAudioOutputTarget OutputTarget;  // 0x1A8 (0x1A8)
	uint8_t LoadingBehavior;  // 0x1A9 (0x1A9)
	char pad_426[6];  // 0x1AA (0x1AA)
	struct USoundSubmix* DefaultSubmix;  // 0x1B0 (0x1B0)


}; 
 
 // Function Engine.SkeletalMeshComponent.GetPostProcessInstance
struct FGetPostProcessInstance
{
	struct UAnimInstance* ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.EdGraphSchemaAction
struct FEdGraphSchemaAction
{
	char pad_0[8];  // 0x0 (0x0)
	struct FText MenuDescription;  // 0x8 (0x8)
	struct FText TooltipDescription;  // 0x20 (0x20)
	struct FText Category;  // 0x38 (0x38)
	struct FText Keywords;  // 0x50 (0x50)
	int32_t Grouping;  // 0x68 (0x68)
	int32_t SectionID;  // 0x6C (0x6C)
	struct TArray<struct FString> MenuDescriptionArray;  // 0x70 (0x70)
	struct TArray<struct FString> FullSearchTitlesArray;  // 0x80 (0x80)
	struct TArray<struct FString> FullSearchKeywordsArray;  // 0x90 (0x90)
	struct TArray<struct FString> FullSearchCategoryArray;  // 0xA0 (0xA0)
	struct TArray<struct FString> LocalizedMenuDescriptionArray;  // 0xB0 (0xB0)
	struct TArray<struct FString> LocalizedFullSearchTitlesArray;  // 0xC0 (0xC0)
	struct TArray<struct FString> LocalizedFullSearchKeywordsArray;  // 0xD0 (0xD0)
	struct TArray<struct FString> LocalizedFullSearchCategoryArray;  // 0xE0 (0xE0)
	struct FString SearchText;  // 0xF0 (0xF0)


}; 
 
 // ScriptStruct Engine.AnimSingleNodeInstanceProxy
// Size: 0x980(Inherited: 0x880)
struct FAnimSingleNodeInstanceProxy : FAnimInstanceProxy
{
	char pad_2176[256];  // 0x880 (0x880)


}; 
 
 // Function Engine.GameplayStatics.GetAllActorsOfClassWithTag
struct FGetAllActorsOfClassWithTag
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	AActor* ActorClass;  // 0x8 (0x8)
	struct FName Tag;  // 0x10 (0x10)
	struct TArray<struct AActor*> OutActors;  // 0x18 (0x18)


}; 
 
 // DelegateFunction Engine.InterpToMovementComponent.OnInterpToWaitEndDelegate__DelegateSignature
struct FOnInterpToWaitEndDelegate__DelegateSignature
{
	struct FHitResult ImpactResult;  // 0x0 (0x0)
	float Time;  // 0xE8 (0xE8)
	char pad_236[4];  // 0xEC (0xEC)


}; 
 
 // Function Engine.SceneComponent.K2_AddLocalRotation
struct FK2_AddLocalRotation
{
	struct FRotator DeltaRotation;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bSweep : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FHitResult SweepHitResult;  // 0x20 (0x20)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool bTeleport : 1;  // 0x108 (0x108)
	char pad_265[7];  // 0x109 (0x109)


}; 
 
 // Function Engine.PrimitiveComponent.ScaleByMomentOfInertia
struct FScaleByMomentOfInertia
{
	struct FVector InputVector;  // 0x0 (0x0)
	struct FName BoneName;  // 0x18 (0x18)
	struct FVector ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.CurveLinearColorAtlas.GetCurvePosition
struct FGetCurvePosition
{
	struct UCurveLinearColor* InCurve;  // 0x0 (0x0)
	float Position;  // 0x8 (0x8)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool ReturnValue : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)


}; 
 
 // Function Engine.InterpToMovementComponent.RestartMovement
struct FRestartMovement
{
	float InitialDirection;  // 0x0 (0x0)


}; 
 
 // Function Engine.HUD.GetTextSize
struct FGetTextSize
{
	struct FString Text;  // 0x0 (0x0)
	float OutWidth;  // 0x10 (0x10)
	float OutHeight;  // 0x14 (0x14)
	struct UFont* Font;  // 0x18 (0x18)
	float Scale;  // 0x20 (0x20)
	char pad_36[4];  // 0x24 (0x24)


}; 
 
 // Function Engine.KismetMathLibrary.Add_QuatQuat
struct FAdd_QuatQuat
{
	struct FQuat A;  // 0x0 (0x0)
	struct FQuat B;  // 0x20 (0x20)
	struct FQuat ReturnValue;  // 0x40 (0x40)


}; 
 
 // Function Engine.KismetMathLibrary.GetUpVector
struct FGetUpVector
{
	struct FRotator InRot;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.PhysicsConstraintComponent.SetLinearDriveParams
struct FSetLinearDriveParams
{
	float PositionStrength;  // 0x0 (0x0)
	float VelocityStrength;  // 0x4 (0x4)
	float InForceLimit;  // 0x8 (0x8)


}; 
 
 // Function Engine.PrimitiveComponent.SetCullDistance
struct FSetCullDistance
{
	float NewCullDistance;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetDotProductTo
struct FGetDotProductTo
{
	struct AActor* OtherActor;  // 0x0 (0x0)
	float ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.ProjectileMovementComponent.StopSimulating
struct FStopSimulating
{
	struct FHitResult HitResult;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugLine
struct FDrawDebugLine
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector LineStart;  // 0x8 (0x8)
	struct FVector LineEnd;  // 0x20 (0x20)
	struct FLinearColor LineColor;  // 0x38 (0x38)
	float Duration;  // 0x48 (0x48)
	float Thickness;  // 0x4C (0x4C)


}; 
 
 // ScriptStruct Engine.AnimNotifyQueue
struct FAnimNotifyQueue
{
	char pad_0[16];  // 0x0 (0x0)
	struct TArray<struct FAnimNotifyEventReference> AnimNotifies;  // 0x10 (0x10)
	struct TMap<struct FName, struct FAnimNotifyArray> UnfilteredMontageAnimNotifies;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetMathLibrary.SetQuaternionSpringStateAngularVelocity
struct FSetQuaternionSpringStateAngularVelocity
{
	struct FQuaternionSpringState SpringState;  // 0x0 (0x0)
	struct FVector AngularVelocity;  // 0x40 (0x40)
	char pad_88[8];  // 0x58 (0x58)


}; 
 
 // Function Engine.KismetSystemLibrary.AddFloatHistorySample
struct FAddFloatHistorySample
{
	float Value;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FDebugFloatHistory FloatHistory;  // 0x8 (0x8)
	struct FDebugFloatHistory ReturnValue;  // 0x28 (0x28)


}; 
 
 // Function Engine.AnimNotifyLibrary.NotifyStateReachedEnd
struct FNotifyStateReachedEnd
{
	struct FAnimNotifyEventReference EventReference;  // 0x0 (0x0)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool ReturnValue : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)


}; 
 
 // ScriptStruct Engine.InputScaleBiasClampState
struct FInputScaleBiasClampState
{
	char pad_0[8];  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.PerBoneBlendWeights
struct FPerBoneBlendWeights
{
	struct TArray<struct FPerBoneBlendWeight> BoneBlendWeights;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.DebugFloatHistory
struct FDebugFloatHistory
{
	struct TArray<float> Samples;  // 0x0 (0x0)
	int32_t MaxSamples;  // 0x10 (0x10)
	float MinValue;  // 0x14 (0x14)
	float MaxValue;  // 0x18 (0x18)
	char pad_28_1 : 7;  // 0x1C (0x1C)
	bool bAutoAdjustMinMax : 1;  // 0x1C (0x1C)
	char pad_29[3];  // 0x1D (0x1D)


}; 
 
 // Function Engine.KismetSystemLibrary.ParseParamValue
struct FParseParamValue
{
	struct FString InString;  // 0x0 (0x0)
	struct FString InParam;  // 0x10 (0x10)
	struct FString OutValue;  // 0x20 (0x20)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)


}; 
 
 // Function Engine.KismetSystemLibrary.BeginTransaction
struct FBeginTransaction
{
	struct FString Context;  // 0x0 (0x0)
	struct FText Description;  // 0x10 (0x10)
	struct UObject* PrimaryObject;  // 0x28 (0x28)
	int32_t ReturnValue;  // 0x30 (0x30)
	char pad_52[4];  // 0x34 (0x34)


}; 
 
 // ScriptStruct Engine.ParticleSystemReplayFrame
struct FParticleSystemReplayFrame
{
	char pad_0[16];  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetParentComponent
struct FGetParentComponent
{
	struct UChildActorComponent* ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity
struct FGetPhysicsLinearVelocity
{
	struct FName BoneName;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_GetTimerElapsedTimeDelegate
struct FK2_GetTimerElapsedTimeDelegate
{
	struct FDelegate Delegate;  // 0x0 (0x0)
	float ReturnValue;  // 0x10 (0x10)


}; 
 
 // SparseDelegateFunction Engine.PawnRestartedSignature__DelegateSignature
struct FPawnRestartedSignature__DelegateSignature
{
	struct APawn* Pawn;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.BoxTraceMulti
struct FBoxTraceMulti
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	struct FVector HalfSize;  // 0x38 (0x38)
	struct FRotator Orientation;  // 0x50 (0x50)
	enum class ETraceTypeQuery TraceChannel;  // 0x68 (0x68)
	char pad_105_1 : 7;  // 0x69 (0x69)
	bool bTraceComplex : 1;  // 0x69 (0x69)
	char pad_106[6];  // 0x6A (0x6A)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x70 (0x70)
	enum class EDrawDebugTrace DrawDebugType;  // 0x80 (0x80)
	char pad_129[7];  // 0x81 (0x81)
	struct TArray<struct FHitResult> OutHits;  // 0x88 (0x88)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool bIgnoreSelf : 1;  // 0x98 (0x98)
	char pad_153[3];  // 0x99 (0x99)
	struct FLinearColor TraceColor;  // 0x9C (0x9C)
	struct FLinearColor TraceHitColor;  // 0xAC (0xAC)
	float DrawTime;  // 0xBC (0xBC)
	char pad_192_1 : 7;  // 0xC0 (0xC0)
	bool ReturnValue : 1;  // 0xC0 (0xC0)
	char pad_193[7];  // 0xC1 (0xC1)


}; 
 
 // ScriptStruct Engine.KSphereElem
// Size: 0x50(Inherited: 0x30)
struct FKSphereElem : FKShapeElem
{
	struct FVector Center;  // 0x30 (0x30)
	float Radius;  // 0x48 (0x48)
	char pad_76[4];  // 0x4C (0x4C)


}; 
 
 // Function Engine.KismetSystemLibrary.BoxTraceMultiForObjects
struct FBoxTraceMultiForObjects
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	struct FVector HalfSize;  // 0x38 (0x38)
	struct FRotator Orientation;  // 0x50 (0x50)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x68 (0x68)
	char pad_120_1 : 7;  // 0x78 (0x78)
	bool bTraceComplex : 1;  // 0x78 (0x78)
	char pad_121[7];  // 0x79 (0x79)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x80 (0x80)
	enum class EDrawDebugTrace DrawDebugType;  // 0x90 (0x90)
	char pad_145[7];  // 0x91 (0x91)
	struct TArray<struct FHitResult> OutHits;  // 0x98 (0x98)
	char pad_168_1 : 7;  // 0xA8 (0xA8)
	bool bIgnoreSelf : 1;  // 0xA8 (0xA8)
	char pad_169[3];  // 0xA9 (0xA9)
	struct FLinearColor TraceColor;  // 0xAC (0xAC)
	struct FLinearColor TraceHitColor;  // 0xBC (0xBC)
	float DrawTime;  // 0xCC (0xCC)
	char pad_208_1 : 7;  // 0xD0 (0xD0)
	bool ReturnValue : 1;  // 0xD0 (0xD0)
	char pad_209[7];  // 0xD1 (0xD1)


}; 
 
 // Function Engine.PlayerController.ServerChangeName
struct FServerChangeName
{
	struct FString S;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ComponentSpacePoseLink
// Size: 0x10(Inherited: 0x10)
struct FComponentSpacePoseLink : FPoseLinkBase
{


}; 
 
 // ScriptStruct Engine.BakedFloatCustomAttribute
struct FBakedFloatCustomAttribute
{
	char pad_0[1];  // 0x0 (0x0)


}; 
 
 // Function Engine.LightComponentBase.SetSamplesPerPixel
struct FSetSamplesPerPixel
{
	int32_t NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Vector_ProjectOnToNormal
struct FVector_ProjectOnToNormal
{
	struct FVector V;  // 0x0 (0x0)
	struct FVector InNormal;  // 0x18 (0x18)
	struct FVector ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetRenderingLibrary.CreateRenderTarget2DArray
struct FCreateRenderTarget2DArray
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	int32_t Width;  // 0x8 (0x8)
	int32_t Height;  // 0xC (0xC)
	int32_t Slices;  // 0x10 (0x10)
	enum class ETextureRenderTargetFormat Format;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	struct FLinearColor ClearColor;  // 0x18 (0x18)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool bAutoGenerateMipMaps : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)
	struct UTextureRenderTarget2DArray* ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.GameStateBase.GetPlayerStartTime
struct FGetPlayerStartTime
{
	struct AController* Controller;  // 0x0 (0x0)
	float ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.KismetSystemLibrary.BoxTraceSingle
struct FBoxTraceSingle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	struct FVector HalfSize;  // 0x38 (0x38)
	struct FRotator Orientation;  // 0x50 (0x50)
	enum class ETraceTypeQuery TraceChannel;  // 0x68 (0x68)
	char pad_105_1 : 7;  // 0x69 (0x69)
	bool bTraceComplex : 1;  // 0x69 (0x69)
	char pad_106[6];  // 0x6A (0x6A)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x70 (0x70)
	enum class EDrawDebugTrace DrawDebugType;  // 0x80 (0x80)
	char pad_129[7];  // 0x81 (0x81)
	struct FHitResult OutHit;  // 0x88 (0x88)
	char pad_368_1 : 7;  // 0x170 (0x170)
	bool bIgnoreSelf : 1;  // 0x170 (0x170)
	char pad_369[3];  // 0x171 (0x171)
	struct FLinearColor TraceColor;  // 0x174 (0x174)
	struct FLinearColor TraceHitColor;  // 0x184 (0x184)
	float DrawTime;  // 0x194 (0x194)
	char pad_408_1 : 7;  // 0x198 (0x198)
	bool ReturnValue : 1;  // 0x198 (0x198)
	char pad_409[7];  // 0x199 (0x199)


}; 
 
 // ScriptStruct Engine.BakedIntegerCustomAttribute
struct FBakedIntegerCustomAttribute
{
	char pad_0[1];  // 0x0 (0x0)


}; 
 
 // Function Engine.InputComponent.GetControllerKeyTimeDown
struct FGetControllerKeyTimeDown
{
	struct FKey Key;  // 0x0 (0x0)
	float ReturnValue;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // ScriptStruct Engine.TTVectorTrack
// Size: 0x28(Inherited: 0x20)
struct FTTVectorTrack : FTTPropertyTrack
{
	struct UCurveVector* CurveVector;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetMathLibrary.GetTAU
struct FGetTAU
{
	double ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.BranchFilter
struct FBranchFilter
{
	struct FName BoneName;  // 0x0 (0x0)
	int32_t BlendDepth;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.BoxTraceSingleByProfile
struct FBoxTraceSingleByProfile
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	struct FVector HalfSize;  // 0x38 (0x38)
	struct FRotator Orientation;  // 0x50 (0x50)
	struct FName ProfileName;  // 0x68 (0x68)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool bTraceComplex : 1;  // 0x70 (0x70)
	char pad_113[7];  // 0x71 (0x71)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x78 (0x78)
	enum class EDrawDebugTrace DrawDebugType;  // 0x88 (0x88)
	char pad_137[7];  // 0x89 (0x89)
	struct FHitResult OutHit;  // 0x90 (0x90)
	char pad_376_1 : 7;  // 0x178 (0x178)
	bool bIgnoreSelf : 1;  // 0x178 (0x178)
	char pad_377[3];  // 0x179 (0x179)
	struct FLinearColor TraceColor;  // 0x17C (0x17C)
	struct FLinearColor TraceHitColor;  // 0x18C (0x18C)
	float DrawTime;  // 0x19C (0x19C)
	char pad_416_1 : 7;  // 0x1A0 (0x1A0)
	bool ReturnValue : 1;  // 0x1A0 (0x1A0)
	char pad_417[7];  // 0x1A1 (0x1A1)


}; 
 
 // Function Engine.KismetSystemLibrary.BreakARFilter
struct FBreakARFilter
{
	struct FARFilter InARFilter;  // 0x0 (0x0)
	struct TArray<struct FName> PackageNames;  // 0x150 (0x150)
	struct TArray<struct FName> PackagePaths;  // 0x160 (0x160)
	struct TArray<struct FSoftObjectPath> SoftObjectPaths;  // 0x170 (0x170)
	struct TArray<struct FTopLevelAssetPath> ClassPaths;  // 0x180 (0x180)
	struct TSet<struct FTopLevelAssetPath> RecursiveClassPathsExclusionSet;  // 0x190 (0x190)
	struct TArray<struct FName> ClassNames;  // 0x1E0 (0x1E0)
	struct TSet<struct FName> RecursiveClassesExclusionSet;  // 0x1F0 (0x1F0)
	char pad_576_1 : 7;  // 0x240 (0x240)
	bool bRecursivePaths : 1;  // 0x240 (0x240)
	char pad_577_1 : 7;  // 0x241 (0x241)
	bool bRecursiveClasses : 1;  // 0x241 (0x241)
	char pad_578_1 : 7;  // 0x242 (0x242)
	bool bIncludeOnlyOnDiskAssets : 1;  // 0x242 (0x242)
	char pad_579[5];  // 0x243 (0x243)


}; 
 
 // Function Engine.KismetSystemLibrary.BreakSoftObjectPath
struct FBreakSoftObjectPath
{
	struct FSoftObjectPath InSoftObjectPath;  // 0x0 (0x0)
	struct FString PathString;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetMathLibrary.Vector_BoundedToCube
struct FVector_BoundedToCube
{
	struct FVector InVect;  // 0x0 (0x0)
	float InRadius;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)
	struct FVector ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.SkeletalMesh.FindSocketAndIndex
struct FFindSocketAndIndex
{
	struct FName InSocketName;  // 0x0 (0x0)
	int32_t OutIndex;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct USkeletalMeshSocket* ReturnValue;  // 0x10 (0x10)


}; 
 
 // ScriptStruct Engine.AnimationState
// Size: 0x28(Inherited: 0x8)
struct FAnimationState : FAnimationStateBase
{
	struct TArray<struct FAnimationTransitionRule> Transitions;  // 0x8 (0x8)
	int32_t StateRootNodeIndex;  // 0x18 (0x18)
	int32_t StartNotify;  // 0x1C (0x1C)
	int32_t EndNotify;  // 0x20 (0x20)
	int32_t FullyBlendedNotify;  // 0x24 (0x24)


}; 
 
 // Function Engine.PlayerController.SetName
struct FSetName
{
	struct FString S;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.IsValidSoftClassReference
struct FIsValidSoftClassReference
{
	struct TSoftClassPtr<UObject> SoftClassReference;  // 0x0 (0x0)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)


}; 
 
 // Function Engine.KismetSystemLibrary.NotEqual_PrimaryAssetType
struct FNotEqual_PrimaryAssetType
{
	struct FPrimaryAssetType A;  // 0x0 (0x0)
	struct FPrimaryAssetType B;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)


}; 
 
 // ScriptStruct Engine.HapticFeedbackDetails_Curve
struct FHapticFeedbackDetails_Curve
{
	struct FRuntimeFloatCurve Frequency;  // 0x0 (0x0)
	struct FRuntimeFloatCurve Amplitude;  // 0x88 (0x88)


}; 
 
 // Function Engine.DataTableFunctionLibrary.GetDataTableRowNames
struct FGetDataTableRowNames
{
	struct UDataTable* Table;  // 0x0 (0x0)
	struct TArray<struct FName> OutRowNames;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.BuildPromotionOpenAssetSettings
struct FBuildPromotionOpenAssetSettings
{
	struct FFilePath BlueprintAsset;  // 0x0 (0x0)
	struct FFilePath MaterialAsset;  // 0x10 (0x10)
	struct FFilePath ParticleSystemAsset;  // 0x20 (0x20)
	struct FFilePath SkeletalMeshAsset;  // 0x30 (0x30)
	struct FFilePath StaticMeshAsset;  // 0x40 (0x40)
	struct FFilePath TextureAsset;  // 0x50 (0x50)


}; 
 
 // Function Engine.KismetSystemLibrary.CancelTransaction
struct FCancelTransaction
{
	int32_t Index;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.CapsuleOverlapActors
struct FCapsuleOverlapActors
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector CapsulePos;  // 0x8 (0x8)
	float Radius;  // 0x20 (0x20)
	float HalfHeight;  // 0x24 (0x24)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x28 (0x28)
	UObject* ActorClassFilter;  // 0x38 (0x38)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x40 (0x40)
	struct TArray<struct AActor*> OutActors;  // 0x50 (0x50)
	char pad_96_1 : 7;  // 0x60 (0x60)
	bool ReturnValue : 1;  // 0x60 (0x60)
	char pad_97[7];  // 0x61 (0x61)


}; 
 
 // Function Engine.AnimationDataController.InsertBoneTrack
struct FInsertBoneTrack
{
	struct FName BoneName;  // 0x0 (0x0)
	int32_t DesiredIndex;  // 0x8 (0x8)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool bShouldTransact : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)
	int32_t ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees
struct FSetPhysicsMaxAngularVelocityInDegrees
{
	float NewMaxAngVel;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool bAddToCurrent : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FName BoneName;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.IsValidSoftObjectReference
struct FIsValidSoftObjectReference
{
	struct TSoftObjectPtr<UObject> SoftObjectReference;  // 0x0 (0x0)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)


}; 
 
 // Function Engine.GameModeBase.GetNumSpectators
struct FGetNumSpectators
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.DirectionalLightComponent.SetLightSourceSoftAngle
struct FSetLightSourceSoftAngle
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.CapsuleOverlapComponents
struct FCapsuleOverlapComponents
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector CapsulePos;  // 0x8 (0x8)
	float Radius;  // 0x20 (0x20)
	float HalfHeight;  // 0x24 (0x24)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x28 (0x28)
	UObject* ComponentClassFilter;  // 0x38 (0x38)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x40 (0x40)
	struct TArray<struct UPrimitiveComponent*> OutComponents;  // 0x50 (0x50)
	char pad_96_1 : 7;  // 0x60 (0x60)
	bool ReturnValue : 1;  // 0x60 (0x60)
	char pad_97[7];  // 0x61 (0x61)


}; 
 
 // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag
struct FGetLinkedAnimGraphInstancesByTag
{
	struct FName InTag;  // 0x0 (0x0)
	struct TArray<struct UAnimInstance*> OutLinkedInstances;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.CapsuleTraceMulti
struct FCapsuleTraceMulti
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	float HalfHeight;  // 0x3C (0x3C)
	enum class ETraceTypeQuery TraceChannel;  // 0x40 (0x40)
	char pad_65_1 : 7;  // 0x41 (0x41)
	bool bTraceComplex : 1;  // 0x41 (0x41)
	char pad_66[6];  // 0x42 (0x42)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x48 (0x48)
	enum class EDrawDebugTrace DrawDebugType;  // 0x58 (0x58)
	char pad_89[7];  // 0x59 (0x59)
	struct TArray<struct FHitResult> OutHits;  // 0x60 (0x60)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool bIgnoreSelf : 1;  // 0x70 (0x70)
	char pad_113[3];  // 0x71 (0x71)
	struct FLinearColor TraceColor;  // 0x74 (0x74)
	struct FLinearColor TraceHitColor;  // 0x84 (0x84)
	float DrawTime;  // 0x94 (0x94)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool ReturnValue : 1;  // 0x98 (0x98)
	char pad_153[7];  // 0x99 (0x99)


}; 
 
 // ScriptStruct Engine.SoundWaveEnvelopeTimeData
struct FSoundWaveEnvelopeTimeData
{
	float Amplitude;  // 0x0 (0x0)
	float TimeSec;  // 0x4 (0x4)


}; 
 
 // Function Engine.SkyAtmosphereComponent.GetAtmosphereTransmitanceOnGroundAtPlanetTop
struct FGetAtmosphereTransmitanceOnGroundAtPlanetTop
{
	struct UDirectionalLightComponent* DirectionalLight;  // 0x0 (0x0)
	struct FLinearColor ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.CapsuleTraceMultiByProfile
struct FCapsuleTraceMultiByProfile
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	float HalfHeight;  // 0x3C (0x3C)
	struct FName ProfileName;  // 0x40 (0x40)
	char pad_72_1 : 7;  // 0x48 (0x48)
	bool bTraceComplex : 1;  // 0x48 (0x48)
	char pad_73[7];  // 0x49 (0x49)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x50 (0x50)
	enum class EDrawDebugTrace DrawDebugType;  // 0x60 (0x60)
	char pad_97[7];  // 0x61 (0x61)
	struct TArray<struct FHitResult> OutHits;  // 0x68 (0x68)
	char pad_120_1 : 7;  // 0x78 (0x78)
	bool bIgnoreSelf : 1;  // 0x78 (0x78)
	char pad_121[3];  // 0x79 (0x79)
	struct FLinearColor TraceColor;  // 0x7C (0x7C)
	struct FLinearColor TraceHitColor;  // 0x8C (0x8C)
	float DrawTime;  // 0x9C (0x9C)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool ReturnValue : 1;  // 0xA0 (0xA0)
	char pad_161[7];  // 0xA1 (0xA1)


}; 
 
 // ScriptStruct Engine.InputAxisConfigEntry
struct FInputAxisConfigEntry
{
	struct FName AxisKeyName;  // 0x0 (0x0)
	struct FInputAxisProperties AxisProperties;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.WeightedMovingAverage_Float
struct FWeightedMovingAverage_Float
{
	float CurrentSample;  // 0x0 (0x0)
	float PreviousSample;  // 0x4 (0x4)
	float Weight;  // 0x8 (0x8)
	float ReturnValue;  // 0xC (0xC)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugPoint
struct FDrawDebugPoint
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Position;  // 0x8 (0x8)
	float Size;  // 0x20 (0x20)
	struct FLinearColor PointColor;  // 0x24 (0x24)
	float Duration;  // 0x34 (0x34)


}; 
 
 // Function Engine.PrimitiveComponent.SetMassScale
struct FSetMassScale
{
	struct FName BoneName;  // 0x0 (0x0)
	float InMassScale;  // 0x8 (0x8)


}; 
 
 // Function Engine.SkeletalMeshComponent.BreakConstraint
struct FBreakConstraint
{
	struct FVector Impulse;  // 0x0 (0x0)
	struct FVector HitLocation;  // 0x18 (0x18)
	struct FName InBoneName;  // 0x30 (0x30)


}; 
 
 // Function Engine.WorldPartitionBlueprintLibrary.LoadActors
struct FLoadActors
{
	struct TArray<struct FGuid> InActorsToLoad;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.PlatformGameInstance.PlatformRegisteredForRemoteNotificationsDelegate__DelegateSignature
struct FPlatformRegisteredForRemoteNotificationsDelegate__DelegateSignature
{
	struct TArray<char> inArray;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.LaunchURL
struct FLaunchURL
{
	struct FString URL;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.CapsuleTraceMultiForObjects
struct FCapsuleTraceMultiForObjects
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	float HalfHeight;  // 0x3C (0x3C)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x40 (0x40)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool bTraceComplex : 1;  // 0x50 (0x50)
	char pad_81[7];  // 0x51 (0x51)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x58 (0x58)
	enum class EDrawDebugTrace DrawDebugType;  // 0x68 (0x68)
	char pad_105[7];  // 0x69 (0x69)
	struct TArray<struct FHitResult> OutHits;  // 0x70 (0x70)
	char pad_128_1 : 7;  // 0x80 (0x80)
	bool bIgnoreSelf : 1;  // 0x80 (0x80)
	char pad_129[3];  // 0x81 (0x81)
	struct FLinearColor TraceColor;  // 0x84 (0x84)
	struct FLinearColor TraceHitColor;  // 0x94 (0x94)
	float DrawTime;  // 0xA4 (0xA4)
	char pad_168_1 : 7;  // 0xA8 (0xA8)
	bool ReturnValue : 1;  // 0xA8 (0xA8)
	char pad_169[7];  // 0xA9 (0xA9)


}; 
 
 // ScriptStruct Engine.CanvasUVTri
struct FCanvasUVTri
{
	struct FVector2D V0_Pos;  // 0x0 (0x0)
	struct FVector2D V0_UV;  // 0x10 (0x10)
	struct FLinearColor V0_Color;  // 0x20 (0x20)
	struct FVector2D V1_Pos;  // 0x30 (0x30)
	struct FVector2D V1_UV;  // 0x40 (0x40)
	struct FLinearColor V1_Color;  // 0x50 (0x50)
	struct FVector2D V2_Pos;  // 0x60 (0x60)
	struct FVector2D V2_UV;  // 0x70 (0x70)
	struct FLinearColor V2_Color;  // 0x80 (0x80)


}; 
 
 // Function Engine.KismetSystemLibrary.CapsuleTraceSingle
struct FCapsuleTraceSingle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	float HalfHeight;  // 0x3C (0x3C)
	enum class ETraceTypeQuery TraceChannel;  // 0x40 (0x40)
	char pad_65_1 : 7;  // 0x41 (0x41)
	bool bTraceComplex : 1;  // 0x41 (0x41)
	char pad_66[6];  // 0x42 (0x42)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x48 (0x48)
	enum class EDrawDebugTrace DrawDebugType;  // 0x58 (0x58)
	char pad_89[7];  // 0x59 (0x59)
	struct FHitResult OutHit;  // 0x60 (0x60)
	char pad_328_1 : 7;  // 0x148 (0x148)
	bool bIgnoreSelf : 1;  // 0x148 (0x148)
	char pad_329[3];  // 0x149 (0x149)
	struct FLinearColor TraceColor;  // 0x14C (0x14C)
	struct FLinearColor TraceHitColor;  // 0x15C (0x15C)
	float DrawTime;  // 0x16C (0x16C)
	char pad_368_1 : 7;  // 0x170 (0x170)
	bool ReturnValue : 1;  // 0x170 (0x170)
	char pad_369[7];  // 0x171 (0x171)


}; 
 
 // ScriptStruct Engine.CustomDefine
struct FCustomDefine
{
	struct FString DefineName;  // 0x0 (0x0)
	struct FString DefineValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.CapsuleTraceSingleForObjects
struct FCapsuleTraceSingleForObjects
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	float HalfHeight;  // 0x3C (0x3C)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x40 (0x40)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool bTraceComplex : 1;  // 0x50 (0x50)
	char pad_81[7];  // 0x51 (0x51)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x58 (0x58)
	enum class EDrawDebugTrace DrawDebugType;  // 0x68 (0x68)
	char pad_105[7];  // 0x69 (0x69)
	struct FHitResult OutHit;  // 0x70 (0x70)
	char pad_344_1 : 7;  // 0x158 (0x158)
	bool bIgnoreSelf : 1;  // 0x158 (0x158)
	char pad_345[3];  // 0x159 (0x159)
	struct FLinearColor TraceColor;  // 0x15C (0x15C)
	struct FLinearColor TraceHitColor;  // 0x16C (0x16C)
	float DrawTime;  // 0x17C (0x17C)
	char pad_384_1 : 7;  // 0x180 (0x180)
	bool ReturnValue : 1;  // 0x180 (0x180)
	char pad_385[7];  // 0x181 (0x181)


}; 
 
 // Function Engine.KismetSystemLibrary.ComponentOverlapActors
struct FComponentOverlapActors
{
	struct UPrimitiveComponent* Component;  // 0x0 (0x0)
	char pad_8[8];  // 0x8 (0x8)
	struct FTransform ComponentTransform;  // 0x10 (0x10)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x70 (0x70)
	UObject* ActorClassFilter;  // 0x80 (0x80)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x88 (0x88)
	struct TArray<struct AActor*> OutActors;  // 0x98 (0x98)
	char pad_168_1 : 7;  // 0xA8 (0xA8)
	bool ReturnValue : 1;  // 0xA8 (0xA8)
	char pad_169[7];  // 0xA9 (0xA9)


}; 
 
 // ScriptStruct Engine.RawDistributionFloat
// Size: 0x30(Inherited: 0x20)
struct FRawDistributionFloat : FRawDistribution
{
	float MinValue;  // 0x20 (0x20)
	float MaxValue;  // 0x24 (0x24)
	struct UDistributionFloat* Distribution;  // 0x28 (0x28)


}; 
 
 // Function Engine.Actor.K2_OnBecomeViewTarget
struct FK2_OnBecomeViewTarget
{
	struct APlayerController* PC;  // 0x0 (0x0)


}; 
 
 // Function Engine.WorldPartitionBlueprintLibrary.GetEditorWorldBounds
struct FGetEditorWorldBounds
{
	struct FBox ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.SplineComponent.GetScaleAtDistanceAlongSpline
struct FGetScaleAtDistanceAlongSpline
{
	float Distance;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.ReceiveActorBeginOverlap
struct FReceiveActorBeginOverlap
{
	struct AActor* OtherActor;  // 0x0 (0x0)


}; 
 
 // Function Engine.GameInstance.HandleTravelError
struct FHandleTravelError
{
	enum class ETravelFailure FailureType;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.TimespanRatio
struct FTimespanRatio
{
	struct FTimespan A;  // 0x0 (0x0)
	struct FTimespan B;  // 0x8 (0x8)
	float ReturnValue;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetSystemLibrary.ComponentOverlapComponents
struct FComponentOverlapComponents
{
	struct UPrimitiveComponent* Component;  // 0x0 (0x0)
	char pad_8[8];  // 0x8 (0x8)
	struct FTransform ComponentTransform;  // 0x10 (0x10)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x70 (0x70)
	UObject* ComponentClassFilter;  // 0x80 (0x80)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x88 (0x88)
	struct TArray<struct UPrimitiveComponent*> OutComponents;  // 0x98 (0x98)
	char pad_168_1 : 7;  // 0xA8 (0xA8)
	bool ReturnValue : 1;  // 0xA8 (0xA8)
	char pad_169[7];  // 0xA9 (0xA9)


}; 
 
 // ScriptStruct Engine.HLODProxyMesh
struct FHLODProxyMesh
{
	 LODActor;  // 0x0 (0x0)
	char pad_28[4];  // 0x1C (0x1C)
	struct UStaticMesh* StaticMesh;  // 0x20 (0x20)
	struct FName Key;  // 0x28 (0x28)


}; 
 
 // ScriptStruct Engine.BlueprintDebugData
struct FBlueprintDebugData
{
	char pad_0[1];  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.ControlScreensaver
struct FControlScreensaver
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bAllowScreenSaver : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.ProjectileMovementComponent.LimitVelocity
struct FLimitVelocity
{
	struct FVector NewVelocity;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.VolumetricCloudComponent.SetLayerHeight
struct FSetLayerHeight
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPreferredLanguages
struct FGetPreferredLanguages
{
	struct TArray<struct FString> ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerController.PlayDynamicForceFeedback
struct FPlayDynamicForceFeedback
{
	float Intensity;  // 0x0 (0x0)
	float Duration;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bAffectsLeftLarge : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool bAffectsLeftSmall : 1;  // 0x9 (0x9)
	char pad_10_1 : 7;  // 0xA (0xA)
	bool bAffectsRightLarge : 1;  // 0xA (0xA)
	char pad_11_1 : 7;  // 0xB (0xB)
	bool bAffectsRightSmall : 1;  // 0xB (0xB)
	enum class EDynamicForceFeedbackAction Action;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)
	struct FLatentActionInfo LatentInfo;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetMathLibrary.GetTotalDays
struct FGetTotalDays
{
	struct FTimespan A;  // 0x0 (0x0)
	float ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.SceneComponent.OnRep_Visibility
struct FOnRep_Visibility
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool OldValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.PhysicsConstraintComponent.SetAngularVelocityDrive
struct FSetAngularVelocityDrive
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bEnableSwingDrive : 1;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bEnableTwistDrive : 1;  // 0x1 (0x1)


}; 
 
 // Function Engine.CharacterMovementComponent.SetGroupsToIgnoreMask
struct FSetGroupsToIgnoreMask
{
	struct FNavAvoidanceMask GroupMask;  // 0x0 (0x0)


}; 
 
 // Function Engine.SkeletalMeshComponent.GetAnimationMode
struct FGetAnimationMode
{
	enum class EAnimationMode ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.ImportanceSamplingLibrary.MakeImportanceTexture
struct FMakeImportanceTexture
{
	struct UTexture2D* Texture;  // 0x0 (0x0)
	enum class EImportanceWeight WeightingFunc;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)
	struct FImportanceTexture ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetMathLibrary.GetRightVector
struct FGetRightVector
{
	struct FRotator InRot;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_ClassToSoftClassReference
struct FConv_ClassToSoftClassReference
{
	UObject* Class;  // 0x0 (0x0)
	struct TSoftClassPtr<UObject> ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.CameraModifier.OnCameraOwnerDestroyed
struct FOnCameraOwnerDestroyed
{
	struct AActor* InOwner;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_InterfaceToObject
struct FConv_InterfaceToObject
{
	struct TScriptInterface<IInterface> Interface;  // 0x0 (0x0)
	struct UObject* ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.GetCurrentBundleState
struct FGetCurrentBundleState
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool bForceCurrentState : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct TArray<struct FName> OutBundles;  // 0x18 (0x18)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool ReturnValue : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)


}; 
 
 // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors
struct FCopyArrayOfMoveIgnoreActors
{
	struct TArray<struct AActor*> ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerController.ClientStopCameraShake
struct FClientStopCameraShake
{
	UCameraShakeBase* Shake;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bImmediately : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetMathLibrary.Vector_One
struct FVector_One
{
	struct FVector ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.StaticMeshActor.SetMobility
struct FSetMobility
{
	enum class EComponentMobility InMobility;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_ObjectToSoftObjectReference
struct FConv_ObjectToSoftObjectReference
{
	struct UObject* Object;  // 0x0 (0x0)
	struct TSoftObjectPtr<UObject> ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_PrimaryAssetIdToString
struct FConv_PrimaryAssetIdToString
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.CheatManager.Slomo
struct FSlomo
{
	float NewTimeDilation;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetLevel
struct FGetLevel
{
	struct ULevel* ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.TimespanZeroValue
struct FTimespanZeroValue
{
	struct FTimespan ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.BoxComponent.GetUnscaledBoxExtent
struct FGetUnscaledBoxExtent
{
	struct FVector ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_SoftClassPathToSoftClassRef
struct FConv_SoftClassPathToSoftClassRef
{
	struct FSoftClassPath SoftClassPath;  // 0x0 (0x0)
	struct TSoftClassPtr<UObject> ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetSystemLibrary.GetBuildVersion
struct FGetBuildVersion
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.AnimNodeData
struct FAnimNodeData
{
	struct TScriptInterface<IAnimClassInterface> AnimClassInterface;  // 0x0 (0x0)
	struct TArray<uint32_t> Entries;  // 0x10 (0x10)
	int32_t NodeIndex;  // 0x20 (0x20)
	uint8_t Flags;  // 0x24 (0x24)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_SoftClassReferenceToClass
struct FConv_SoftClassReferenceToClass
{
	struct TSoftClassPtr<UObject> SoftClass;  // 0x0 (0x0)
	UObject* ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_TimerExists
struct FK2_TimerExists
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool ReturnValue : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // ScriptStruct Engine.AnimNotifyEvent
// Size: 0xB8(Inherited: 0x30)
struct FAnimNotifyEvent : FAnimLinkableElement
{
	float DisplayTime;  // 0x30 (0x30)
	float TriggerTimeOffset;  // 0x34 (0x34)
	float EndTriggerTimeOffset;  // 0x38 (0x38)
	float TriggerWeightThreshold;  // 0x3C (0x3C)
	struct FName NotifyName;  // 0x40 (0x40)
	struct UAnimNotify* Notify;  // 0x48 (0x48)
	struct UAnimNotifyState* NotifyStateClass;  // 0x50 (0x50)
	float Duration;  // 0x58 (0x58)
	char pad_92[4];  // 0x5C (0x5C)
	struct FAnimLinkableElement EndLink;  // 0x60 (0x60)
	char pad_144_1 : 7;  // 0x90 (0x90)
	bool bConvertedFromBranchingPoint : 1;  // 0x90 (0x90)
	enum class EMontageNotifyTickType MontageTickType;  // 0x91 (0x91)
	char pad_146[2];  // 0x92 (0x92)
	float NotifyTriggerChance;  // 0x94 (0x94)
	enum class ENotifyFilterType NotifyFilterType;  // 0x98 (0x98)
	char pad_153[3];  // 0x99 (0x99)
	int32_t NotifyFilterLOD;  // 0x9C (0x9C)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool bTriggerOnDedicatedServer : 1;  // 0xA0 (0xA0)
	char pad_161_1 : 7;  // 0xA1 (0xA1)
	bool bTriggerOnFollower : 1;  // 0xA1 (0xA1)
	char pad_162[2];  // 0xA2 (0xA2)
	int32_t TrackIndex;  // 0xA4 (0xA4)
	char pad_168[16];  // 0xA8 (0xA8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetConsoleVariableIntValue
struct FGetConsoleVariableIntValue
{
	struct FString VariableName;  // 0x0 (0x0)
	int32_t ReturnValue;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetSystemLibrary.GetClassDisplayName
struct FGetClassDisplayName
{
	UObject* Class;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.LinearColor_SetFromPow22
struct FLinearColor_SetFromPow22
{
	struct FLinearColor InOutColor;  // 0x0 (0x0)
	struct FColor InColor;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_SoftObjectReferenceToObject
struct FConv_SoftObjectReferenceToObject
{
	struct TSoftObjectPtr<UObject> SoftObject;  // 0x0 (0x0)
	struct UObject* ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.SkinnedMeshComponent.HideBoneByName
struct FHideBoneByName
{
	struct FName BoneName;  // 0x0 (0x0)
	enum class EPhysBodyOp PhysBodyOption;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetMathLibrary.DotProduct2D
struct FDotProduct2D
{
	struct FVector2D A;  // 0x0 (0x0)
	struct FVector2D B;  // 0x10 (0x10)
	double ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetSystemLibrary.Conv_SoftObjPathToSoftObjRef
struct FConv_SoftObjPathToSoftObjRef
{
	struct FSoftObjectPath SoftObjectPath;  // 0x0 (0x0)
	struct TSoftObjectPtr<UObject> ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.GameUserSettings.IsFullscreenModeDirty
struct FIsFullscreenModeDirty
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.MaterialLayersFunctionsRuntimeData
struct FMaterialLayersFunctionsRuntimeData
{
	struct TArray<struct UMaterialFunctionInterface*> Layers;  // 0x0 (0x0)
	struct TArray<struct UMaterialFunctionInterface*> Blends;  // 0x10 (0x10)


}; 
 
 // Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration
struct FGetInstanceTransitionCrossfadeDuration
{
	int32_t MachineIndex;  // 0x0 (0x0)
	int32_t TransitionIndex;  // 0x4 (0x4)
	float ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.Matrix_ApplyScale
struct FMatrix_ApplyScale
{
	struct FMatrix M;  // 0x0 (0x0)
	float Scale;  // 0x80 (0x80)
	char pad_132[12];  // 0x84 (0x84)
	struct FMatrix ReturnValue;  // 0x90 (0x90)


}; 
 
 // Function Engine.KismetSystemLibrary.ConvertToAbsolutePath
struct FConvertToAbsolutePath
{
	struct FString Filename;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.PlayerController.ClientRepObjRef
struct FClientRepObjRef
{
	struct UObject* Object;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.GetClosestPointOnCollision
struct FGetClosestPointOnCollision
{
	struct FVector Point;  // 0x0 (0x0)
	struct FVector OutPointOnBody;  // 0x18 (0x18)
	struct FName BoneName;  // 0x30 (0x30)
	float ReturnValue;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)


}; 
 
 // ScriptStruct Engine.CurveScaledPayload
// Size: 0x18(Inherited: 0x10)
struct FCurveScaledPayload : FCurvePayload
{
	float Factor;  // 0x10 (0x10)
	float Origin;  // 0x14 (0x14)


}; 
 
 // Function Engine.GameModeBase.K2_OnChangeName
struct FK2_OnChangeName
{
	struct AController* Other;  // 0x0 (0x0)
	struct FString NewName;  // 0x8 (0x8)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bNameChange : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // Function Engine.VolumetricCloudComponent.SetReflectionSampleCountScale
struct FSetReflectionSampleCountScale
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.CreateCopyForUndoBuffer
struct FCreateCopyForUndoBuffer
{
	struct UObject* ObjectToModify;  // 0x0 (0x0)


}; 
 
 // Function Engine.CharacterMovementComponent.K2_GetWalkableFloorAngle
struct FK2_GetWalkableFloorAngle
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_GetTimerElapsedTimeHandle
struct FK2_GetTimerElapsedTimeHandle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FTimerHandle Handle;  // 0x8 (0x8)
	float ReturnValue;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetSystemLibrary.GetActorListFromComponentList
struct FGetActorListFromComponentList
{
	struct TArray<struct UPrimitiveComponent*> ComponentList;  // 0x0 (0x0)
	UObject* ActorClassFilter;  // 0x10 (0x10)
	struct TArray<struct AActor*> OutActorList;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetSystemLibrary.Delay
struct FDelay
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	float Duration;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct FLatentActionInfo LatentInfo;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.SphereTraceMultiByProfile
struct FSphereTraceMultiByProfile
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	struct FName ProfileName;  // 0x3C (0x3C)
	char pad_68_1 : 7;  // 0x44 (0x44)
	bool bTraceComplex : 1;  // 0x44 (0x44)
	char pad_69[3];  // 0x45 (0x45)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x48 (0x48)
	enum class EDrawDebugTrace DrawDebugType;  // 0x58 (0x58)
	char pad_89[7];  // 0x59 (0x59)
	struct TArray<struct FHitResult> OutHits;  // 0x60 (0x60)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool bIgnoreSelf : 1;  // 0x70 (0x70)
	char pad_113[3];  // 0x71 (0x71)
	struct FLinearColor TraceColor;  // 0x74 (0x74)
	struct FLinearColor TraceHitColor;  // 0x84 (0x84)
	float DrawTime;  // 0x94 (0x94)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool ReturnValue : 1;  // 0x98 (0x98)
	char pad_153[7];  // 0x99 (0x99)


}; 
 
 // Function Engine.KismetSystemLibrary.DelayUntilNextTick
struct FDelayUntilNextTick
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FLatentActionInfo LatentInfo;  // 0x8 (0x8)


}; 
 
 // Function Engine.GameplayStatics.GetActorOfClass
struct FGetActorOfClass
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	AActor* ActorClass;  // 0x8 (0x8)
	struct AActor* ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugArrow
struct FDrawDebugArrow
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector LineStart;  // 0x8 (0x8)
	struct FVector LineEnd;  // 0x20 (0x20)
	float ArrowSize;  // 0x38 (0x38)
	struct FLinearColor LineColor;  // 0x3C (0x3C)
	float Duration;  // 0x4C (0x4C)
	float Thickness;  // 0x50 (0x50)
	char pad_84[4];  // 0x54 (0x54)


}; 
 
 // Function Engine.AtmosphericFogComponent.SetDistanceOffset
struct FSetDistanceOffset
{
	float NewDistanceOffset;  // 0x0 (0x0)


}; 
 
 // SparseDelegateFunction Engine.ActorOnClickedSignature__DelegateSignature
struct FActorOnClickedSignature__DelegateSignature
{
	struct AActor* TouchedActor;  // 0x0 (0x0)
	struct FKey ButtonPressed;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.LightmassDirectionalLightSettings
// Size: 0x10(Inherited: 0xC)
struct FLightmassDirectionalLightSettings : FLightmassLightSettings
{
	float LightSourceAngle;  // 0xC (0xC)


}; 
 
 // Function Engine.PlayerController.ClientPlaySound
struct FClientPlaySound
{
	struct USoundBase* Sound;  // 0x0 (0x0)
	float VolumeMultiplier;  // 0x8 (0x8)
	float PitchMultiplier;  // 0xC (0xC)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugBox
struct FDrawDebugBox
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Center;  // 0x8 (0x8)
	struct FVector Extent;  // 0x20 (0x20)
	struct FLinearColor LineColor;  // 0x38 (0x38)
	struct FRotator Rotation;  // 0x48 (0x48)
	float Duration;  // 0x60 (0x60)
	float Thickness;  // 0x64 (0x64)


}; 
 
 // ScriptStruct Engine.WalkableSlopeOverride
struct FWalkableSlopeOverride
{
	enum class EWalkableSlopeBehavior WalkableSlopeBehavior;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	float WalkableSlopeAngle;  // 0x4 (0x4)
	char pad_8[8];  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugCamera
struct FDrawDebugCamera
{
	struct ACameraActor* CameraActor;  // 0x0 (0x0)
	struct FLinearColor CameraColor;  // 0x8 (0x8)
	float Duration;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // Function Engine.InstancedStaticMeshComponent.UpdateInstanceTransform
struct FUpdateInstanceTransform
{
	int32_t InstanceIndex;  // 0x0 (0x0)
	char pad_4[12];  // 0x4 (0x4)
	struct FTransform NewInstanceTransform;  // 0x10 (0x10)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool bWorldSpace : 1;  // 0x70 (0x70)
	char pad_113_1 : 7;  // 0x71 (0x71)
	bool bMarkRenderStateDirty : 1;  // 0x71 (0x71)
	char pad_114_1 : 7;  // 0x72 (0x72)
	bool bTeleport : 1;  // 0x72 (0x72)
	char pad_115_1 : 7;  // 0x73 (0x73)
	bool ReturnValue : 1;  // 0x73 (0x73)
	char pad_116[12];  // 0x74 (0x74)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugCapsule
struct FDrawDebugCapsule
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Center;  // 0x8 (0x8)
	float HalfHeight;  // 0x20 (0x20)
	float Radius;  // 0x24 (0x24)
	struct FRotator Rotation;  // 0x28 (0x28)
	struct FLinearColor LineColor;  // 0x40 (0x40)
	float Duration;  // 0x50 (0x50)
	float Thickness;  // 0x54 (0x54)


}; 
 
 // ScriptStruct Engine.RootMotionSourceGroup
struct FRootMotionSourceGroup
{
	char pad_0[40];  // 0x0 (0x0)
	char bHasAdditiveSources : 1;  // 0x28 (0x28)
	char bHasOverrideSources : 1;  // 0x28 (0x28)
	char bHasOverrideSourcesWithIgnoreZAccumulate : 1;  // 0x28 (0x28)
	char bIsAdditiveVelocityApplied : 1;  // 0x28 (0x28)
	char pad_40_1 : 4;  // 0x28 (0x28)
	struct FRootMotionSourceSettings LastAccumulatedSettings;  // 0x29 (0x29)
	char pad_42[6];  // 0x2A (0x2A)
	struct FVector_NetQuantize10 LastPreAdditiveVelocity;  // 0x30 (0x30)


}; 
 
 // Function Engine.AmbientSound.FadeOut
struct FFadeOut
{
	float FadeOutDuration;  // 0x0 (0x0)
	float FadeVolumeLevel;  // 0x4 (0x4)


}; 
 
 // Function Engine.SplineComponent.GetRotationAtTime
struct FGetRotationAtTime
{
	float Time;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool bUseConstantVelocity : 1;  // 0x5 (0x5)
	char pad_6[2];  // 0x6 (0x6)
	struct FRotator ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.CameraComponent.SetPostProcessBlendWeight
struct FSetPostProcessBlendWeight
{
	float InPostProcessBlendWeight;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.SphereTraceSingle
struct FSphereTraceSingle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	enum class ETraceTypeQuery TraceChannel;  // 0x3C (0x3C)
	char pad_61_1 : 7;  // 0x3D (0x3D)
	bool bTraceComplex : 1;  // 0x3D (0x3D)
	char pad_62[2];  // 0x3E (0x3E)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x40 (0x40)
	enum class EDrawDebugTrace DrawDebugType;  // 0x50 (0x50)
	char pad_81[7];  // 0x51 (0x51)
	struct FHitResult OutHit;  // 0x58 (0x58)
	char pad_320_1 : 7;  // 0x140 (0x140)
	bool bIgnoreSelf : 1;  // 0x140 (0x140)
	char pad_321[3];  // 0x141 (0x141)
	struct FLinearColor TraceColor;  // 0x144 (0x144)
	struct FLinearColor TraceHitColor;  // 0x154 (0x154)
	float DrawTime;  // 0x164 (0x164)
	char pad_360_1 : 7;  // 0x168 (0x168)
	bool ReturnValue : 1;  // 0x168 (0x168)
	char pad_361[7];  // 0x169 (0x169)


}; 
 
 // Function Engine.PlayerState.GetPlayerName
struct FGetPlayerName
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugCircle
struct FDrawDebugCircle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Center;  // 0x8 (0x8)
	float Radius;  // 0x20 (0x20)
	int32_t NumSegments;  // 0x24 (0x24)
	struct FLinearColor LineColor;  // 0x28 (0x28)
	float Duration;  // 0x38 (0x38)
	float Thickness;  // 0x3C (0x3C)
	struct FVector YAxis;  // 0x40 (0x40)
	struct FVector ZAxis;  // 0x58 (0x58)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool bDrawAxis : 1;  // 0x70 (0x70)
	char pad_113[7];  // 0x71 (0x71)


}; 
 
 // ScriptStruct Engine.SkeletonToMeshLinkup
struct FSkeletonToMeshLinkup
{
	struct TArray<int32_t> SkeletonToMeshTable;  // 0x0 (0x0)
	struct TArray<int32_t> MeshToSkeletonTable;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugConeInDegrees
struct FDrawDebugConeInDegrees
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Origin;  // 0x8 (0x8)
	struct FVector Direction;  // 0x20 (0x20)
	float Length;  // 0x38 (0x38)
	float AngleWidth;  // 0x3C (0x3C)
	float AngleHeight;  // 0x40 (0x40)
	int32_t NumSides;  // 0x44 (0x44)
	struct FLinearColor LineColor;  // 0x48 (0x48)
	float Duration;  // 0x58 (0x58)
	float Thickness;  // 0x5C (0x5C)


}; 
 
 // Function Engine.KismetSystemLibrary.SetStructurePropertyByName
struct FSetStructurePropertyByName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)
	struct FGenericStruct Value;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetMathLibrary.TimespanMaxValue
struct FTimespanMaxValue
{
	struct FTimespan ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetUniqueDeviceId
struct FGetUniqueDeviceId
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.GameplayStatics.GetPlayerState
struct FGetPlayerState
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	int32_t PlayerStateIndex;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct APlayerState* ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.Actor.ReceiveHit
struct FReceiveHit
{
	struct UPrimitiveComponent* MyComp;  // 0x0 (0x0)
	struct AActor* Other;  // 0x8 (0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10 (0x10)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bSelfMoved : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FVector HitLocation;  // 0x20 (0x20)
	struct FVector HitNormal;  // [x38 ([x38)
	struct FVector NormalImpulse;  // 0x50 (0x50)
	struct FHitResult Hit;  // 0x68 (0x68)


}; 
 
 // Function Engine.KismetMathLibrary.Conv_BoolToByte
struct FConv_BoolToByte
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool InBool : 1;  // 0x0 (0x0)
	char ReturnValue;  // 0x1 (0x1)


}; 
 
 // Function Engine.KismetMathLibrary.DegSin
struct FDegSin
{
	double A;  // 0x0 (0x0)
	double ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.IsControllerAssignedToGamepad
struct FIsControllerAssignedToGamepad
{
	int32_t ControllerId;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_TimerExistsDelegate
struct FK2_TimerExistsDelegate
{
	struct FDelegate Delegate;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)


}; 
 
 // Function Engine.KismetMathLibrary.Divide_ByteByte
struct FDivide_ByteByte
{
	char A;  // 0x0 (0x0)
	char B;  // 0x1 (0x1)
	char ReturnValue;  // 0x2 (0x2)


}; 
 
 // ScriptStruct Engine.GaussianSumBloomSettings
struct FGaussianSumBloomSettings
{
	float Intensity;  // 0x0 (0x0)
	float Threshold;  // 0x4 (0x4)
	float SizeScale;  // 0x8 (0x8)
	float Filter1Size;  // 0xC (0xC)
	float Filter2Size;  // 0x10 (0x10)
	float Filter3Size;  // 0x14 (0x14)
	float Filter4Size;  // 0x18 (0x18)
	float Filter5Size;  // 0x1C (0x1C)
	float Filter6Size;  // 0x20 (0x20)
	struct FLinearColor Filter1Tint;  // 0x24 (0x24)
	struct FLinearColor Filter2Tint;  // 0x34 (0x34)
	struct FLinearColor Filter3Tint;  // 0x44 (0x44)
	struct FLinearColor Filter4Tint;  // 0x54 (0x54)
	struct FLinearColor Filter5Tint;  // 0x64 (0x64)
	struct FLinearColor Filter6Tint;  // 0x74 (0x74)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugCoordinateSystem
struct FDrawDebugCoordinateSystem
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector AxisLoc;  // 0x8 (0x8)
	struct FRotator AxisRot;  // 0x20 (0x20)
	float Scale;  // 0x38 (0x38)
	float Duration;  // 0x3C (0x3C)
	float Thickness;  // 0x40 (0x40)
	char pad_68[4];  // 0x44 (0x44)


}; 
 
 // Function Engine.BlueprintMapLibrary.Map_Find
struct FMap_Find
{
	struct TMap<int32_t, int32_t> TargetMap;  // 0x0 (0x0)
	int32_t Key;  // 0x50 (0x50)
	int32_t Value;  // 0x54 (0x54)
	char pad_88_1 : 7;  // 0x58 (0x58)
	bool ReturnValue : 1;  // 0x58 (0x58)
	char pad_89[7];  // 0x59 (0x59)


}; 
 
 // Function Engine.PhysicsConstraintComponent.SetAngularVelocityDriveSLERP
struct FSetAngularVelocityDriveSLERP
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bEnableSLERP : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.TTEventTrack
// Size: 0x28(Inherited: 0x18)
struct FTTEventTrack : FTTTrackBase
{
	struct FName FunctionName;  // 0x18 (0x18)
	struct UCurveFloat* CurveKeys;  // 0x20 (0x20)


}; 
 
 // Function Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility
struct FSetCapsuleIndirectShadowMinVisibility
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Conv_Int64ToByte
struct FConv_Int64ToByte
{
	int64_t inInt;  // 0x0 (0x0)
	char ReturnValue;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugCylinder
struct FDrawDebugCylinder
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	int32_t Segments;  // 0x3C (0x3C)
	struct FLinearColor LineColor;  // 0x40 (0x40)
	float Duration;  // 0x50 (0x50)
	float Thickness;  // 0x54 (0x54)


}; 
 
 // Function Engine.KismetSystemLibrary.GetProjectDirectory
struct FGetProjectDirectory
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ActorComponentInstanceSourceInfo
struct FActorComponentInstanceSourceInfo
{
	struct UObject* SourceComponentTemplate;  // 0x0 (0x0)
	uint8_t SourceComponentCreationMethod;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)
	int32_t SourceComponentTypeSerializedIndex;  // 0xC (0xC)


}; 
 
 // ScriptStruct Engine.CharacterMoveResponsePackedBits
// Size: 0x98(Inherited: 0x98)
struct FCharacterMoveResponsePackedBits : FCharacterNetworkSerializationPackedBits
{


}; 
 
 // Function Engine.KismetMathLibrary.LessEqual_Int64Int64
struct FLessEqual_Int64Int64
{
	int64_t A;  // 0x0 (0x0)
	int64_t B;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // ScriptStruct Engine.TexturePlatformData
struct FTexturePlatformData
{
	char pad_0[48];  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugFloatHistoryLocation
struct FDrawDebugFloatHistoryLocation
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FDebugFloatHistory FloatHistory;  // 0x8 (0x8)
	struct FVector DrawLocation;  // 0x28 (0x28)
	struct FVector2D DrawSize;  // 0x40 (0x40)
	struct FLinearColor DrawColor;  // 0x50 (0x50)
	float Duration;  // 0x60 (0x60)
	char pad_100[4];  // 0x64 (0x64)


}; 
 
 // Function Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled
struct FK2_IsPhysicsCollisionEnabled
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision
struct FSetNotifyRigidBodyCollision
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewNotifyRigidBodyCollision : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.PawnMovementComponent.ConsumeInputVector
struct FConsumeInputVector
{
	struct FVector ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugFloatHistoryTransform
struct FDrawDebugFloatHistoryTransform
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FDebugFloatHistory FloatHistory;  // 0x8 (0x8)
	char pad_40[8];  // 0x28 (0x28)
	struct FTransform DrawTransform;  // 0x30 (0x30)
	struct FVector2D DrawSize;  // 0x90 (0x90)
	struct FLinearColor DrawColor;  // 0xA0 (0xA0)
	float Duration;  // 0xB0 (0xB0)
	char pad_180[12];  // 0xB4 (0xB4)


}; 
 
 // Function Engine.PrimitiveComponent.AddAngularImpulseInRadians
struct FAddAngularImpulseInRadians
{
	struct FVector Impulse;  // 0x0 (0x0)
	struct FName BoneName;  // 0x18 (0x18)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool bVelChange : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)


}; 
 
 // ScriptStruct Engine.RawCurveTracks
struct FRawCurveTracks
{
	struct TArray<struct FFloatCurve> FloatCurves;  // 0x0 (0x0)


}; 
 
 // Function Engine.Controller.SetIgnoreMoveInput
struct FSetIgnoreMoveInput
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewMoveInput : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Vector_ComponentMax
struct FVector_ComponentMax
{
	struct FVector A;  // 0x0 (0x0)
	struct FVector B;  // 0x18 (0x18)
	struct FVector ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugPlane
struct FDrawDebugPlane
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	char pad_8[8];  // 0x8 (0x8)
	struct FPlane PlaneCoordinates;  // 0x10 (0x10)
	struct FVector Location;  // 0x30 (0x30)
	float Size;  // 0x48 (0x48)
	struct FLinearColor PlaneColor;  // 0x4C (0x4C)
	float Duration;  // 0x5C (0x5C)


}; 
 
 // Function Engine.CharacterMovementComponent.CalcVelocity
struct FCalcVelocity
{
	float DeltaTime;  // 0x0 (0x0)
	float Friction;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bFluid : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)
	float BrakingDeceleration;  // 0xC (0xC)


}; 
 
 // ScriptStruct Engine.NonBlendableTransformAnimationAttribute
// Size: 0x60(Inherited: 0x60)
struct FNonBlendableTransformAnimationAttribute : FTransformAnimationAttribute
{


}; 
 
 // Function Engine.KismetMathLibrary.NotEqual_TimespanTimespan
struct FNotEqual_TimespanTimespan
{
	struct FTimespan A;  // 0x0 (0x0)
	struct FTimespan B;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugSphere
struct FDrawDebugSphere
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Center;  // 0x8 (0x8)
	float Radius;  // 0x20 (0x20)
	int32_t Segments;  // 0x24 (0x24)
	struct FLinearColor LineColor;  // 0x28 (0x28)
	float Duration;  // 0x38 (0x38)
	float Thickness;  // 0x3C (0x3C)


}; 
 
 // Function Engine.KismetMathLibrary.MakeRotFromXY
struct FMakeRotFromXY
{
	struct FVector X;  // 0x0 (0x0)
	struct FVector Y;  // 0x18 (0x18)
	struct FRotator ReturnValue;  // 0x30 (0x30)


}; 
 
 // ScriptStruct Engine.A2CSPose
// Size: 0x28(Inherited: 0x10)
struct FA2CSPose : FA2Pose
{
	char pad_16[8];  // 0x10 (0x10)
	struct TArray<char> ComponentSpaceFlags;  // 0x18 (0x18)


}; 
 
 // Function Engine.CanvasRenderTarget2D.ReceiveUpdate
struct FReceiveUpdate
{
	struct UCanvas* Canvas;  // 0x0 (0x0)
	int32_t Width;  // 0x8 (0x8)
	int32_t Height;  // 0xC (0xC)


}; 
 
 // Function Engine.KismetInputLibrary.ModifierKeysState_IsCommandDown
struct FModifierKeysState_IsCommandDown
{
	struct FSlateModifierKeysState KeysState;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool ReturnValue : 1;  // 0x1 (0x1)


}; 
 
 // Function Engine.AvoidanceManager.GetNewAvoidanceUID
struct FGetNewAvoidanceUID
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Vector4_SizeSquared
struct FVector4_SizeSquared
{
	struct FVector4 A;  // 0x0 (0x0)
	double ReturnValue;  // 0x20 (0x20)
	char pad_40[8];  // 0x28 (0x28)


}; 
 
 // Function Engine.KismetSystemLibrary.DrawDebugString
struct FDrawDebugString
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector TextLocation;  // 0x8 (0x8)
	struct FString Text;  // 0x20 (0x20)
	struct AActor* TestBaseActor;  // 0x30 (0x30)
	struct FLinearColor TextColor;  // 0x38 (0x38)
	float Duration;  // 0x48 (0x48)
	char pad_76[4];  // 0x4C (0x4C)


}; 
 
 // ScriptStruct Engine.SkeletalMeshOptimizationSettings
struct FSkeletalMeshOptimizationSettings
{
	enum class SkeletalMeshTerminationCriterion TerminationCriterion;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	float NumOfTrianglesPercentage;  // 0x4 (0x4)
	float NumOfVertPercentage;  // 0x8 (0x8)
	uint32_t MaxNumOfTriangles;  // 0xC (0xC)
	uint32_t MaxNumOfVerts;  // 0x10 (0x10)
	float MaxDeviationPercentage;  // 0x14 (0x14)
	enum class SkeletalMeshOptimizationType ReductionMethod;  // 0x18 (0x18)
	enum class SkeletalMeshOptimizationImportance SilhouetteImportance;  // 0x19 (0x19)
	enum class SkeletalMeshOptimizationImportance TextureImportance;  // 0x1A (0x1A)
	enum class SkeletalMeshOptimizationImportance ShadingImportance;  // 0x1B (0x1B)
	enum class SkeletalMeshOptimizationImportance SkinningImportance;  // 0x1C (0x1C)
	char bRemapMorphTargets : 1;  // 0x1D (0x1D)
	char bRecalcNormals : 1;  // 0x1D (0x1D)
	char pad_29_1 : 6;  // 0x1D (0x1D)
	char pad_30[3];  // 0x1E (0x1E)
	float WeldingThreshold;  // 0x20 (0x20)
	float NormalsThreshold;  // 0x24 (0x24)
	int32_t MaxBonesPerVertex;  // 0x28 (0x28)
	char bEnforceBoneBoundaries : 1;  // 0x2C (0x2C)
	char bMergeCoincidentVertBones : 1;  // 0x2C (0x2C)
	char pad_44_1 : 6;  // 0x2C (0x2C)
	char pad_45[4];  // 0x2D (0x2D)
	float VolumeImportance;  // 0x30 (0x30)
	char bLockEdges : 1;  // 0x34 (0x34)
	char bLockColorBounaries : 1;  // 0x34 (0x34)
	char pad_52_1 : 6;  // 0x34 (0x34)
	char pad_53[4];  // 0x35 (0x35)
	int32_t BaseLOD;  // 0x38 (0x38)


}; 
 
 // SparseDelegateFunction Engine.ComponentEndOverlapSignature__DelegateSignature
struct FComponentEndOverlapSignature__DelegateSignature
{
	struct UPrimitiveComponent* OverlappedComponent;  // 0x0 (0x0)
	struct AActor* OtherActor;  // 0x8 (0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10 (0x10)
	int32_t OtherBodyIndex;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // Function Engine.PlayerController.ClientIgnoreMoveInput
struct FClientIgnoreMoveInput
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bIgnore : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.EqualEqual_PrimaryAssetId
struct FEqualEqual_PrimaryAssetId
{
	struct FPrimaryAssetId A;  // 0x0 (0x0)
	struct FPrimaryAssetId B;  // 0x10 (0x10)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[3];  // 0x21 (0x21)


}; 
 
 // ScriptStruct Engine.IndexedCurve
struct FIndexedCurve
{
	char pad_0[8];  // 0x0 (0x0)
	struct FKeyHandleMap KeyHandlesToIndices;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.Divide_VectorFloat
struct FDivide_VectorFloat
{
	struct FVector A;  // 0x0 (0x0)
	double B;  // 0x18 (0x18)
	struct FVector ReturnValue;  // 0x20 (0x20)


}; 
 
 // DelegateFunction Engine.PlatformGameInstance.PlatformReceivedRemoteNotificationDelegate__DelegateSignature
struct FPlatformReceivedRemoteNotificationDelegate__DelegateSignature
{
	struct FString InString;  // 0x0 (0x0)
	enum class EApplicationState inAppState;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.KismetSystemLibrary.EqualEqual_PrimaryAssetType
struct FEqualEqual_PrimaryAssetType
{
	struct FPrimaryAssetType A;  // 0x0 (0x0)
	struct FPrimaryAssetType B;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)


}; 
 
 // Function Engine.Actor.WasRecentlyRendered
struct FWasRecentlyRendered
{
	float Tolerance;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)


}; 
 
 // ScriptStruct Engine.TTPropertyTrack
// Size: 0x20(Inherited: 0x18)
struct FTTPropertyTrack : FTTTrackBase
{
	struct FName PropertyName;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetSystemLibrary.GetObjectName
struct FGetObjectName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.EqualEqual_SoftClassReference
struct FEqualEqual_SoftClassReference
{
	struct TSoftClassPtr<UObject> A;  // 0x0 (0x0)
	struct TSoftClassPtr<UObject> B;  // 0x30 (0x30)
	char pad_96_1 : 7;  // 0x60 (0x60)
	bool ReturnValue : 1;  // 0x60 (0x60)
	char pad_97[7];  // 0x61 (0x61)


}; 
 
 // Function Engine.KismetMathLibrary.LinearColor_ToRGBE
struct FLinearColor_ToRGBE
{
	struct FLinearColor InLinearColor;  // 0x0 (0x0)
	struct FColor ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.SkyAtmosphereComponent.SetRayleighScatteringScale
struct FSetRayleighScatteringScale
{
	float NewValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.EqualEqual_SoftObjectReference
struct FEqualEqual_SoftObjectReference
{
	struct TSoftObjectPtr<UObject> A;  // 0x0 (0x0)
	struct TSoftObjectPtr<UObject> B;  // 0x30 (0x30)
	char pad_96_1 : 7;  // 0x60 (0x60)
	bool ReturnValue : 1;  // 0x60 (0x60)
	char pad_97[7];  // 0x61 (0x61)


}; 
 
 // Function Engine.KismetSystemLibrary.GetProjectSavedDirectory
struct FGetProjectSavedDirectory
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.ExecuteConsoleCommand
struct FExecuteConsoleCommand
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FString Command;  // 0x8 (0x8)
	struct APlayerController* SpecificPlayer;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetSystemLibrary.IsValidPrimaryAssetId
struct FIsValidPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)


}; 
 
 // Function Engine.KismetSystemLibrary.FlushDebugStrings
struct FFlushDebugStrings
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)


}; 
 
 // Function Engine.SceneComponent.GetChildComponent
struct FGetChildComponent
{
	int32_t ChildIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct USceneComponent* ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.FlushPersistentDebugLines
struct FFlushPersistentDebugLines
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetComponentsByTag
struct FGetComponentsByTag
{
	UActorComponent* ComponentClass;  // 0x0 (0x0)
	struct FName Tag;  // 0x8 (0x8)
	struct TArray<struct UActorComponent*> ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset
struct FK2_GetClosestPointOnPhysicsAsset
{
	struct FVector WorldPosition;  // 0x0 (0x0)
	struct FVector ClosestWorldPosition;  // 0x18 (0x18)
	struct FVector Normal;  // 0x30 (0x30)
	struct FName BoneName;  // 0x48 (0x48)
	float Distance;  // 0x50 (0x50)
	char pad_84_1 : 7;  // 0x54 (0x54)
	bool ReturnValue : 1;  // 0x54 (0x54)
	char pad_85[3];  // 0x55 (0x55)


}; 
 
 // Function Engine.KismetSystemLibrary.SetTransformPropertyByName
struct FSetTransformPropertyByName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)
	struct FTransform Value;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.SetClassPropertyByName
struct FSetClassPropertyByName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)
	UObject* Value;  // 0x10 (0x10)


}; 
 
 // SparseDelegateFunction Engine.PawnControllerChangedSignature__DelegateSignature
struct FPawnControllerChangedSignature__DelegateSignature
{
	struct APawn* Pawn;  // 0x0 (0x0)
	struct AController* OldController;  // 0x8 (0x8)
	struct AController* NewController;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.GetClassFromPrimaryAssetId
struct FGetClassFromPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0 (0x0)
	UObject* ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.PrimitiveComponent.IsGravityEnabled
struct FIsGravityEnabled
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetAdIDCount
struct FGetAdIDCount
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.MaterialInstanceDynamic.SetVectorParameterValueByInfo
struct FSetVectorParameterValueByInfo
{
	struct FMaterialParameterInfo ParameterInfo;  // 0x0 (0x0)
	struct FLinearColor Value;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.GetBuildConfiguration
struct FGetBuildConfiguration
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.BlueprintPathsLibrary.GetRelativePathToRoot
struct FGetRelativePathToRoot
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.GetRemoteRole
struct FGetRemoteRole
{
	enum class ENetRole ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimNotifyStateMachineInspectionLibrary.IsTriggeredByStateMachine
struct FIsTriggeredByStateMachine
{
	struct FAnimNotifyEventReference EventReference;  // 0x0 (0x0)
	struct UAnimInstance* AnimInstance;  // 0x28 (0x28)
	struct FName StateMachineName;  // 0x30 (0x30)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool ReturnValue : 1;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)


}; 
 
 // Function Engine.SkeletalMeshComponent.GetBoneMass
struct FGetBoneMass
{
	struct FName BoneName;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bScaleMass : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)
	float ReturnValue;  // 0xC (0xC)


}; 
 
 // ScriptStruct Engine.AttributePayload
// Size: 0x40(Inherited: 0x1)
struct FAttributePayload : FEmptyPayload
{
	struct FAnimationAttributeIdentifier Identifier;  // 0x0 (0x0)


}; 
 
 // Function Engine.AudioComponent.GetPlayState
struct FGetPlayState
{
	uint8_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetCommandLine
struct FGetCommandLine
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.EqualEqual_ByteByte
struct FEqualEqual_ByteByte
{
	char A;  // 0x0 (0x0)
	char B;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool ReturnValue : 1;  // 0x2 (0x2)


}; 
 
 // Function Engine.ExponentialHeightFogComponent.SetFullyDirectionalInscatteringColorDistance
struct FSetFullyDirectionalInscatteringColorDistance
{
	float Value;  // 0x0 (0x0)


}; 
 
 // Function Engine.Controller.ReceiveUnPossess
struct FReceiveUnPossess
{
	struct APawn* UnpossessedPawn;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.KConvexElem
// Size: 0x100(Inherited: 0x30)
struct FKConvexElem : FKShapeElem
{
	struct TArray<struct FVector> VertexData;  // 0x30 (0x30)
	struct TArray<int32_t> IndexData;  // 0x40 (0x40)
	struct FBox ElemBox;  // 0x50 (0x50)
	char pad_136[8];  // 0x88 (0x88)
	struct FTransform Transform;  // 0x90 (0x90)
	char pad_240[16];  // 0xF0 (0xF0)


}; 
 
 // Function Engine.BlueprintTypeConversions.ConvertFRotator3dToFRotator3f
struct FConvertFRotator3dToFRotator3f
{
	int32_t InFromData;  // 0x0 (0x0)
	int32_t ReturnValue;  // 0x4 (0x4)


}; 
 
 // Function Engine.KismetSystemLibrary.GetComponentBounds
struct FGetComponentBounds
{
	struct USceneComponent* Component;  // 0x0 (0x0)
	struct FVector Origin;  // 0x8 (0x8)
	struct FVector BoxExtent;  // 0x20 (0x20)
	float SphereRadius;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)


}; 
 
 // ScriptStruct Engine.CurveEdEntry
struct FCurveEdEntry
{
	struct UObject* CurveObject;  // 0x0 (0x0)
	struct FColor CurveColor;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct FString CurveName;  // 0x10 (0x10)
	int32_t bHideCurve;  // 0x20 (0x20)
	int32_t bColorCurve;  // 0x24 (0x24)
	int32_t bFloatingPointColorCurve;  // 0x28 (0x28)
	int32_t bClamp;  // 0x2C (0x2C)
	float ClampLow;  // 0x30 (0x30)
	float ClampHigh;  // 0x34 (0x34)


}; 
 
 // Function Engine.LightComponentBase.SetAffectReflection
struct FSetAffectReflection
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bNewValue : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.AnimNode_AssetPlayerRelevancyBase
// Size: 0x10(Inherited: 0x10)
struct FAnimNode_AssetPlayerRelevancyBase : FAnimNode_Base
{


}; 
 
 // ScriptStruct Engine.PropertyAccessCopy
struct FPropertyAccessCopy
{
	int32_t AccessIndex;  // 0x0 (0x0)
	int32_t DestAccessStartIndex;  // 0x4 (0x4)
	int32_t DestAccessEndIndex;  // 0x8 (0x8)
	uint8_t Type;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)


}; 
 
 // ScriptStruct Engine.ExpressionExecOutput
struct FExpressionExecOutput
{
	struct UMaterialExpression* Expression;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.EndPhysicsTickFunction
// Size: 0x30(Inherited: 0x28)
struct FEndPhysicsTickFunction : FTickFunction
{
	char pad_40[8];  // 0x28 (0x28)


}; 
 
 // Function Engine.KismetSystemLibrary.IsSplitScreen
struct FIsSplitScreen
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetSystemLibrary.GetConsoleVariableFloatValue
struct FGetConsoleVariableFloatValue
{
	struct FString VariableName;  // 0x0 (0x0)
	float ReturnValue;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetSystemLibrary.GetDefaultLanguage
struct FGetDefaultLanguage
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.SkeletalMeshSamplingRegion
struct FSkeletalMeshSamplingRegion
{
	struct FName Name;  // 0x0 (0x0)
	int32_t LODIndex;  // 0x8 (0x8)
	char bSupportUniformlyDistributedSampling : 1;  // 0xC (0xC)
	char pad_12_1 : 7;  // 0xC (0xC)
	char pad_13[4];  // 0xD (0xD)
	struct TArray<struct FSkeletalMeshSamplingRegionMaterialFilter> MaterialFilters;  // 0x10 (0x10)
	struct TArray<struct FSkeletalMeshSamplingRegionBoneFilter> BoneFilters;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetMathLibrary.Conv_IntToByte
struct FConv_IntToByte
{
	int32_t inInt;  // 0x0 (0x0)
	char ReturnValue;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)


}; 
 
 // Function Engine.KismetSystemLibrary.SetSoftClassPropertyByName
struct FSetSoftClassPropertyByName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)
	struct TSoftClassPtr<UObject> Value;  // 0x10 (0x10)


}; 
 
 // Function Engine.AudioComponent.GetCookedEnvelopeData
struct FGetCookedEnvelopeData
{
	float OutEnvelopeData;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)


}; 
 
 // Function Engine.SplineComponent.AddPoint
struct FAddPoint
{
	struct FSplinePoint Point;  // 0x0 (0x0)
	char pad_136_1 : 7;  // 0x88 (0x88)
	bool bUpdateSpline : 1;  // 0x88 (0x88)
	char pad_137[7];  // 0x89 (0x89)


}; 
 
 // Function Engine.KismetSystemLibrary.GetDefaultLocale
struct FGetDefaultLocale
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetInputLibrary.Key_GetNavigationActionFromKey
struct FKey_GetNavigationActionFromKey
{
	struct FKeyEvent InKeyEvent;  // 0x0 (0x0)
	uint8_t ReturnValue;  // 0x40 (0x40)
	char pad_65[7];  // 0x41 (0x41)


}; 
 
 // Function Engine.AudioComponent.GetCookedEnvelopeDataForAllPlayingSounds
struct FGetCookedEnvelopeDataForAllPlayingSounds
{
	struct TArray<struct FSoundWaveEnvelopeDataPerSound> OutEnvelopeData;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.Actor.GetHorizontalDotProductTo
struct FGetHorizontalDotProductTo
{
	struct AActor* OtherActor;  // 0x0 (0x0)
	float ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPlatformUserName
struct FGetPlatformUserName
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetRenderingLibrary.ReadRenderTargetPixel
struct FReadRenderTargetPixel
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct UTextureRenderTarget2D* TextureRenderTarget;  // 0x8 (0x8)
	int32_t X;  // 0x10 (0x10)
	int32_t Y;  // 0x14 (0x14)
	struct FColor ReturnValue;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // Function Engine.KismetSystemLibrary.GetDeviceId
struct FGetDeviceId
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.CollisionResponseContainer
struct FCollisionResponseContainer
{
	enum class ECollisionResponse WorldStatic;  // 0x0 (0x0)
	enum class ECollisionResponse WorldDynamic;  // 0x1 (0x1)
	enum class ECollisionResponse Pawn;  // 0x2 (0x2)
	enum class ECollisionResponse Visibility;  // 0x3 (0x3)
	enum class ECollisionResponse Camera;  // 0x4 (0x4)
	enum class ECollisionResponse PhysicsBody;  // 0x5 (0x5)
	enum class ECollisionResponse Vehicle;  // 0x6 (0x6)
	enum class ECollisionResponse Destructible;  // 0x7 (0x7)
	enum class ECollisionResponse EngineTraceChannel1;  // 0x8 (0x8)
	enum class ECollisionResponse EngineTraceChannel2;  // 0x9 (0x9)
	enum class ECollisionResponse EngineTraceChannel3;  // 0xA (0xA)
	enum class ECollisionResponse EngineTraceChannel4;  // 0xB (0xB)
	enum class ECollisionResponse EngineTraceChannel5;  // 0xC (0xC)
	enum class ECollisionResponse EngineTraceChannel6;  // 0xD (0xD)
	enum class ECollisionResponse GameTraceChannel1;  // 0xE (0xE)
	enum class ECollisionResponse GameTraceChannel2;  // 0xF (0xF)
	enum class ECollisionResponse GameTraceChannel3;  // 0x10 (0x10)
	enum class ECollisionResponse GameTraceChannel4;  // 0x11 (0x11)
	enum class ECollisionResponse GameTraceChannel5;  // 0x12 (0x12)
	enum class ECollisionResponse GameTraceChannel6;  // 0x13 (0x13)
	enum class ECollisionResponse GameTraceChannel7;  // 0x14 (0x14)
	enum class ECollisionResponse GameTraceChannel8;  // 0x15 (0x15)
	enum class ECollisionResponse GameTraceChannel9;  // 0x16 (0x16)
	enum class ECollisionResponse GameTraceChannel10;  // 0x17 (0x17)
	enum class ECollisionResponse GameTraceChannel11;  // 0x18 (0x18)
	enum class ECollisionResponse GameTraceChannel12;  // 0x19 (0x19)
	enum class ECollisionResponse GameTraceChannel13;  // 0x1A (0x1A)
	enum class ECollisionResponse GameTraceChannel14;  // 0x1B (0x1B)
	enum class ECollisionResponse GameTraceChannel15;  // 0x1C (0x1C)
	enum class ECollisionResponse GameTraceChannel16;  // 0x1D (0x1D)
	enum class ECollisionResponse GameTraceChannel17;  // 0x1E (0x1E)
	enum class ECollisionResponse GameTraceChannel18;  // 0x1F (0x1F)


}; 
 
 // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight
struct FSetAllBodiesBelowPhysicsBlendWeight
{
	struct FName InBoneName;  // 0x0 (0x0)
	float PhysicsBlendWeight;  // 0x8 (0x8)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool bSkipCustomPhysicsType : 1;  // 0xC (0xC)
	char pad_13_1 : 7;  // 0xD (0xD)
	bool bIncludeSelf : 1;  // 0xD (0xD)
	char pad_14[2];  // 0xE (0xE)


}; 
 
 // ScriptStruct Engine.DebugTextInfo
struct FDebugTextInfo
{
	struct AActor* SrcActor;  // 0x0 (0x0)
	struct FVector SrcActorOffset;  // 0x8 (0x8)
	struct FVector SrcActorDesiredOffset;  // 0x20 (0x20)
	struct FString DebugText;  // 0x38 (0x38)
	float TimeRemaining;  // 0x48 (0x48)
	float Duration;  // 0x4C (0x4C)
	struct FColor TextColor;  // 0x50 (0x50)
	char bAbsoluteLocation : 1;  // 0x54 (0x54)
	char bKeepAttachedToActor : 1;  // 0x54 (0x54)
	char bDrawShadow : 1;  // 0x54 (0x54)
	char pad_84_1 : 5;  // 0x54 (0x54)
	char pad_85[4];  // 0x55 (0x55)
	struct FVector OrigActorLocation;  // 0x58 (0x58)
	struct UFont* Font;  // 0x70 (0x70)
	float FontScale;  // 0x78 (0x78)
	char pad_124[4];  // 0x7C (0x7C)


}; 
 
 // ScriptStruct Engine.AnimSubsystem_Base
// Size: 0x18(Inherited: 0x8)
struct FAnimSubsystem_Base : FAnimSubsystem
{
	struct TArray<struct FExposedValueHandler> ExposedValueHandlers;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetEngineVersion
struct FGetEngineVersion
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.IsValidPrimaryAssetType
struct FIsValidPrimaryAssetType
{
	struct FPrimaryAssetType PrimaryAssetType;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.TimecodeProvider.GetDelayedTimecode
struct FGetDelayedTimecode
{
	struct FTimecode ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetFrameCount
struct FGetFrameCount
{
	int64_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // SparseDelegateFunction Engine.ComponentOnInputTouchBeginSignature__DelegateSignature
struct FComponentOnInputTouchBeginSignature__DelegateSignature
{
	enum class ETouchIndex FingerIndex;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct UPrimitiveComponent* TouchedComponent;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetGameBundleId
struct FGetGameBundleId
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.BPInterfaceDescription
struct FBPInterfaceDescription
{
	UInterface* Interface;  // 0x0 (0x0)
	struct TArray<struct UEdGraph*> Graphs;  // 0x8 (0x8)


}; 
 
 // Function Engine.AudioParameterConversionStatics.StringToAudioParameter
struct FStringToAudioParameter
{
	struct FName Name;  // 0x0 (0x0)
	struct FString String;  // 0x8 (0x8)
	struct FAudioParameter ReturnValue;  // 0x18 (0x18)


}; 
 
 // ScriptStruct Engine.RawAnimSequenceTrack
struct FRawAnimSequenceTrack
{
	struct TArray<struct FVector3f> PosKeys;  // 0x0 (0x0)
	struct TArray<struct FQuat4f> RotKeys;  // 0x10 (0x10)
	struct TArray<struct FVector3f> ScaleKeys;  // 0x20 (0x20)


}; 
 
 // SparseDelegateFunction Engine.ComponentHitSignature__DelegateSignature
struct FComponentHitSignature__DelegateSignature
{
	struct UPrimitiveComponent* HitComponent;  // 0x0 (0x0)
	struct AActor* OtherActor;  // 0x8 (0x8)
	struct UPrimitiveComponent* OtherComp;  // 0x10 (0x10)
	struct FVector NormalImpulse;  // 0x18 (0x18)
	struct FHitResult Hit;  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetMathLibrary.RandomInteger64
struct FRandomInteger64
{
	int64_t Max;  // 0x0 (0x0)
	int64_t ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.PrimitiveComponent.GetBodyInstanceAsyncPhysicsTickHandle
struct FGetBodyInstanceAsyncPhysicsTickHandle
{
	struct FName BoneName;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bGetWelded : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)
	int32_t Index;  // 0xC (0xC)
	struct FBodyInstanceAsyncPhysicsTickHandle ReturnValue;  // 0x10 (0x10)


}; 
 
 // ScriptStruct Engine.CurveFlagsChangedPayload
// Size: 0x14(Inherited: 0x10)
struct FCurveFlagsChangedPayload : FCurvePayload
{
	int32_t OldFlags;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.GetGameName
struct FGetGameName
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.AnimNode_CustomProperty
// Size: 0x58(Inherited: 0x10)
struct FAnimNode_CustomProperty : FAnimNode_Base
{
	struct TArray<struct FName> SourcePropertyNames;  // 0x10 (0x10)
	struct TArray<struct FName> DestPropertyNames;  // 0x20 (0x20)
	struct UObject* TargetInstance;  // 0x30 (0x30)
	char pad_56[32];  // 0x38 (0x38)


}; 
 
 // ScriptStruct Engine.AnimNode_LinkedInputPose
// Size: 0xC8(Inherited: 0x10)
struct FAnimNode_LinkedInputPose : FAnimNode_Base
{
	struct FName Name;  // 0x10 (0x10)
	struct FName Graph;  // 0x18 (0x18)
	struct FPoseLink InputPose;  // 0x20 (0x20)
	char pad_48[152];  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetSystemLibrary.GetGamepadButtonGlyph
struct FGetGamepadButtonGlyph
{
	struct FString ButtonKey;  // 0x0 (0x0)
	int32_t ControllerIndex;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)
	struct UTexture2D* ReturnValue;  // 0x18 (0x18)


}; 
 
 // ScriptStruct Engine.TrackToSkeletonMap
struct FTrackToSkeletonMap
{
	int32_t BoneTreeIndex;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.SpatialHashRuntimeGrid
struct FSpatialHashRuntimeGrid
{
	char pad_0[1];  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.NotEqual_SoftObjectReference
struct FNotEqual_SoftObjectReference
{
	struct TSoftObjectPtr<UObject> A;  // 0x0 (0x0)
	struct TSoftObjectPtr<UObject> B;  // 0x30 (0x30)
	char pad_96_1 : 7;  // 0x60 (0x60)
	bool ReturnValue : 1;  // 0x60 (0x60)
	char pad_97[7];  // 0x61 (0x61)


}; 
 
 // Function Engine.StaticMesh.GetNumLODs
struct FGetNumLODs
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.CameraComponent.SetFieldOfView
struct FSetFieldOfView
{
	float InFieldOfView;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_GetTimerRemainingTime
struct FK2_GetTimerRemainingTime
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)
	float ReturnValue;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // ScriptStruct Engine.TransformAnimationAttribute
struct FTransformAnimationAttribute
{
	struct FTransform Value;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ISMClientHandle
struct FISMClientHandle
{
	int32_t Index;  // 0x0 (0x0)
	struct FGuid Guid;  // 0x4 (0x4)


}; 
 
 // Function Engine.KismetSystemLibrary.GetGamepadControllerName
struct FGetGamepadControllerName
{
	int32_t ControllerId;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FString ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.SoundEffectPresetWidgetInterface.GetClass
struct FGetClass
{
	USoundEffectPreset* ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetGameTimeInSeconds
struct FGetGameTimeInSeconds
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	double ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.SoundSubmix.SetSubmixOutputVolume
struct FSetSubmixOutputVolume
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	float InOutputVolume;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // ScriptStruct Engine.GameNameRedirect
struct FGameNameRedirect
{
	struct FName OldGameName;  // 0x0 (0x0)
	struct FName NewGameName;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.IntegralKey
struct FIntegralKey
{
	float Time;  // 0x0 (0x0)
	int32_t Value;  // 0x4 (0x4)


}; 
 
 // Function Engine.KismetSystemLibrary.GetLocalCurrencyCode
struct FGetLocalCurrencyCode
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.SceneComponent.GetChildrenComponents
struct FGetChildrenComponents
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bIncludeAllDescendants : 1;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct TArray<struct USceneComponent*> Children;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromClass
struct FGetPrimaryAssetIdFromClass
{
	UObject* Class;  // 0x0 (0x0)
	struct FPrimaryAssetId ReturnValue;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.DPMatchingRulestruct
// Size: 0x68(Inherited: 0x48)
struct FDPMatchingRulestruct : FDPMatchingRulestructBase
{
	struct TArray<struct FDPMatchingRulestructE> OnTrue;  // 0x48 (0x48)
	struct TArray<struct FDPMatchingRulestructE> OnFalse;  // 0x58 (0x58)


}; 
 
 // Function Engine.Actor.GetTransform
struct FGetTransform
{
	struct FTransform ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetLocalCurrencySymbol
struct FGetLocalCurrencySymbol
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.AddForceAtLocation
struct FAddForceAtLocation
{
	struct FVector Force;  // 0x0 (0x0)
	struct FVector Location;  // 0x18 (0x18)
	struct FName BoneName;  // 0x30 (0x30)


}; 
 
 // Function Engine.PrimitiveComponent.GetCenterOfMass
struct FGetCenterOfMass
{
	struct FName BoneName;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.PlayerController.ClientPrestreamTextures
struct FClientPrestreamTextures
{
	struct AActor* ForcedActor;  // 0x0 (0x0)
	float ForceDuration;  // 0x8 (0x8)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool bEnableStreaming : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)
	int32_t CinematicTextureGroups;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetSystemLibrary.GetMinYResolutionFor3DView
struct FGetMinYResolutionFor3DView
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.GetAngularDamping
struct FGetAngularDamping
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.FloatAnimationAttribute
struct FFloatAnimationAttribute
{
	float Value;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.MeshSectionInfo
struct FMeshSectionInfo
{
	int32_t MaterialIndex;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool bEnableCollision : 1;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool bCastShadow : 1;  // 0x5 (0x5)
	char pad_6_1 : 7;  // 0x6 (0x6)
	bool bVisibleInRayTracing : 1;  // 0x6 (0x6)
	char pad_7_1 : 7;  // 0x7 (0x7)
	bool bAffectDistanceFieldLighting : 1;  // 0x7 (0x7)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bForceOpaque : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetMathLibrary.Less_IntInt
struct FLess_IntInt
{
	int32_t A;  // 0x0 (0x0)
	int32_t B;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetSystemLibrary.GetMinYResolutionForUI
struct FGetMinYResolutionForUI
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.NetPushModelHelpers.MarkPropertyDirty
struct FMarkPropertyDirty
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.UniqueNetIdRepl
// Size: 0x30(Inherited: 0x1)
struct FUniqueNetIdRepl : FUniqueNetIdWrapper
{
	char pad_1[31];  // 0x1 (0x1)
	struct TArray<char> ReplicationBytes;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetMathLibrary.FFloor64
struct FFFloor64
{
	double A;  // 0x0 (0x0)
	int64_t ReturnValue;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.AnimBlueprintFunctionData
struct FAnimBlueprintFunctionData
{
	struct TFieldPath<FNone> OutputPoseNodeProperty;  // 0x0 (0x0)
	struct TArray<struct TFieldPath<FNone>> InputPoseNodeProperties;  // 0x20 (0x20)
	struct TArray<struct TFieldPath<FNone>> InputProperties;  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetMathLibrary.FInterpTo_Constant
struct FFInterpTo_Constant
{
	double Current;  // 0x0 (0x0)
	double Target;  // 0x8 (0x8)
	double DeltaTime;  // 0x10 (0x10)
	double InterpSpeed;  // 0x18 (0x18)
	double ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.SceneComponent.GetParentComponents
struct FGetParentComponents
{
	struct TArray<struct USceneComponent*> Parents;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetObjectFromPrimaryAssetId
struct FGetObjectFromPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0 (0x0)
	struct UObject* ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.SetWindowTitle
struct FSetWindowTitle
{
	struct FText Title;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.ScreenMessageString
struct FScreenMessageString
{
	uint64_t Key;  // 0x0 (0x0)
	struct FString ScreenMessage;  // 0x8 (0x8)
	struct FColor DisplayColor;  // 0x18 (0x18)
	float TimeToDisplay;  // 0x1C (0x1C)
	float CurrentTimeDisplayed;  // 0x20 (0x20)
	char pad_36[4];  // 0x24 (0x24)
	struct FVector2D TextScale;  // 0x28 (0x28)


}; 
 
 // Function Engine.KismetSystemLibrary.GetOuterObject
struct FGetOuterObject
{
	struct UObject* Object;  // 0x0 (0x0)
	struct UObject* ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.GetLifeSpan
struct FGetLifeSpan
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.Vector4_Zero
struct FVector4_Zero
{
	struct FVector4 ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.SkinnedMeshComponent.ClearSkinWeightOverride
struct FClearSkinWeightOverride
{
	int32_t LODIndex;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPathName
struct FGetPathName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.GreaterGreater_VectorRotator
struct FGreaterGreater_VectorRotator
{
	struct FVector A;  // 0x0 (0x0)
	struct FRotator B;  // 0x18 (0x18)
	struct FVector ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.ProjectileMovementComponent.IsInterpolationComplete
struct FIsInterpolationComplete
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.SplineComponent.GetRotationAtSplineInputKey
struct FGetRotationAtSplineInputKey
{
	float InKey;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FRotator ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPlatformUserDir
struct FGetPlatformUserDir
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive
struct FSetAllMotorsAngularVelocityDrive
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bEnableSwingDrive : 1;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bEnableTwistDrive : 1;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool bSkipCustomPhysicsType : 1;  // 0x2 (0x2)


}; 
 
 // Function Engine.KismetInputLibrary.PointerEvent_GetTouchpadIndex
struct FPointerEvent_GetTouchpadIndex
{
	struct FPointerEvent Input;  // 0x0 (0x0)
	int32_t ReturnValue;  // 0x98 (0x98)
	char pad_156[4];  // 0x9C (0x9C)


}; 
 
 // Function Engine.SceneComponent.K2_AddWorldOffset
struct FK2_AddWorldOffset
{
	struct FVector DeltaLocation;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bSweep : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FHitResult SweepHitResult;  // 0x20 (0x20)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool bTeleport : 1;  // 0x108 (0x108)
	char pad_265[7];  // 0x109 (0x109)


}; 
 
 // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents
struct FCopyArrayOfMoveIgnoreComponents
{
	struct TArray<struct UPrimitiveComponent*> ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.K2_AddActorLocalOffset
struct FK2_AddActorLocalOffset
{
	struct FVector DeltaLocation;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bSweep : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FHitResult SweepHitResult;  // 0x20 (0x20)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool bTeleport : 1;  // 0x108 (0x108)
	char pad_265[7];  // 0x109 (0x109)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromObject
struct FGetPrimaryAssetIdFromObject
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FPrimaryAssetId ReturnValue;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.CurvePayload
// Size: 0x10(Inherited: 0x1)
struct FCurvePayload : FEmptyPayload
{
	struct FAnimationCurveIdentifier Identifier;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.SeedRandomStream
struct FSeedRandomStream
{
	struct FRandomStream Stream;  // 0x0 (0x0)


}; 
 
 // Function Engine.ParticleSystemComponent.BeginTrails
struct FBeginTrails
{
	struct FName InFirstSocketName;  // 0x0 (0x0)
	struct FName InSecondSocketName;  // 0x8 (0x8)
	enum class ETrailWidthMode InWidthMode;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)
	float InWidth;  // 0x14 (0x14)


}; 
 
 // ScriptStruct Engine.MinimalViewInfo
struct FMinimalViewInfo
{
	struct FVector Location;  // 0x0 (0x0)
	struct FRotator Rotation;  // 0x18 (0x18)
	float FOV;  // 0x30 (0x30)
	float DesiredFOV;  // 0x34 (0x34)
	float OrthoWidth;  // 0x38 (0x38)
	float OrthoNearClipPlane;  // 0x3C (0x3C)
	float OrthoFarClipPlane;  // 0x40 (0x40)
	float PerspectiveNearClipPlane;  // 0x44 (0x44)
	float AspectRatio;  // 0x48 (0x48)
	char bConstrainAspectRatio : 1;  // 0x4C (0x4C)
	char bUseFieldOfViewForLOD : 1;  // 0x4C (0x4C)
	char pad_76_1 : 6;  // 0x4C (0x4C)
	char pad_77[4];  // 0x4D (0x4D)
	enum class ECameraProjectionMode ProjectionMode;  // 0x50 (0x50)
	char pad_81[3];  // 0x51 (0x51)
	float PostProcessBlendWeight;  // 0x54 (0x54)
	char pad_88[8];  // 0x58 (0x58)
	struct FPostProcessSettings PostProcessSettings;  // 0x60 (0x60)
	struct FVector2D OffCenterProjectionOffset;  // 0x740 (0x740)
	char pad_1872[112];  // 0x750 (0x750)


}; 
 
 // Function Engine.KismetSystemLibrary.SetColorPropertyByName
struct FSetColorPropertyByName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)
	struct FColor Value;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdFromSoftClassReference
struct FGetPrimaryAssetIdFromSoftClassReference
{
	struct TSoftClassPtr<UObject> SoftClassReference;  // 0x0 (0x0)
	struct FPrimaryAssetId ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetSystemLibrary.SetSuppressViewportTransitionMessage
struct FSetSuppressViewportTransitionMessage
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bState : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.GameplayStatics.GetAccurateRealTime
struct FGetAccurateRealTime
{
	int32_t Seconds;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	double PartialSeconds;  // 0x8 (0x8)


}; 
 
 // Function Engine.SplineComponent.GetWorldLocationAtSplinePoint
struct FGetWorldLocationAtSplinePoint
{
	int32_t PointIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.AnimSingleNodeInstance.SetPositionWithPreviousTime
struct FSetPositionWithPreviousTime
{
	float InPosition;  // 0x0 (0x0)
	float InPreviousTime;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bFireNotifies : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.GameplayStatics.GetPlayerPawn
struct FGetPlayerPawn
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	int32_t PlayerIndex;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)
	struct APawn* ReturnValue;  // 0x10 (0x10)


}; 
 
 // ScriptStruct Engine.StreamableTexture
struct FStreamableTexture
{
	char pad_0[1];  // 0x0 (0x0)


}; 
 
 // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2
struct FSetCustomPrimitiveDataVector2
{
	int32_t DataIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FVector2D Value;  // 0x8 (0x8)


}; 
 
 // Function Engine.PlayerController.ServerAcknowledgePossession
struct FServerAcknowledgePossession
{
	struct APawn* P;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetPrimaryAssetIdList
struct FGetPrimaryAssetIdList
{
	struct FPrimaryAssetType PrimaryAssetType;  // 0x0 (0x0)
	struct TArray<struct FPrimaryAssetId> OutPrimaryAssetIdList;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetProjectContentDirectory
struct FGetProjectContentDirectory
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.MaterialInstanceDynamic.InitializeScalarParameterAndGetIndex
struct FInitializeScalarParameterAndGetIndex
{
	struct FName ParameterName;  // 0x0 (0x0)
	float Value;  // 0x8 (0x8)
	int32_t OutParameterIndex;  // 0xC (0xC)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)


}; 
 
 // ScriptStruct Engine.BoneSocketTarget
struct FBoneSocketTarget
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bUseSocket : 1;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	struct FBoneReference BoneReference;  // 0x4 (0x4)
	char pad_20[12];  // 0x14 (0x14)
	struct FSocketReference SocketReference;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetSystemLibrary.GetRenderingDetailMode
struct FGetRenderingDetailMode
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.SceneComponent.GetAllSocketNames
struct FGetAllSocketNames
{
	struct TArray<struct FName> ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetRenderingMaterialQualityLevel
struct FGetRenderingMaterialQualityLevel
{
	int32_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetSoftClassReferenceFromPrimaryAssetId
struct FGetSoftClassReferenceFromPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0 (0x0)
	struct TSoftClassPtr<UObject> ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint
struct FGetPhysicsLinearVelocityAtPoint
{
	struct FVector Point;  // 0x0 (0x0)
	struct FName BoneName;  // 0x18 (0x18)
	struct FVector ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.PlayerInput.InvertAxisKey
struct FInvertAxisKey
{
	struct FKey AxisKey;  // 0x0 (0x0)


}; 
 
 // Function Engine.LocalLightComponent.SetIntensityUnits
struct FSetIntensityUnits
{
	uint8_t NewIntensityUnits;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.RPCDoSState
struct FRPCDoSState
{
	char pad_0[8];  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool bLogEscalate : 1;  // 0x8 (0x8)
	char pad_9_1 : 7;  // 0x9 (0x9)
	bool bSendEscalateAnalytics : 1;  // 0x9 (0x9)
	char pad_10_1 : 7;  // 0xA (0xA)
	bool bKickPlayer : 1;  // 0xA (0xA)
	char pad_11_1 : 7;  // 0xB (0xB)
	bool bTrackRecentRPCs : 1;  // 0xB (0xB)
	int16_t EscalateQuotaRPCsPerFrame;  // 0xC (0xC)
	int16_t EscalateTimeQuotaMSPerFrame;  // 0xE (0xE)
	int16_t EscalateQuotaRPCsPerPeriod;  // 0x10 (0x10)
	int16_t EscalateTimeQuotaMSPerPeriod;  // 0x12 (0x12)
	int8_t EscalateQuotaTimePeriod;  // 0x14 (0x14)
	int8_t EscalationCountTolerance;  // 0x15 (0x15)
	int16_t EscalationTimeToleranceMS;  // 0x16 (0x16)
	int16_t RPCRepeatLimitPerPeriod;  // 0x18 (0x18)
	int16_t RPCRepeatLimitMSPerPeriod;  // 0x1A (0x1A)
	int8_t RPCRepeatLimitTimePeriod;  // 0x1C (0x1C)
	char pad_29[1];  // 0x1D (0x1D)
	int16_t CooloffTime;  // 0x1E (0x1E)
	int16_t AutoEscalateTime;  // 0x20 (0x20)
	char pad_34[38];  // 0x22 (0x22)


}; 
 
 // Function Engine.KismetSystemLibrary.GetSoftObjectPath
struct FGetSoftObjectPath
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FSoftObjectPath ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetSystemLibrary.GetSoftObjectReferenceFromPrimaryAssetId
struct FGetSoftObjectReferenceFromPrimaryAssetId
{
	struct FPrimaryAssetId PrimaryAssetId;  // 0x0 (0x0)
	struct TSoftObjectPtr<UObject> ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.GameUserSettings.SetAudioQualityLevel
struct FSetAudioQualityLevel
{
	int32_t QualityLevel;  // 0x0 (0x0)


}; 
 
 // Function Engine.SkinnedMeshComponent.GetParentBone
struct FGetParentBone
{
	struct FName BoneName;  // 0x0 (0x0)
	struct FName ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.Character.RootMotionDebugClientPrintOnScreen
struct FRootMotionDebugClientPrintOnScreen
{
	struct FString InString;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.GetSystemPath
struct FGetSystemPath
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.Actor.SetRayTracingGroupId
struct FSetRayTracingGroupId
{
	int32_t InRaytracingGroupId;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.HasMultipleLocalPlayers
struct FHasMultipleLocalPlayers
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // ScriptStruct Engine.DialogueWaveParameter
struct FDialogueWaveParameter
{
	struct UDialogueWave* DialogueWave;  // 0x0 (0x0)
	struct FDialogueContext Context;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.ExposureSettings
struct FExposureSettings
{
	float FixedEV100;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool bFixed : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)


}; 
 
 // ScriptStruct Engine.CachedAnimRelevancyData
struct FCachedAnimRelevancyData
{
	struct FName StateMachineName;  // 0x0 (0x0)
	struct FName StateName;  // 0x8 (0x8)
	char pad_16[12];  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.IsDedicatedServer
struct FIsDedicatedServer
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetMathLibrary.BreakVector_NetQuantize10
struct FBreakVector_NetQuantize10
{
	struct FVector_NetQuantize10 InVec;  // 0x0 (0x0)
	double X;  // 0x18 (0x18)
	double Y;  // 0x20 (0x20)
	double Z;  // 0x28 (0x28)


}; 
 
 // Function Engine.KismetSystemLibrary.IsInterstitialAdRequested
struct FIsInterstitialAdRequested
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.IsPackagedForDistribution
struct FIsPackagedForDistribution
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.IsLoggedIn
struct FIsLoggedIn
{
	struct APlayerController* SpecificPlayer;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetMathLibrary.ClampAxes2D
struct FClampAxes2D
{
	struct FVector2D A;  // 0x0 (0x0)
	double MinAxisVal;  // 0x10 (0x10)
	double MaxAxisVal;  // 0x18 (0x18)
	struct FVector2D ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.Emitter.SetActorParameter
struct FSetActorParameter
{
	struct FName ParameterName;  // 0x0 (0x0)
	struct AActor* Param;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetMathLibrary.MakeRotFromYZ
struct FMakeRotFromYZ
{
	struct FVector Y;  // 0x0 (0x0)
	struct FVector Z;  // 0x18 (0x18)
	struct FRotator ReturnValue;  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetSystemLibrary.IsScreensaverEnabled
struct FIsScreensaverEnabled
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.PlayerController.WasInputKeyJustPressed
struct FWasInputKeyJustPressed
{
	struct FKey Key;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool ReturnValue : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // Function Engine.KismetSystemLibrary.SetRotatorPropertyByName
struct FSetRotatorPropertyByName
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x8 (0x8)
	struct FRotator Value;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetMathLibrary.GetMinute
struct FGetMinute
{
	struct FDateTime A;  // 0x0 (0x0)
	int32_t ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.SphereComponent.GetScaledSphereRadius
struct FGetScaledSphereRadius
{
	float ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.HUD.DrawMaterialTriangle
struct FDrawMaterialTriangle
{
	struct UMaterialInterface* Material;  // 0x0 (0x0)
	struct FVector2D V0_Pos;  // 0x8 (0x8)
	struct FVector2D V1_Pos;  // 0x18 (0x18)
	struct FVector2D V2_Pos;  // 0x28 (0x28)
	struct FVector2D V0_UV;  // 0x38 (0x38)
	struct FVector2D V1_UV;  // 0x48 (0x48)
	struct FVector2D V2_UV;  // 0x58 (0x58)
	struct FLinearColor V0_Color;  // 0x68 (0x68)
	struct FLinearColor V1_Color;  // 0x78 (0x78)
	struct FLinearColor V2_Color;  // 0x88 (0x88)


}; 
 
 // Function Engine.KismetSystemLibrary.IsServer
struct FIsServer
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.TypedElementWorldInterface.GetPivotOffset
struct FGetPivotOffset
{
	struct FScriptTypedElementHandle InElementHandle;  // 0x0 (0x0)
	struct FVector OutPivotOffset;  // 0x8 (0x8)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)


}; 
 
 // ScriptStruct Engine.SkelMeshSkinWeightInfo
struct FSkelMeshSkinWeightInfo
{
	int32_t Bones[c];  // 0x0 (0x0)
	char Weights[c];  // 0x30 (0x30)


}; 
 
 // Function Engine.KismetSystemLibrary.IsStandalone
struct FIsStandalone
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // SparseDelegateFunction Engine.ActorEndPlaySignature__DelegateSignature
struct FActorEndPlaySignature__DelegateSignature
{
	struct AActor* Actor;  // 0x0 (0x0)
	enum class EEndPlayReason EndPlayReason;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetMathLibrary.GetAbs2D
struct FGetAbs2D
{
	struct FVector2D A;  // 0x0 (0x0)
	struct FVector2D ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetMathLibrary.Vector_UnwindEuler
struct FVector_UnwindEuler
{
	struct FVector A;  // 0x0 (0x0)


}; 
 
 // Function Engine.CharacterMovementComponent.AddImpulse
struct FAddImpulse
{
	struct FVector Impulse;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bVelocityChange : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_SetTimerDelegate
struct FK2_SetTimerDelegate
{
	struct FDelegate Delegate;  // 0x0 (0x0)
	float Time;  // 0x10 (0x10)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool bLooping : 1;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)
	float InitialStartDelay;  // 0x18 (0x18)
	float InitialStartDelayVariance;  // 0x1C (0x1C)
	struct FTimerHandle ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.PrimitiveComponent.AddAngularImpulseInDegrees
struct FAddAngularImpulseInDegrees
{
	struct FVector Impulse;  // 0x0 (0x0)
	struct FName BoneName;  // 0x18 (0x18)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool bVelChange : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)


}; 
 
 // Function Engine.SkeletalMeshComponent.GetIntegerAttribute_Ref
struct FGetIntegerAttribute_Ref
{
	struct FName BoneName;  // 0x0 (0x0)
	struct FName AttributeName;  // 0x8 (0x8)
	int32_t OutValue;  // 0x10 (0x10)
	uint8_t LookupType;  // 0x14 (0x14)
	char pad_21_1 : 7;  // 0x15 (0x15)
	bool ReturnValue : 1;  // 0x15 (0x15)
	char pad_22[2];  // 0x16 (0x16)


}; 
 
 // Function Engine.KismetMathLibrary.Conv_VectorToVector2D
struct FConv_VectorToVector2D
{
	struct FVector InVector;  // 0x0 (0x0)
	struct FVector2D ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetSystemLibrary.IsUnattended
struct FIsUnattended
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool ReturnValue : 1;  // 0x0 (0x0)


}; 
 
 // ScriptStruct Engine.AnimNodeFunctionRef
struct FAnimNodeFunctionRef
{
	struct FName ClassName;  // 0x0 (0x0)
	struct FName FunctionName;  // 0x8 (0x8)
	 Class;  // 0x10 (0x10)
	struct UFunction* Function;  // 0x18 (0x18)


}; 
 
 // Function Engine.AnimationCurveIdentifierExtensions.IsValid
struct FIsValid
{
	struct FAnimationCurveIdentifier Identifier;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)


}; 
 
 // Function Engine.TypedElementWorldInterface.GetRelativeTransform
struct FGetRelativeTransform
{
	struct FScriptTypedElementHandle InElementHandle;  // 0x0 (0x0)
	char pad_8[8];  // 0x8 (0x8)
	struct FTransform OutTransform;  // 0x10 (0x10)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool ReturnValue : 1;  // 0x70 (0x70)
	char pad_113[15];  // 0x71 (0x71)


}; 
 
 // Function Engine.KismetSystemLibrary.IsValidClass
struct FIsValidClass
{
	UObject* Class;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.SplineComponent.FindScaleClosestToWorldLocation
struct FFindScaleClosestToWorldLocation
{
	struct FVector WorldLocation;  // 0x0 (0x0)
	struct FVector ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_ClearAndInvalidateTimerHandle
struct FK2_ClearAndInvalidateTimerHandle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FTimerHandle Handle;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.TimerHandle
struct FTimerHandle
{
	uint64_t Handle;  // 0x0 (0x0)


}; 
 
 // Function Engine.SkeletalMesh.SetMaterials
struct FSetMaterials
{
	struct TArray<struct FSkeletalMaterial> InMaterials;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_ClearTimer
struct FK2_ClearTimer
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.ObjectCookedMetaDataStore
struct FObjectCookedMetaDataStore
{
	struct TMap<struct FName, struct FString> ObjectMetaData;  // 0x0 (0x0)


}; 
 
 // DelegateFunction Engine.PlatformGameInstance.PlatformReceivedLocalNotificationDelegate__DelegateSignature
struct FPlatformReceivedLocalNotificationDelegate__DelegateSignature
{
	struct FString InString;  // 0x0 (0x0)
	int32_t inInt;  // 0x10 (0x10)
	enum class EApplicationState inAppState;  // 0x14 (0x14)
	char pad_21[3];  // 0x15 (0x15)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_GetTimerElapsedTime
struct FK2_GetTimerElapsedTime
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)
	float ReturnValue;  // 0x18 (0x18)
	char pad_28[4];  // 0x1C (0x1C)


}; 
 
 // Function Engine.Exporter.RunAssetExportTasks
struct FRunAssetExportTasks
{
	struct TArray<struct UAssetExportTask*> ExportTasks;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.Actor.GetOverlappingComponents
struct FGetOverlappingComponents
{
	struct TArray<struct UPrimitiveComponent*> OverlappingComponents;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetStringLibrary.GetCharacterArrayFromString
struct FGetCharacterArrayFromString
{
	struct FString SourceString;  // 0x0 (0x0)
	struct TArray<struct FString> ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_GetTimerRemainingTimeDelegate
struct FK2_GetTimerRemainingTimeDelegate
{
	struct FDelegate Delegate;  // 0x0 (0x0)
	float ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_GetTimerRemainingTimeHandle
struct FK2_GetTimerRemainingTimeHandle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FTimerHandle Handle;  // 0x8 (0x8)
	float ReturnValue;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)


}; 
 
 // Function Engine.KismetInputLibrary.Key_IsModifierKey
struct FKey_IsModifierKey
{
	struct FKey Key;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool ReturnValue : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // ScriptStruct Engine.LocalSpacePose
struct FLocalSpacePose
{
	struct TArray<struct FTransform> Transforms;  // 0x0 (0x0)
	struct TArray<struct FName> Names;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_IsTimerActiveDelegate
struct FK2_IsTimerActiveDelegate
{
	struct FDelegate Delegate;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)


}; 
 
 // Function Engine.KismetMathLibrary.Abs
struct FAbs
{
	double A;  // 0x0 (0x0)
	double ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.LODActor.OnSubActorEndPlay
struct FOnSubActorEndPlay
{
	struct AActor* Actor;  // 0x0 (0x0)
	enum class EEndPlayReason Reason;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetStringTableLibrary.GetTableEntryMetaData
struct FGetTableEntryMetaData
{
	struct FName TableId;  // 0x0 (0x0)
	struct FString Key;  // 0x8 (0x8)
	struct FName MetaDataId;  // 0x18 (0x18)
	struct FString ReturnValue;  // 0x20 (0x20)


}; 
 
 // Function Engine.KismetStringLibrary.RightPad
struct FRightPad
{
	struct FString SourceString;  // 0x0 (0x0)
	int32_t ChCount;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)
	struct FString ReturnValue;  // 0x18 (0x18)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_IsTimerActiveHandle
struct FK2_IsTimerActiveHandle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FTimerHandle Handle;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)


}; 
 
 // Function Engine.SkeletalMeshComponent.SetUpdateAnimationInEditor
struct FSetUpdateAnimationInEditor
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool NewUpdateState : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.EnableInput
struct FEnableInput
{
	struct APlayerController* PlayerController;  // 0x0 (0x0)


}; 
 
 // Function Engine.BlueprintPathsLibrary.EnginePluginsDir
struct FEnginePluginsDir
{
	struct FString ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.AnimSingleNodeInstance.SetPosition
struct FSetPosition
{
	float InPosition;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool bFireNotifies : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)


}; 
 
 // SparseDelegateFunction Engine.ComponentSleepSignature__DelegateSignature
struct FComponentSleepSignature__DelegateSignature
{
	struct UPrimitiveComponent* SleepingComponent;  // 0x0 (0x0)
	struct FName BoneName;  // 0x8 (0x8)


}; 
 
 // ScriptStruct Engine.KeyHandleLookupTable
struct FKeyHandleLookupTable
{
	char pad_0[136];  // 0x0 (0x0)


}; 
 
 // Function Engine.Actor.K2_AddActorWorldOffset
struct FK2_AddActorWorldOffset
{
	struct FVector DeltaLocation;  // 0x0 (0x0)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool bSweep : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FHitResult SweepHitResult;  // 0x20 (0x20)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool bTeleport : 1;  // 0x108 (0x108)
	char pad_265[7];  // 0x109 (0x109)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_IsTimerPaused
struct FK2_IsTimerPaused
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool ReturnValue : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_IsTimerPausedDelegate
struct FK2_IsTimerPausedDelegate
{
	struct FDelegate Delegate;  // 0x0 (0x0)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)


}; 
 
 // Function Engine.Actor.GetInstigatorController
struct FGetInstigatorController
{
	struct AController* ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetMathLibrary.LessEqual_IntInt
struct FLessEqual_IntInt
{
	int32_t A;  // 0x0 (0x0)
	int32_t B;  // 0x4 (0x4)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[3];  // 0x9 (0x9)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_IsValidTimerHandle
struct FK2_IsValidTimerHandle
{
	struct FTimerHandle Handle;  // 0x0 (0x0)
	char pad_8_1 : 7;  // 0x8 (0x8)
	bool ReturnValue : 1;  // 0x8 (0x8)
	char pad_9[7];  // 0x9 (0x9)


}; 
 
 // Function Engine.PlayerController.GetInputTouchState
struct FGetInputTouchState
{
	enum class ETouchIndex FingerIndex;  // 0x0 (0x0)
	char pad_1[3];  // 0x1 (0x1)
	float LocationX;  // 0x4 (0x4)
	float LocationY;  // 0x8 (0x8)
	char pad_12_1 : 7;  // 0xC (0xC)
	bool bIsCurrentlyPressed : 1;  // 0xC (0xC)
	char pad_13[3];  // 0xD (0xD)


}; 
 
 // Function Engine.KismetMathLibrary.Xor_Int64Int64
struct FXor_Int64Int64
{
	int64_t A;  // 0x0 (0x0)
	int64_t B;  // 0x8 (0x8)
	int64_t ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.SplineComponent.GetVectorPropertyAtSplinePoint
struct FGetVectorPropertyAtSplinePoint
{
	int32_t Index;  // 0x0 (0x0)
	struct FName PropertyName;  // 0x4 (0x4)
	char pad_12[4];  // 0xC (0xC)
	struct FVector ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_PauseTimerDelegate
struct FK2_PauseTimerDelegate
{
	struct FDelegate Delegate;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetInputLibrary.GetAnalogValue
struct FGetAnalogValue
{
	struct FAnalogInputEvent Input;  // 0x0 (0x0)
	float ReturnValue;  // 0x48 (0x48)
	char pad_76[4];  // 0x4C (0x4C)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_PauseTimerHandle
struct FK2_PauseTimerHandle
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FTimerHandle Handle;  // 0x8 (0x8)


}; 
 
 // Function Engine.SplineComponent.SetDrawDebug
struct FSetDrawDebug
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool bShow : 1;  // 0x0 (0x0)


}; 
 
 // Function Engine.KismetSystemLibrary.SphereTraceSingleForObjects
struct FSphereTraceSingleForObjects
{
	struct UObject* WorldContextObject;  // 0x0 (0x0)
	struct FVector Start;  // 0x8 (0x8)
	struct FVector End;  // 0x20 (0x20)
	float Radius;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)
	struct TArray<enum class EObjectTypeQuery> ObjectTypes;  // 0x40 (0x40)
	char pad_80_1 : 7;  // 0x50 (0x50)
	bool bTraceComplex : 1;  // 0x50 (0x50)
	char pad_81[7];  // 0x51 (0x51)
	struct TArray<struct AActor*> ActorsToIgnore;  // 0x58 (0x58)
	enum class EDrawDebugTrace DrawDebugType;  // 0x68 (0x68)
	char pad_105[7];  // 0x69 (0x69)
	struct FHitResult OutHit;  // 0x70 (0x70)
	char pad_344_1 : 7;  // 0x158 (0x158)
	bool bIgnoreSelf : 1;  // 0x158 (0x158)
	char pad_345[3];  // 0x159 (0x159)
	struct FLinearColor TraceColor;  // 0x15C (0x15C)
	struct FLinearColor TraceHitColor;  // 0x16C (0x16C)
	float DrawTime;  // 0x17C (0x17C)
	char pad_384_1 : 7;  // 0x180 (0x180)
	bool ReturnValue : 1;  // 0x180 (0x180)
	char pad_385[7];  // 0x181 (0x181)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_SetTimerForNextTick
struct FK2_SetTimerForNextTick
{
	struct UObject* Object;  // 0x0 (0x0)
	struct FString FunctionName;  // 0x8 (0x8)
	struct FTimerHandle ReturnValue;  // 0x18 (0x18)


}; 
 
 // ScriptStruct Engine.AnimNode_Root
// Size: 0x20(Inherited: 0x10)
struct FAnimNode_Root : FAnimNode_Base
{
	struct FPoseLink Result;  // 0x10 (0x10)


}; 
 
 // Function Engine.PlayerController.ProjectWorldLocationToScreen
struct FProjectWorldLocationToScreen
{
	struct FVector WorldLocation;  // 0x0 (0x0)
	struct FVector2D ScreenLocation;  // 0x18 (0x18)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool bPlayerViewportRelative : 1;  // 0x28 (0x28)
	char pad_41_1 : 7;  // 0x29 (0x29)
	bool ReturnValue : 1;  // 0x29 (0x29)
	char pad_42[6];  // 0x2A (0x2A)


}; 
 
 // Function Engine.SplineComponent.GetRightVectorAtTime
struct FGetRightVectorAtTime
{
	float Time;  // 0x0 (0x0)
	enum class ESplineCoordinateSpace CoordinateSpace;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool bUseConstantVelocity : 1;  // 0x5 (0x5)
	char pad_6[2];  // 0x6 (0x6)
	struct FVector ReturnValue;  // 0x8 (0x8)


}; 
 
 // Function Engine.KismetInputLibrary.EqualEqual_KeyKey
struct FEqualEqual_KeyKey
{
	struct FKey A;  // 0x0 (0x0)
	struct FKey B;  // 0x18 (0x18)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)


}; 
 
 // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial
struct FCreateAndSetMaterialInstanceDynamicFromMaterial
{
	int32_t ElementIndex;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UMaterialInterface* Parent;  // 0x8 (0x8)
	struct UMaterialInstanceDynamic* ReturnValue;  // 0x10 (0x10)


}; 
 
 // Function Engine.KismetMathLibrary.GetMinutes
struct FGetMinutes
{
	struct FTimespan A;  // 0x0 (0x0)
	int32_t ReturnValue;  // 0x8 (0x8)
	char pad_12[4];  // 0xC (0xC)


}; 
 
 // Function Engine.KismetSystemLibrary.K2_SetTimerForNextTickDelegate
struct FK2_SetTimerForNextTickDelegate
{
