#pragma once 
#include <Engine_Structs.h>
 
 
 
// Class Engine.Player
// Size: 0x48(Inherited: 0x28)
struct UPlayer : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	struct APlayerController* PlayerController;  // 0x30 (0x30)
	int32_t CurrentNetSpeed;  // 0x38 (0x38)
	int32_t ConfiguredInternetSpeed;  // 0x3C (0x3C)
	int32_t ConfiguredLanSpeed;  // 0x40 (0x40)
	char pad_68[4];  // 0x44 (0x44)


}; 
 
 


// Class Engine.Actor
// Size: 0x290(Inherited: 0x28)
struct AActor : UObject
{
	struct FActorTickFunction PrimaryActorTick;  // 0x28 (0x28)
	char bNetTemporary : 1;  // 0x58 (0x58)
	char pad_88_1 : 1;  // 0x58 (0x58)
	char bOnlyRelevantToOwner : 1;  // 0x58 (0x58)
	char bAlwaysRelevant : 1;  // 0x58 (0x58)
	char bReplicateMovement : 1;  // 0x58 (0x58)
	char bCallPreReplication : 1;  // 0x58 (0x58)
	char bCallPreReplicationForReplay : 1;  // 0x58 (0x58)
	char bHidden : 1;  // 0x58 (0x58)
	char bTearOff : 1;  // 0x59 (0x59)
	char bForceNetAddressable : 1;  // 0x59 (0x59)
	char bExchangedRoles : 1;  // 0x59 (0x59)
	char bNetLoadOnClient : 1;  // 0x59 (0x59)
	char bNetUseOwnerRelevancy : 1;  // 0x59 (0x59)
	char bRelevantForNetworkReplays : 1;  // 0x59 (0x59)
	char bRelevantForLevelBounds : 1;  // 0x59 (0x59)
	char bReplayRewindable : 1;  // 0x59 (0x59)
	char bAllowTickBeforeBeginPlay : 1;  // 0x5A (0x5A)
	char bAutoDestroyWhenFinished : 1;  // 0x5A (0x5A)
	char bCanBeDamaged : 1;  // 0x5A (0x5A)
	char bBlockInput : 1;  // 0x5A (0x5A)
	char bCollideWhenPlacing : 1;  // 0x5A (0x5A)
	char bFindCameraComponentWhenViewTarget : 1;  // 0x5A (0x5A)
	char bGenerateOverlapEventsDuringLevelStreaming : 1;  // 0x5A (0x5A)
	char bIgnoresOriginShifting : 1;  // 0x5A (0x5A)
	char bEnableAutoLODGeneration : 1;  // 0x5B (0x5B)
	char bIsEditorOnlyActor : 1;  // 0x5B (0x5B)
	char bActorSeamlessTraveled : 1;  // 0x5B (0x5B)
	char bReplicates : 1;  // 0x5B (0x5B)
	char bCanBeInCluster : 1;  // 0x5B (0x5B)
	char bAllowReceiveTickEventOnDedicatedServer : 1;  // 0x5B (0x5B)
	char pad_91_1 : 1;  // 0x5B (0x5B)
	char bReplicateUsingRegisteredSubObjectList : 1;  // 0x5B (0x5B)
	char pad_92_1 : 7;  // 0x5C (0x5C)
	char bActorEnableCollision : 1;  // 0x5C (0x5C)
	char bActorIsBeingDestroyed : 1;  // 0x5D (0x5D)
	char pad_93_1 : 4;  // 0x5D (0x5D)
	char bAsyncPhysicsTickEnabled : 1;  // 0x5D (0x5D)
	char pad_93_2 : 2;  // 0x5D (0x5D)
	uint8_t UpdateOverlapsMethodDuringLevelStreaming;  // 0x5E (0x5E)
	uint8_t DefaultUpdateOverlapsMethodDuringLevelStreaming;  // 0x5F (0x5F)
	float InitialLifeSpan;  // 0x60 (0x60)
	float CustomTimeDilation;  // 0x64 (0x64)
	enum class ENetRole RemoteRole;  // 0x68 (0x68)
	char pad_105[3];  // 0x69 (0x69)
	int32_t RayTracingGroupId;  // 0x6C (0x6C)
	struct FRepAttachment AttachmentReplication;  // 0x70 (0x70)
	struct FRepMovement ReplicatedMovement;  // 0xD0 (0xD0)
	struct AActor* Owner;  // 0x140 (0x140)
	struct FName NetDriverName;  // 0x148 (0x148)
	enum class ENetRole Role;  // 0x150 (0x150)
	enum class ENetDormancy NetDormancy;  // 0x151 (0x151)
	uint8_t SpawnCollisionHandlingMethod;  // 0x152 (0x152)
	enum class EAutoReceiveInput AutoReceiveInput;  // 0x153 (0x153)
	int32_t InputPriority;  // 0x154 (0x154)
	char pad_344[8];  // 0x158 (0x158)
	struct UInputComponent* InputComponent;  // 0x160 (0x160)
	float NetCullDistanceSquared;  // 0x168 (0x168)
	int32_t NetTag;  // 0x16C (0x16C)
	float NetUpdateFrequency;  // 0x170 (0x170)
	float MinNetUpdateFrequency;  // 0x174 (0x174)
	float NetPriority;  // 0x178 (0x178)
	char pad_380[4];  // 0x17C (0x17C)
	struct APawn* Instigator;  // 0x180 (0x180)
	struct TArray<struct AActor*> Children;  // 0x188 (0x188)
	struct USceneComponent* RootComponent;  // 0x198 (0x198)
	char pad_416[8];  // 0x1A0 (0x1A0)
	struct TArray<struct FName> Layers;  // 0x1A8 (0x1A8)
	struct TWeakObjectPtr<UChildActorComponent> ParentComponent;  // 0x1B8 (0x1B8)
	struct TArray<struct FName> Tags;  // 0x1C0 (0x1C0)
	struct FMulticastSparseDelegate OnTakeAnyDamage;  // 0x1D0 (0x1D0)
	struct FMulticastSparseDelegate OnTakePointDamage;  // 0x1D1 (0x1D1)
	struct FMulticastSparseDelegate OnTakeRadialDamage;  // 0x1D2 (0x1D2)
	struct FMulticastSparseDelegate OnActorBeginOverlap;  // 0x1D3 (0x1D3)
	struct FMulticastSparseDelegate OnActorEndOverlap;  // 0x1D4 (0x1D4)
	struct FMulticastSparseDelegate OnBeginCursorOver;  // 0x1D5 (0x1D5)
	struct FMulticastSparseDelegate OnEndCursorOver;  // 0x1D6 (0x1D6)
	struct FMulticastSparseDelegate OnClicked;  // 0x1D7 (0x1D7)
	struct FMulticastSparseDelegate OnReleased;  // 0x1D8 (0x1D8)
	struct FMulticastSparseDelegate OnInputTouchBegin;  // 0x1D9 (0x1D9)
	struct FMulticastSparseDelegate OnInputTouchEnd;  // 0x1DA (0x1DA)
	struct FMulticastSparseDelegate OnInputTouchEnter;  // 0x1DB (0x1DB)
	struct FMulticastSparseDelegate OnInputTouchLeave;  // 0x1DC (0x1DC)
	struct FMulticastSparseDelegate OnActorHit;  // 0x1DD (0x1DD)
	struct FMulticastSparseDelegate OnDestroyed;  // 0x1DE (0x1DE)
	struct FMulticastSparseDelegate OnEndPlay;  // 0x1DF (0x1DF)
	char pad_480[128];  // 0x1E0 (0x1E0)
	struct TArray<struct UActorComponent*> InstanceComponents;  // 0x260 (0x260)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents;  // 0x270 (0x270)
	char pad_640[16];  // 0x280 (0x280)


	bool WasRecentlyRendered(float Tolerance); // Function Engine.Actor.WasRecentlyRendered
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript
	void TearOff(); // Function Engine.Actor.TearOff
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.Actor.SetTickGroup
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.Actor.SetTickableWhenPaused
	void SetReplicates(bool bInReplicates); // Function Engine.Actor.SetReplicates
	void SetReplicateMovement(bool bInReplicateMovement); // Function Engine.Actor.SetReplicateMovement
	void SetRayTracingGroupId(int32_t InRaytracingGroupId); // Function Engine.Actor.SetRayTracingGroupId
	void SetOwner(struct AActor* NewOwner); // Function Engine.Actor.SetOwner
	void SetNetDormancy(enum class ENetDormancy NewDormancy); // Function Engine.Actor.SetNetDormancy
	void SetLifeSpan(float InLifespan); // Function Engine.Actor.SetLifeSpan
	void SetAutoDestroyWhenFinished(bool bVal); // Function Engine.Actor.SetAutoDestroyWhenFinished
	void SetActorTickInterval(float TickInterval); // Function Engine.Actor.SetActorTickInterval
	void SetActorTickEnabled(bool bEnabled); // Function Engine.Actor.SetActorTickEnabled
	void SetActorScale3D(struct FVector NewScale3D); // Function Engine.Actor.SetActorScale3D
	void SetActorRelativeScale3D(struct FVector NewRelativeScale); // Function Engine.Actor.SetActorRelativeScale3D
	void SetActorHiddenInGame(bool bNewHidden); // Function Engine.Actor.SetActorHiddenInGame
	void SetActorEnableCollision(bool bNewActorEnableCollision); // Function Engine.Actor.SetActorEnableCollision
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.RemoveTickPrerequisiteComponent
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.RemoveTickPrerequisiteActor
	void ReceiveTick(float DeltaSeconds); // Function Engine.Actor.ReceiveTick
	void ReceiveRadialDamage(float DamageReceived, struct UDamageType* DamageType, struct FVector Origin, struct FHitResult& HitInfo, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveRadialDamage
	void ReceivePointDamage(float Damage, struct UDamageType* DamageType, struct FVector HitLocation, struct FVector HitNormal, struct UPrimitiveComponent* HitComponent, struct FName BoneName, struct FVector ShotFromDirection, struct AController* InstigatedBy, struct AActor* DamageCauser, struct FHitResult& HitInfo); // Function Engine.Actor.ReceivePointDamage
	void ReceiveHit(struct UPrimitiveComponent* MyComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Engine.Actor.ReceiveHit
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.Actor.ReceiveEndPlay
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds); // Function Engine.Actor.ReceiveAsyncPhysicsTick
	void ReceiveAnyDamage(float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage
	void ReceiveActorOnReleased(struct FKey ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave
	void ReceiveActorOnInputTouchEnter(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnter
	void ReceiveActorOnInputTouchEnd(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnd
	void ReceiveActorOnInputTouchBegin(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchBegin
	void ReceiveActorOnClicked(struct FKey ButtonPressed); // Function Engine.Actor.ReceiveActorOnClicked
	void ReceiveActorEndOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorEndOverlap
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.Actor.PrestreamTextures
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation, float MaxRange, struct FName Tag); // Function Engine.Actor.MakeNoise
	bool K2_TeleportTo(struct FVector DestLocation, struct FRotator DestRotation); // Function Engine.Actor.K2_TeleportTo
	bool K2_SetActorTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorTransform
	bool K2_SetActorRotation(struct FRotator NewRotation, bool bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation
	void K2_SetActorRelativeTransform(struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeRotation
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation
	bool K2_SetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocationAndRotation
	bool K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset
	void K2_OnEndViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnEndViewTarget
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget
	struct USceneComponent* K2_GetRootComponent(); // Function Engine.Actor.K2_GetRootComponent
	struct TArray<struct UActorComponent*> K2_GetComponentsByClass(UActorComponent* ComponentClass); // Function Engine.Actor.K2_GetComponentsByClass
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation
	struct FVector K2_GetActorLocation(); // Function Engine.Actor.K2_GetActorLocation
	void K2_DetachFromActor(uint8_t LocationRule, uint8_t RotationRule, uint8_t ScaleRule); // Function Engine.Actor.K2_DetachFromActor
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor
	void K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, uint8_t LocationRule, uint8_t RotationRule, uint8_t ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToComponent
	void K2_AttachToActor(struct AActor* ParentActor, struct FName SocketName, uint8_t LocationRule, uint8_t RotationRule, uint8_t ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToActor
	void K2_AttachRootComponentToActor(struct AActor* InParentActor, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentToActor
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentTo
	void K2_AddActorWorldTransformKeepScale(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransformKeepScale
	void K2_AddActorWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation
	void K2_AddActorWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldOffset
	void K2_AddActorLocalTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform
	void K2_AddActorLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalOffset
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.Actor.IsOverlappingActor
	bool IsChildActor(); // Function Engine.Actor.IsChildActor
	bool IsActorTickEnabled(); // Function Engine.Actor.IsActorTickEnabled
	bool IsActorBeingDestroyed(); // Function Engine.Actor.IsActorBeingDestroyed
	bool HasAuthority(); // Function Engine.Actor.HasAuthority
	float GetVerticalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetVerticalDistanceTo
	struct FVector GetVelocity(); // Function Engine.Actor.GetVelocity
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform
	bool GetTickableWhenPaused(); // Function Engine.Actor.GetTickableWhenPaused
	float GetSquaredHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetSquaredHorizontalDistanceTo
	float GetSquaredDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetSquaredDistanceTo
	enum class ENetRole GetRemoteRole(); // Function Engine.Actor.GetRemoteRole
	int32_t GetRayTracingGroupId(); // Function Engine.Actor.GetRayTracingGroupId
	struct UChildActorComponent* GetParentComponent(); // Function Engine.Actor.GetParentComponent
	struct AActor* GetParentActor(); // Function Engine.Actor.GetParentActor
	struct AActor* GetOwner(); // Function Engine.Actor.GetOwner
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, AActor* ClassFilter); // Function Engine.Actor.GetOverlappingActors
	enum class ENetRole GetLocalRole(); // Function Engine.Actor.GetLocalRole
	float GetLifeSpan(); // Function Engine.Actor.GetLifeSpan
	struct FTransform GetLevelTransform(); // Function Engine.Actor.GetLevelTransform
	struct ULevel* GetLevel(); // Function Engine.Actor.GetLevel
	struct AController* GetInstigatorController(); // Function Engine.Actor.GetInstigatorController
	struct APawn* GetInstigator(); // Function Engine.Actor.GetInstigator
	struct FVector GetInputVectorAxisValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputVectorAxisValue
	float GetInputAxisValue(struct FName InputAxisName); // Function Engine.Actor.GetInputAxisValue
	float GetInputAxisKeyValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputAxisKeyValue
	float GetHorizontalDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDotProductTo
	float GetHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDistanceTo
	float GetGameTimeSinceCreation(); // Function Engine.Actor.GetGameTimeSinceCreation
	float GetDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetDotProductTo
	float GetDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetDistanceTo
	struct TArray<struct UActorComponent*> GetComponentsByTag(UActorComponent* ComponentClass, struct FName Tag); // Function Engine.Actor.GetComponentsByTag
	struct TArray<struct UActorComponent*> GetComponentsByInterface(UInterface* Interface); // Function Engine.Actor.GetComponentsByInterface
	struct UActorComponent* GetComponentByClass(UActorComponent* ComponentClass); // Function Engine.Actor.GetComponentByClass
	struct FName GetAttachParentSocketName(); // Function Engine.Actor.GetAttachParentSocketName
	struct AActor* GetAttachParentActor(); // Function Engine.Actor.GetAttachParentActor
	void GetAttachedActors(struct TArray<struct AActor*>& OutActors, bool bResetArray, bool bRecursivelyIncludeAttachedActors); // Function Engine.Actor.GetAttachedActors
	void GetAllChildActors(struct TArray<struct AActor*>& ChildActors, bool bIncludeDescendants); // Function Engine.Actor.GetAllChildActors
	struct FVector GetActorUpVector(); // Function Engine.Actor.GetActorUpVector
	float GetActorTimeDilation(); // Function Engine.Actor.GetActorTimeDilation
	float GetActorTickInterval(); // Function Engine.Actor.GetActorTickInterval
	struct FVector GetActorScale3D(); // Function Engine.Actor.GetActorScale3D
	struct FVector GetActorRightVector(); // Function Engine.Actor.GetActorRightVector
	struct FVector GetActorRelativeScale3D(); // Function Engine.Actor.GetActorRelativeScale3D
	struct FVector GetActorForwardVector(); // Function Engine.Actor.GetActorForwardVector
	void GetActorEyesViewPoint(struct FVector& OutLocation, struct FRotator& OutRotation); // Function Engine.Actor.GetActorEyesViewPoint
	bool GetActorEnableCollision(); // Function Engine.Actor.GetActorEnableCollision
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector& Origin, struct FVector& BoxExtent, bool bIncludeFromChildActors); // Function Engine.Actor.GetActorBounds
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate
	void FlushNetDormancy(); // Function Engine.Actor.FlushNetDormancy
	void FinishAddComponent(struct UActorComponent* Component, bool bManualAttachment, struct FTransform& RelativeTransform); // Function Engine.Actor.FinishAddComponent
	void EnableInput(struct APlayerController* PlayerController); // Function Engine.Actor.EnableInput
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.AddTickPrerequisiteComponent
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.AddTickPrerequisiteActor
	struct UActorComponent* AddComponentByClass(UActorComponent* Class, bool bManualAttachment, struct FTransform& RelativeTransform, bool bDeferredFinish); // Function Engine.Actor.AddComponentByClass
	struct UActorComponent* AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform& RelativeTransform, struct UObject* ComponentTemplateContext, bool bDeferredFinish); // Function Engine.Actor.AddComponent
	bool ActorHasTag(struct FName Tag); // Function Engine.Actor.ActorHasTag
}; 
 
 


// Class Engine.MaterialExpressionStrataThinFilm
// Size: 0x128(Inherited: 0xB0)
struct UMaterialExpressionStrataThinFilm : UMaterialExpressionStrataBSDF
{
	struct FExpressionInput A;  // 0xB0 (0xB0)
	struct FExpressionInput Thickness;  // 0xD8 (0xD8)
	struct FExpressionInput IOR;  // 0x100 (0x100)


}; 
 
 


// Class Engine.HUD
// Size: 0x380(Inherited: 0x290)
struct AHUD : AActor
{
	struct APlayerController* PlayerOwner;  // 0x290 (0x290)
	char bLostFocusPaused : 1;  // 0x298 (0x298)
	char bShowHUD : 1;  // 0x298 (0x298)
	char bShowDebugInfo : 1;  // 0x298 (0x298)
	char pad_664_1 : 5;  // 0x298 (0x298)
	char pad_665[4];  // 0x299 (0x299)
	int32_t CurrentTargetIndex;  // 0x29C (0x29C)
	char bShowHitBoxDebugInfo : 1;  // 0x2A0 (0x2A0)
	char bShowOverlays : 1;  // 0x2A0 (0x2A0)
	char bEnableDebugTextShadow : 1;  // 0x2A0 (0x2A0)
	char pad_672_1 : 5;  // 0x2A0 (0x2A0)
	char pad_673[8];  // 0x2A1 (0x2A1)
	struct TArray<struct AActor*> PostRenderedActors;  // 0x2A8 (0x2A8)
	char pad_696[8];  // 0x2B8 (0x2B8)
	struct TArray<struct FName> DebugDisplay;  // 0x2C0 (0x2C0)
	struct TArray<struct FName> ToggledDebugCategories;  // 0x2D0 (0x2D0)
	struct UCanvas* Canvas;  // 0x2E0 (0x2E0)
	struct UCanvas* DebugCanvas;  // 0x2E8 (0x2E8)
	struct TArray<struct FDebugTextInfo> DebugTextList;  // 0x2F0 (0x2F0)
	AActor* ShowDebugTargetDesiredClass;  // 0x300 (0x300)
	struct AActor* ShowDebugTargetActor;  // 0x308 (0x308)
	char pad_784[112];  // 0x310 (0x310)


	void ShowHUD(); // Function Engine.HUD.ShowHUD
	void ShowDebugToggleSubCategory(struct FName Category); // Function Engine.HUD.ShowDebugToggleSubCategory
	void ShowDebugForReticleTargetToggle(AActor* DesiredClass); // Function Engine.HUD.ShowDebugForReticleTargetToggle
	void ShowDebug(struct FName DebugType); // Function Engine.HUD.ShowDebug
	void RemoveDebugText(struct AActor* SrcActor, bool bLeaveDurationText); // Function Engine.HUD.RemoveDebugText
	void RemoveAllDebugStrings(); // Function Engine.HUD.RemoveAllDebugStrings
	void ReceiveHitBoxRelease(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxRelease
	void ReceiveHitBoxEndCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxEndCursorOver
	void ReceiveHitBoxClick(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxClick
	void ReceiveHitBoxBeginCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver
	void ReceiveDrawHUD(int32_t SizeX, int32_t SizeY); // Function Engine.HUD.ReceiveDrawHUD
	struct FVector Project(struct FVector Location, bool bClampToZeroPlane); // Function Engine.HUD.Project
	void PreviousDebugTarget(); // Function Engine.HUD.PreviousDebugTarget
	void NextDebugTarget(); // Function Engine.HUD.NextDebugTarget
	void GetTextSize(struct FString Text, float& OutWidth, float& OutHeight, struct UFont* Font, float Scale); // Function Engine.HUD.GetTextSize
	struct APlayerController* GetOwningPlayerController(); // Function Engine.HUD.GetOwningPlayerController
	struct APawn* GetOwningPawn(); // Function Engine.HUD.GetOwningPawn
	void GetActorsInSelectionRectangle(AActor* ClassFilter, struct FVector2D& FirstPoint, struct FVector2D& SecondPoint, struct TArray<struct AActor*>& OutActors, bool bIncludeNonCollidingComponents, bool bActorMustBeFullyEnclosed); // Function Engine.HUD.GetActorsInSelectionRectangle
	void DrawTextureSimple(struct UTexture* Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition); // Function Engine.HUD.DrawTextureSimple
	void DrawTexture(struct UTexture* Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, struct FLinearColor TintColor, enum class EBlendMode BlendMode, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot); // Function Engine.HUD.DrawTexture
	void DrawText(struct FString Text, struct FLinearColor TextColor, float ScreenX, float ScreenY, struct UFont* Font, float Scale, bool bScalePosition); // Function Engine.HUD.DrawText
	void DrawRect(struct FLinearColor RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH); // Function Engine.HUD.DrawRect
	void DrawMaterialTriangle(struct UMaterialInterface* Material, struct FVector2D V0_Pos, struct FVector2D V1_Pos, struct FVector2D V2_Pos, struct FVector2D V0_UV, struct FVector2D V1_UV, struct FVector2D V2_UV, struct FLinearColor V0_Color, struct FLinearColor V1_Color, struct FLinearColor V2_Color); // Function Engine.HUD.DrawMaterialTriangle
	void DrawMaterialSimple(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition); // Function Engine.HUD.DrawMaterialSimple
	void DrawMaterial(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot); // Function Engine.HUD.DrawMaterial
	void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, struct FLinearColor LineColor, float LineThickness); // Function Engine.HUD.DrawLine
	void Deproject(float ScreenX, float ScreenY, struct FVector& WorldPosition, struct FVector& WorldDirection); // Function Engine.HUD.Deproject
	void AddHitBox(struct FVector2D Position, struct FVector2D Size, struct FName InName, bool bConsumesInput, int32_t Priority); // Function Engine.HUD.AddHitBox
	void AddDebugText(struct FString DebugText, struct AActor* SrcActor, float Duration, struct FVector Offset, struct FVector DesiredOffset, struct FColor TextColor, bool bSkipOverwriteCheck, bool bAbsoluteLocation, bool bKeepAttachedToActor, struct UFont* InFont, float FontScale, bool bDrawShadow); // Function Engine.HUD.AddDebugText
}; 
 
 


// Class Engine.LightMapVirtualTexture2D
// Size: 0x2C0(Inherited: 0x2B0)
struct ULightMapVirtualTexture2D : UTexture2D
{
	struct TArray<int8_t> TypeToLayer;  // 0x2A8 (0x2A8)


}; 
 
 


// Class Engine.MaterialExpressionSobol
// Size: 0x140(Inherited: 0xB0)
struct UMaterialExpressionSobol : UMaterialExpression
{
	struct FExpressionInput Cell;  // 0xB0 (0xB0)
	struct FExpressionInput Index;  // 0xD8 (0xD8)
	struct FExpressionInput Seed;  // 0x100 (0x100)
	uint32_t ConstIndex;  // 0x128 (0x128)
	char pad_300[4];  // 0x12C (0x12C)
	struct FVector2D ConstSeed;  // 0x130 (0x130)


}; 
 
 


// Class Engine.MaterialExpressionSign
// Size: 0xD8(Inherited: 0xB0)
struct UMaterialExpressionSign : UMaterialExpression
{
	struct FExpressionInput Input;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.GameInstanceSubsystem
// Size: 0x30(Inherited: 0x30)
struct UGameInstanceSubsystem : USubsystem
{


}; 
 
 


// Class Engine.DataLayerInstance
// Size: 0x48(Inherited: 0x28)
struct UDataLayerInstance : UObject
{
	uint8_t InitialRuntimeState;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)
	struct UDataLayerInstance* Parent;  // 0x30 (0x30)
	struct TArray<struct UDataLayerInstance*> Children;  // 0x38 (0x38)


	bool IsVisible(); // Function Engine.DataLayerInstance.IsVisible
	bool IsRuntime(); // Function Engine.DataLayerInstance.IsRuntime
	bool IsInitiallyVisible(); // Function Engine.DataLayerInstance.IsInitiallyVisible
	bool IsEffectiveVisible(); // Function Engine.DataLayerInstance.IsEffectiveVisible
	uint8_t GetType(); // Function Engine.DataLayerInstance.GetType
	uint8_t GetInitialRuntimeState(); // Function Engine.DataLayerInstance.GetInitialRuntimeState
	struct FColor GetDebugColor(); // Function Engine.DataLayerInstance.GetDebugColor
}; 
 
 


// Class Engine.MaterialExpressionMapARPassthroughCameraUV
// Size: 0xD8(Inherited: 0xB0)
struct UMaterialExpressionMapARPassthroughCameraUV : UMaterialExpression
{
	struct FExpressionInput Coordinates;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.MaterialExpressionConstant4Vector
// Size: 0xC0(Inherited: 0xB0)
struct UMaterialExpressionConstant4Vector : UMaterialExpression
{
	struct FLinearColor Constant;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.ParticleModuleVectorFieldRotationRate
// Size: 0x48(Inherited: 0x30)
struct UParticleModuleVectorFieldRotationRate : UParticleModuleVectorFieldBase
{
	struct FVector RotationRate;  // 0x30 (0x30)


}; 
 
 


// Class Engine.MaterialExpressionStrataMetalnessToDiffuseAlbedoF0
// Size: 0x128(Inherited: 0xB0)
struct UMaterialExpressionStrataMetalnessToDiffuseAlbedoF0 : UMaterialExpressionStrataUtilityBase
{
	struct FExpressionInput BaseColor;  // 0xB0 (0xB0)
	struct FExpressionInput Metallic;  // 0xD8 (0xD8)
	struct FExpressionInput Specular;  // 0x100 (0x100)


}; 
 
 


// Class Engine.BlueprintAsyncActionBase
// Size: 0x30(Inherited: 0x28)
struct UBlueprintAsyncActionBase : UObject
{
	char pad_40[8];  // 0x28 (0x28)


	void Activate(); // Function Engine.BlueprintAsyncActionBase.Activate
}; 
 
 


// Class Engine.AnimBlueprint
// Size: 0xD0(Inherited: 0xA8)
struct UAnimBlueprint : UBlueprint
{
	char pad_168[8];  // 0xA8 (0xA8)
	struct USkeleton* TargetSkeleton;  // 0xB0 (0xB0)
	struct TArray<struct FAnimGroupInfo> Groups;  // 0xB8 (0xB8)
	char pad_200_1 : 7;  // 0xC8 (0xC8)
	bool bIsTemplate : 1;  // 0xC8 (0xC8)
	char pad_201_1 : 7;  // 0xC9 (0xC9)
	bool bUseMultiThreadedAnimationUpdate : 1;  // 0xC9 (0xC9)
	char pad_202_1 : 7;  // 0xCA (0xCA)
	bool bWarnAboutBlueprintUsage : 1;  // 0xCA (0xCA)
	char pad_203[5];  // 0xCB (0xCB)


}; 
 
 


// Class Engine.ParticleModuleLocationEmitter
// Size: 0x50(Inherited: 0x30)
struct UParticleModuleLocationEmitter : UParticleModuleLocationBase
{
	struct FName EmitterName;  // 0x30 (0x30)
	enum class ELocationEmitterSelectionMethod SelectionMethod;  // 0x38 (0x38)
	char pad_57[3];  // 0x39 (0x39)
	char InheritSourceVelocity : 1;  // 0x3C (0x3C)
	char pad_60_1 : 7;  // 0x3C (0x3C)
	char pad_61[4];  // 0x3D (0x3D)
	float InheritSourceVelocityScale;  // 0x40 (0x40)
	char bInheritSourceRotation : 1;  // 0x44 (0x44)
	char pad_68_1 : 7;  // 0x44 (0x44)
	char pad_69[4];  // 0x45 (0x45)
	float InheritSourceRotationScale;  // 0x48 (0x48)
	char pad_76[4];  // 0x4C (0x4C)


}; 
 
 


// Class Engine.SceneCaptureComponent
// Size: 0x360(Inherited: 0x2A0)
struct USceneCaptureComponent : USceneComponent
{
	uint8_t PrimitiveRenderMode;  // 0x2A0 (0x2A0)
	enum class ESceneCaptureSource CaptureSource;  // 0x2A1 (0x2A1)
	char bCaptureEveryFrame : 1;  // 0x2A2 (0x2A2)
	char bCaptureOnMovement : 1;  // 0x2A2 (0x2A2)
	char pad_674_1 : 6;  // 0x2A2 (0x2A2)
	char pad_675_1 : 7;  // 0x2A3 (0x2A3)
	bool bAlwaysPersistRenderingState : 1;  // 0x2A3 (0x2A3)
	char pad_676[4];  // 0x2A4 (0x2A4)
	struct TArray<struct TWeakObjectPtr<UPrimitiveComponent>> HiddenComponents;  // 0x2A8 (0x2A8)
	struct TArray<struct AActor*> HiddenActors;  // 0x2B8 (0x2B8)
	struct TArray<struct TWeakObjectPtr<UPrimitiveComponent>> ShowOnlyComponents;  // 0x2C8 (0x2C8)
	struct TArray<struct AActor*> ShowOnlyActors;  // 0x2D8 (0x2D8)
	float LODDistanceFactor;  // 0x2E8 (0x2E8)
	float MaxViewDistanceOverride;  // 0x2EC (0x2EC)
	int32_t CaptureSortPriority;  // 0x2F0 (0x2F0)
	char pad_756_1 : 7;  // 0x2F4 (0x2F4)
	bool bUseRayTracingIfEnabled : 1;  // 0x2F4 (0x2F4)
	char pad_757[3];  // 0x2F5 (0x2F5)
	struct TArray<struct FEngineShowFlagsSetting> ShowFlagSettings;  // 0x2F8 (0x2F8)
	char pad_776[48];  // 0x308 (0x308)
	struct FString ProfilingEventName;  // 0x338 (0x338)
	char pad_840[24];  // 0x348 (0x348)


	void ShowOnlyComponent(struct UPrimitiveComponent* InComponent); // Function Engine.SceneCaptureComponent.ShowOnlyComponent
	void ShowOnlyActorComponents(struct AActor* InActor, bool bIncludeFromChildActors); // Function Engine.SceneCaptureComponent.ShowOnlyActorComponents
	void SetCaptureSortPriority(int32_t NewCaptureSortPriority); // Function Engine.SceneCaptureComponent.SetCaptureSortPriority
	void RemoveShowOnlyComponent(struct UPrimitiveComponent* InComponent); // Function Engine.SceneCaptureComponent.RemoveShowOnlyComponent
	void RemoveShowOnlyActorComponents(struct AActor* InActor, bool bIncludeFromChildActors); // Function Engine.SceneCaptureComponent.RemoveShowOnlyActorComponents
	void HideComponent(struct UPrimitiveComponent* InComponent); // Function Engine.SceneCaptureComponent.HideComponent
	void HideActorComponents(struct AActor* InActor, bool bIncludeFromChildActors); // Function Engine.SceneCaptureComponent.HideActorComponents
	void ClearShowOnlyComponents(); // Function Engine.SceneCaptureComponent.ClearShowOnlyComponents
	void ClearHiddenComponents(); // Function Engine.SceneCaptureComponent.ClearHiddenComponents
}; 
 
 


// Class Engine.NetConnection
// Size: 0x3310(Inherited: 0x48)
struct UNetConnection : UPlayer
{
	struct TArray<struct UChildConnection*> Children;  // 0x48 (0x48)
	struct UNetDriver* Driver;  // 0x58 (0x58)
	UPackageMap* PackageMapClass;  // 0x60 (0x60)
	struct UPackageMap* PackageMap;  // 0x68 (0x68)
	struct TArray<struct UChannel*> OpenChannels;  // 0x70 (0x70)
	struct TArray<struct AActor*> SentTemporaries;  // 0x80 (0x80)
	struct AActor* ViewTarget;  // 0x90 (0x90)
	struct AActor* OwningActor;  // 0x98 (0x98)
	int32_t MaxPacket;  // 0xA0 (0xA0)
	char InternalAck : 1;  // 0xA4 (0xA4)
	char pad_164_1 : 7;  // 0xA4 (0xA4)
	char pad_165[188];  // 0xA5 (0xA5)
	struct FUniqueNetIdRepl PlayerId;  // 0x160 (0x160)
	char pad_400[72];  // 0x190 (0x190)
	double LastReceiveTime;  // 0x1D8 (0x1D8)
	char pad_480[4576];  // 0x1E0 (0x1E0)
	int32_t DefaultMaxChannelSize;  // 0x13C0 (0x13C0)
	char pad_5060[644];  // 0x13C4 (0x13C4)
	struct TArray<struct UChannel*> ChannelsToTick;  // 0x1648 (0x1648)
	char pad_5720[7352];  // 0x1658 (0x1658)


}; 
 
 


// Class Engine.AudioComponent
// Size: 0xC60(Inherited: 0x2A0)
struct UAudioComponent : USceneComponent
{
	char pad_672[408];  // 0x2A0 (0x2A0)
	struct USoundBase* Sound;  // 0x438 (0x438)
	struct TArray<struct FAudioParameter> DefaultParameters;  // 0x440 (0x440)
	struct TArray<struct FAudioParameter> InstanceParameters;  // 0x450 (0x450)
	struct USoundClass* SoundClassOverride;  // 0x460 (0x460)
	char bAutoDestroy : 1;  // 0x468 (0x468)
	char bStopWhenOwnerDestroyed : 1;  // 0x468 (0x468)
	char bShouldRemainActiveIfDropped : 1;  // 0x468 (0x468)
	char bAllowSpatialization : 1;  // 0x468 (0x468)
	char bOverrideAttenuation : 1;  // 0x468 (0x468)
	char bOverrideSubtitlePriority : 1;  // 0x468 (0x468)
	char bIsUISound : 1;  // 0x468 (0x468)
	char bEnableLowPassFilter : 1;  // 0x468 (0x468)
	char bOverridePriority : 1;  // 0x469 (0x469)
	char bSuppressSubtitles : 1;  // 0x469 (0x469)
	char bCanPlayMultipleInstances : 1;  // 0x469 (0x469)
	char bDisableParameterUpdatesWhilePlaying : 1;  // 0x469 (0x469)
	char pad_1129_1 : 4;  // 0x469 (0x469)
	char pad_1130_1 : 6;  // 0x46A (0x46A)
	char bAutoManageAttachment : 1;  // 0x46A (0x46A)
	char pad_1130_2 : 1;  // 0x46A (0x46A)
	char pad_1131[6];  // 0x46B (0x46B)
	struct FName AudioComponentUserID;  // 0x470 (0x470)
	float PitchModulationMin;  // 0x478 (0x478)
	float PitchModulationMax;  // 0x47C (0x47C)
	float VolumeModulationMin;  // 0x480 (0x480)
	float VolumeModulationMax;  // 0x484 (0x484)
	float VolumeMultiplier;  // 0x488 (0x488)
	int32_t EnvelopeFollowerAttackTime;  // 0x48C (0x48C)
	int32_t EnvelopeFollowerReleaseTime;  // 0x490 (0x490)
	float Priority;  // 0x494 (0x494)
	float SubtitlePriority;  // 0x498 (0x498)
	char pad_1180[4];  // 0x49C (0x49C)
	struct USoundEffectSourcePresetChain* SourceEffectChain;  // 0x4A0 (0x4A0)
	float PitchMultiplier;  // 0x4A8 (0x4A8)
	float LowPassFilterFrequency;  // 0x4AC (0x4AC)
	char pad_1200[8];  // 0x4B0 (0x4B0)
	struct USoundAttenuation* AttenuationSettings;  // 0x4B8 (0x4B8)
	struct FSoundAttenuationSettings AttenuationOverrides;  // 0x4C0 (0x4C0)
	struct USoundConcurrency* ConcurrencySettings;  // 0x888 (0x888)
	struct TSet<struct USoundConcurrency*> ConcurrencySet;  // 0x890 (0x890)
	char pad_2272[12];  // 0x8E0 (0x8E0)
	uint8_t AutoAttachLocationRule;  // 0x8EC (0x8EC)
	uint8_t AutoAttachRotationRule;  // 0x8ED (0x8ED)
	uint8_t AutoAttachScaleRule;  // 0x8EE (0x8EE)
	char pad_2287[1];  // 0x8EF (0x8EF)
	struct FSoundModulationDefaultRoutingSettings ModulationRouting;  // 0x8F0 (0x8F0)
	struct FMulticastInlineDelegate OnAudioPlayStateChanged;  // 0xA78 (0xA78)
	char pad_2696[24];  // 0xA88 (0xA88)
	struct FMulticastInlineDelegate OnAudioVirtualizationChanged;  // 0xAA0 (0xAA0)
	char pad_2736[24];  // 0xAB0 (0xAB0)
	struct FMulticastInlineDelegate OnAudioFinished;  // 0xAC8 (0xAC8)
	char pad_2776[24];  // 0xAD8 (0xAD8)
	struct FMulticastInlineDelegate OnAudioPlaybackPercent;  // 0xAF0 (0xAF0)
	char pad_2816[24];  // 0xB00 (0xB00)
	struct FMulticastInlineDelegate OnAudioSingleEnvelopeValue;  // 0xB18 (0xB18)
	char pad_2856[24];  // 0xB28 (0xB28)
	struct FMulticastInlineDelegate OnAudioMultiEnvelopeValue;  // 0xB40 (0xB40)
	char pad_2896[24];  // 0xB50 (0xB50)
	struct FDelegate OnQueueSubtitles;  // 0xB68 (0xB68)
	char pad_2936[16];  // 0xB78 (0xB78)
	struct TWeakObjectPtr<USceneComponent> AutoAttachParent;  // 0xB88 (0xB88)
	struct FName AutoAttachSocketName;  // 0xB90 (0xB90)
	char pad_2968[200];  // 0xB98 (0xB98)


	void StopDelayed(float DelayTime); // Function Engine.AudioComponent.StopDelayed
	void Stop(); // Function Engine.AudioComponent.Stop
	void SetWaveParameter(struct FName InName, struct USoundWave* InWave); // Function Engine.AudioComponent.SetWaveParameter
	void SetVolumeMultiplier(float NewVolumeMultiplier); // Function Engine.AudioComponent.SetVolumeMultiplier
	void SetUISound(bool bInUISound); // Function Engine.AudioComponent.SetUISound
	void SetSubmixSend(struct USoundSubmixBase* Submix, float SendLevel); // Function Engine.AudioComponent.SetSubmixSend
	void SetSourceBusSendPreEffect(struct USoundSourceBus* SoundSourceBus, float SourceBusSendLevel); // Function Engine.AudioComponent.SetSourceBusSendPreEffect
	void SetSourceBusSendPostEffect(struct USoundSourceBus* SoundSourceBus, float SourceBusSendLevel); // Function Engine.AudioComponent.SetSourceBusSendPostEffect
	void SetSound(struct USoundBase* NewSound); // Function Engine.AudioComponent.SetSound
	void SetPitchMultiplier(float NewPitchMultiplier); // Function Engine.AudioComponent.SetPitchMultiplier
	void SetPaused(bool bPause); // Function Engine.AudioComponent.SetPaused
	void SetOutputToBusOnly(bool bInOutputToBusOnly); // Function Engine.AudioComponent.SetOutputToBusOnly
	void SetLowPassFilterFrequency(float InLowPassFilterFrequency); // Function Engine.AudioComponent.SetLowPassFilterFrequency
	void SetLowPassFilterEnabled(bool InLowPassFilterEnabled); // Function Engine.AudioComponent.SetLowPassFilterEnabled
	void SetIntParameter(struct FName InName, int32_t inInt); // Function Engine.AudioComponent.SetIntParameter
	void SetFloatParameter(struct FName InName, float InFloat); // Function Engine.AudioComponent.SetFloatParameter
	void SetBoolParameter(struct FName InName, bool InBool); // Function Engine.AudioComponent.SetBoolParameter
	void SetAudioBusSendPreEffect(struct UAudioBus* AudioBus, float AudioBusSendLevel); // Function Engine.AudioComponent.SetAudioBusSendPreEffect
	void SetAudioBusSendPostEffect(struct UAudioBus* AudioBus, float AudioBusSendLevel); // Function Engine.AudioComponent.SetAudioBusSendPostEffect
	void PlayQuantized(struct UObject* WorldContextObject, struct UQuartzClockHandle*& InClockHandle, struct FQuartzQuantizationBoundary& InQuantizationBoundary, struct FDelegate& InDelegate, float InStartTime, float InFadeInDuration, float InFadeVolumeLevel, uint8_t InFadeCurve); // Function Engine.AudioComponent.PlayQuantized
	void Play(float StartTime); // Function Engine.AudioComponent.Play
	bool IsVirtualized(); // Function Engine.AudioComponent.IsVirtualized
	bool IsPlaying(); // Function Engine.AudioComponent.IsPlaying
	bool HasCookedFFTData(); // Function Engine.AudioComponent.HasCookedFFTData
	bool HasCookedAmplitudeEnvelopeData(); // Function Engine.AudioComponent.HasCookedAmplitudeEnvelopeData
	uint8_t GetPlayState(); // Function Engine.AudioComponent.GetPlayState
	bool GetCookedFFTDataForAllPlayingSounds(struct TArray<struct FSoundWaveSpectralDataPerSound>& OutSoundWaveSpectralData); // Function Engine.AudioComponent.GetCookedFFTDataForAllPlayingSounds
	bool GetCookedFFTData(struct TArray<float>& FrequenciesToGet, struct TArray<struct FSoundWaveSpectralData>& OutSoundWaveSpectralData); // Function Engine.AudioComponent.GetCookedFFTData
	bool GetCookedEnvelopeDataForAllPlayingSounds(struct TArray<struct FSoundWaveEnvelopeDataPerSound>& OutEnvelopeData); // Function Engine.AudioComponent.GetCookedEnvelopeDataForAllPlayingSounds
	bool GetCookedEnvelopeData(float& OutEnvelopeData); // Function Engine.AudioComponent.GetCookedEnvelopeData
	void FadeOut(float FadeOutDuration, float FadeVolumeLevel, uint8_t FadeCurve); // Function Engine.AudioComponent.FadeOut
	void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime, uint8_t FadeCurve); // Function Engine.AudioComponent.FadeIn
	bool BP_GetAttenuationSettingsToApply(struct FSoundAttenuationSettings& OutAttenuationSettings); // Function Engine.AudioComponent.BP_GetAttenuationSettingsToApply
	void AdjustVolume(float AdjustVolumeDuration, float AdjustVolumeLevel, uint8_t FadeCurve); // Function Engine.AudioComponent.AdjustVolume
	void AdjustAttenuation(struct FSoundAttenuationSettings& InAttenuationSettings); // Function Engine.AudioComponent.AdjustAttenuation
}; 
 
 


// Class Engine.MaterialExpressionSkyAtmosphereLightDirection
// Size: 0xB8(Inherited: 0xB0)
struct UMaterialExpressionSkyAtmosphereLightDirection : UMaterialExpression
{
	int32_t LightIndex;  // 0xB0 (0xB0)
	char pad_180[4];  // 0xB4 (0xB4)


}; 
 
 


// Class Engine.BuiltInAttributesExtensions
// Size: 0x28(Inherited: 0x28)
struct UBuiltInAttributesExtensions : UBlueprintFunctionLibrary
{


}; 
 
 


// Class Engine.GameSession
// Size: 0x2A8(Inherited: 0x290)
struct AGameSession : AInfo
{
	int32_t MaxSpectators;  // 0x290 (0x290)
	int32_t MaxPlayers;  // 0x294 (0x294)
	int32_t MaxPartySize;  // 0x298 (0x298)
	char MaxSplitscreensPerConnection;  // 0x29C (0x29C)
	char pad_669_1 : 7;  // 0x29D (0x29D)
	bool bRequiresPushToTalk : 1;  // 0x29D (0x29D)
	char pad_670[2];  // 0x29E (0x29E)
	struct FName SessionName;  // 0x2A0 (0x2A0)


}; 
 
 


// Class Engine.SkeletalMeshLODSettings
// Size: 0xB8(Inherited: 0x30)
struct USkeletalMeshLODSettings : UDataAsset
{
	struct FPerQualityLevelInt MinQualityLevelLOD;  // 0x30 (0x30)
	struct FPerPlatformInt MinLOD;  // 0x98 (0x98)
	struct FPerPlatformBool DisableBelowMinLodStripping;  // 0x9C (0x9C)
	char pad_157_1 : 7;  // 0x9D (0x9D)
	bool bOverrideLODStreamingSettings : 1;  // 0x9D (0x9D)
	struct FPerPlatformBool bSupportLODStreaming;  // 0x9E (0x9E)
	char pad_159[1];  // 0x9F (0x9F)
	struct FPerPlatformInt MaxNumStreamedLODs;  // 0xA0 (0xA0)
	struct FPerPlatformInt MaxNumOptionalLODs;  // 0xA4 (0xA4)
	struct TArray<struct FSkeletalMeshLODGroupSettings> LODGroups;  // 0xA8 (0xA8)


}; 
 
 


// Class Engine.DistributionFloatConstant
// Size: 0x40(Inherited: 0x38)
struct UDistributionFloatConstant : UDistributionFloat
{
	float Constant;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)


}; 
 
 


// Class Engine.Exporter
// Size: 0x78(Inherited: 0x28)
struct UExporter : UObject
{
	UObject* SupportedClass;  // 0x28 (0x28)
	struct UObject* ExportRootScope;  // 0x30 (0x30)
	struct TArray<struct FString> FormatExtension;  // 0x38 (0x38)
	struct TArray<struct FString> FormatDescription;  // 0x48 (0x48)
	int32_t PreferredFormatIndex;  // 0x58 (0x58)
	int32_t TextIndent;  // 0x5C (0x5C)
	char bText : 1;  // 0x60 (0x60)
	char bSelectedOnly : 1;  // 0x60 (0x60)
	char bForceFileOperations : 1;  // 0x60 (0x60)
	char pad_96_1 : 5;  // 0x60 (0x60)
	char pad_97[8];  // 0x61 (0x61)
	struct UAssetExportTask* ExportTask;  // 0x68 (0x68)
	char pad_112[8];  // 0x70 (0x70)


	bool ScriptRunAssetExportTask(struct UAssetExportTask* Task); // Function Engine.Exporter.ScriptRunAssetExportTask
	bool RunAssetExportTasks(struct TArray<struct UAssetExportTask*>& ExportTasks); // Function Engine.Exporter.RunAssetExportTasks
	bool RunAssetExportTask(struct UAssetExportTask* Task); // Function Engine.Exporter.RunAssetExportTask
}; 
 
 


// Class Engine.CancellableAsyncAction
// Size: 0x30(Inherited: 0x30)
struct UCancellableAsyncAction : UBlueprintAsyncActionBase
{


	bool IsActive(); // Function Engine.CancellableAsyncAction.IsActive
	void Cancel(); // Function Engine.CancellableAsyncAction.Cancel
}; 
 
 


// Class Engine.OnlineEngineInterface
// Size: 0x28(Inherited: 0x28)
struct UOnlineEngineInterface : UObject
{


}; 
 
 


// Class Engine.PathFollowingAgentInterface
// Size: 0x28(InheriPackage28)
struct UPathFollowingAgentInterface : UInterface
{


}; 
 
 


// Class Engine.DataAsset
// Size: 0x30(Inherited: 0x28)
struct UDataAsset : UObject
{
	UDataAsset* NativeClass;  // 0x28 (0x28)


}; 
 
 


// Class Engine.KismetTextLibrary
// Size: 0x28(Inherited: 0x28)
struct UKismetTextLibrary : UBlueprintFunctionLibrary
{


	struct FText TextTrimTrailing(struct FText& InText); // Function Engine.KismetTextLibrary.TextTrimTrailing
	struct FText TextTrimPrecedingAndTrailing(struct FText& InText); // Function Engine.KismetTextLibrary.TextTrimPrecedingAndTrailing
	struct FText TextTrimPreceding(struct FText& InText); // Function Engine.KismetTextLibrary.TextTrimPreceding
	struct FText TextToUpper(struct FText& InText); // Function Engine.KismetTextLibrary.TextToUpper
	struct FText TextToLower(struct FText& InText); // Function Engine.KismetTextLibrary.TextToLower
	bool TextIsTransient(struct FText& InText); // Function Engine.KismetTextLibrary.TextIsTransient
	bool TextIsFromStringTable(struct FText& Text); // Function Engine.KismetTextLibrary.TextIsFromStringTable
	bool TextIsEmpty(struct FText& InText); // Function Engine.KismetTextLibrary.TextIsEmpty
	bool TextIsCultureInvariant(struct FText& InText); // Function Engine.KismetTextLibrary.TextIsCultureInvariant
	struct FText TextFromStringTable(struct FName TableId, struct FString Key); // Function Engine.KismetTextLibrary.TextFromStringTable
	bool StringTableIdAndKeyFromText(struct FText Text, struct FName& OutTableId, struct FString& OutKey); // Function Engine.KismetTextLibrary.StringTableIdAndKeyFromText
	struct FText PolyglotDataToText(struct FPolyglotTextData& PolyglotData); // Function Engine.KismetTextLibrary.PolyglotDataToText
	bool NotEqual_TextText(struct FText& A, struct FText& B); // Function Engine.KismetTextLibrary.NotEqual_TextText
	bool NotEqual_IgnoreCase_TextText(struct FText& A, struct FText& B); // Function Engine.KismetTextLibrary.NotEqual_IgnoreCase_TextText
	void IsPolyglotDataValid(struct FPolyglotTextData& PolyglotData, bool& IsValid, struct FText& ErrorMessage); // Function Engine.KismetTextLibrary.IsPolyglotDataValid
	struct FText GetEmptyText(); // Function Engine.KismetTextLibrary.GetEmptyText
	struct FText Format(struct FText InPattern, struct TArray<struct FFormatArgumentData> InArgs); // Function Engine.KismetTextLibrary.Format
	bool FindTextInLocalizationTable(struct FString Namespace, struct FString Key, struct FText& OutText); // Function Engine.KismetTextLibrary.FindTextInLocalizationTable
	bool EqualEqual_TextText(struct FText& A, struct FText& B); // Function Engine.KismetTextLibrary.EqualEqual_TextText
	bool EqualEqual_IgnoreCase_TextText(struct FText& A, struct FText& B); // Function Engine.KismetTextLibrary.EqualEqual_IgnoreCase_TextText
	struct FText Conv_VectorToText(struct FVector InVec); // Function Engine.KismetTextLibrary.Conv_VectorToText
	struct FText Conv_Vector2dToText(struct FVector2D InVec); // Function Engine.KismetTextLibrary.Conv_Vector2dToText
	struct FText Conv_TransformToText(struct FTransform& InTrans); // Function Engine.KismetTextLibrary.Conv_TransformToText
	struct FString Conv_TextToString(struct FText& InText); // Function Engine.KismetTextLibrary.Conv_TextToString
	struct FText Conv_StringToText(struct FString InString); // Function Engine.KismetTextLibrary.Conv_StringToText
	struct FText Conv_RotatorToText(struct FRotator InRot); // Function Engine.KismetTextLibrary.Conv_RotatorToText
	struct FText Conv_ObjectToText(struct UObject* InObj); // Function Engine.KismetTextLibrary.Conv_ObjectToText
	struct FText Conv_NameToText(struct FName InName); // Function Engine.KismetTextLibrary.Conv_NameToText
	struct FText Conv_IntToText(int32_t Value, bool bAlwaysSign, bool bUseGrouping, int32_t MinimumIntegralDigits, int32_t MaximumIntegralDigits); // Function Engine.KismetTextLibrary.Conv_IntToText
	struct FText Conv_Int64ToText(int64_t Value, bool bAlwaysSign, bool bUseGrouping, int32_t MinimumIntegralDigits, int32_t MaximumIntegralDigits); // Function Engine.KismetTextLibrary.Conv_Int64ToText
	struct FText Conv_DoubleToText(double Value, enum class ERoundingMode RoundingMode, bool bAlwaysSign, bool bUseGrouping, int32_t MinimumIntegralDigits, int32_t MaximumIntegralDigits, int32_t MinimumFractionalDigits, int32_t MaximumFractionalDigits); // Function Engine.KismetTextLibrary.Conv_DoubleToText
	struct FText Conv_ColorToText(struct FLinearColor InColor); // Function Engine.KismetTextLibrary.Conv_ColorToText
	struct FText Conv_ByteToText(char Value); // Function Engine.KismetTextLibrary.Conv_ByteToText
	struct FText Conv_BoolToText(bool InBool); // Function Engine.KismetTextLibrary.Conv_BoolToText
	struct FText AsTimeZoneTime_DateTime(struct FDateTime& InDateTime, struct FString InTimeZone); // Function Engine.KismetTextLibrary.AsTimeZoneTime_DateTime
	struct FText AsTimeZoneDateTime_DateTime(struct FDateTime& InDateTime, struct FString InTimeZone); // Function Engine.KismetTextLibrary.AsTimeZoneDateTime_DateTime
	struct FText AsTimeZoneDate_DateTime(struct FDateTime& InDateTime, struct FString InTimeZone); // Function Engine.KismetTextLibrary.AsTimeZoneDate_DateTime
	struct FText AsTimespan_Timespan(struct FTimespan& InTimespan); // Function Engine.KismetTextLibrary.AsTimespan_Timespan
	struct FText AsTime_DateTime(struct FDateTime& In); // Function Engine.KismetTextLibrary.AsTime_DateTime
	struct FText AsPercent_Float(float Value, enum class ERoundingMode RoundingMode, bool bAlwaysSign, bool bUseGrouping, int32_t MinimumIntegralDigits, int32_t MaximumIntegralDigits, int32_t MinimumFractionalDigits, int32_t MaximumFractionalDigits); // Function Engine.KismetTextLibrary.AsPercent_Float
	struct FText AsDateTime_DateTime(struct FDateTime& In); // Function Engine.KismetTextLibrary.AsDateTime_DateTime
	struct FText AsDate_DateTime(struct FDateTime& InDateTime); // Function Engine.KismetTextLibrary.AsDate_DateTime
	struct FText AsCurrencyBase(int32_t BaseValue, struct FString CurrencyCode); // Function Engine.KismetTextLibrary.AsCurrencyBase
	struct FText AsCurrency_Integer(int32_t Value, enum class ERoundingMode RoundingMode, bool bAlwaysSign, bool bUseGrouping, int32_t MinimumIntegralDigits, int32_t MaximumIntegralDigits, int32_t MinimumFractionalDigits, int32_t MaximumFractionalDigits, struct FString CurrencyCode); // Function Engine.KismetTextLibrary.AsCurrency_Integer
	struct FText AsCurrency_Float(float Value, enum class ERoundingMode RoundingMode, bool bAlwaysSign, bool bUseGrouping, int32_t MinimumIntegralDigits, int32_t MaximumIntegralDigits, int32_t MinimumFractionalDigits, int32_t MaximumFractionalDigits, struct FString CurrencyCode); // Function Engine.KismetTextLibrary.AsCurrency_Float
}; 
 
 


// Class Engine.TickableWorldSubsystem
// Size: 0x40(Inherited: 0x30)
struct UTickableWorldSubsystem : UWorldSubsystem
{
	char pad_48[16];  // 0x30 (0x30)


}; 
 
 


// Class Engine.VirtualTexturePoolConfig
// Size: 0x40(Inherited: 0x28)
struct UVirtualTexturePoolConfig : UObject
{
	int32_t DefaultSizeInMegabyte;  // 0x28 (0x28)
	char pad_44[4];  // 0x2C (0x2C)
	struct TArray<struct FVirtualTextureSpacePoolConfig> Pools;  // 0x30 (0x30)


}; 
 
 


// Class Engine.MaterialExpressionSamplePhysicsScalarField
// Size: 0xE0(Inherited: 0xB0)
struct UMaterialExpressionSamplePhysicsScalarField : UMaterialExpression
{
	struct FExpressionInput WorldPosition;  // 0xB0 (0xB0)
	enum class EFieldScalarType FieldTarget;  // 0xD8 (0xD8)
	char pad_217[7];  // 0xD9 (0xD9)


}; 
 
 


// Class Engine.RuntimeSpatialHashExternalStreamingObject
// Size: 0xF0(Inherited: 0x90)
struct URuntimeSpatialHashExternalStreamingObject : URuntimeHashExternalStreamingObjectBase
{
	struct TArray<struct FSpatialHashStreamingGrid> StreamingGrids;  // 0x90 (0x90)
	struct TMap<struct FName, struct FName> CellToLevelStreamingPackage;  // 0xA0 (0xA0)


}; 
 
 


// Class Engine.Pawn
// Size: 0x318(Inherited: 0x290)
struct APawn : AActor
{
	char pad_656[8];  // 0x290 (0x290)
	char bUseControllerRotationPitch : 1;  // 0x298 (0x298)
	char bUseControllerRotationYaw : 1;  // 0x298 (0x298)
	char bUseControllerRotationRoll : 1;  // 0x298 (0x298)
	char bCanAffectNavigationGeneration : 1;  // 0x298 (0x298)
	char pad_664_1 : 2;  // 0x298 (0x298)
	char bIsLocalViewTarget : 1;  // 0x298 (0x298)
	char pad_664_2 : 1;  // 0x298 (0x298)
	char pad_665[4];  // 0x299 (0x299)
	float BaseEyeHeight;  // 0x29C (0x29C)
	enum class EAutoReceiveInput AutoPossessPlayer;  // 0x2A0 (0x2A0)
	uint8_t AutoPossessAI;  // 0x2A1 (0x2A1)
	char RemoteViewPitch;  // 0x2A2 (0x2A2)
	char pad_675[5];  // 0x2A3 (0x2A3)
	AController* AIControllerClass;  // 0x2A8 (0x2A8)
	struct APlayerState* PlayerState;  // 0x2B0 (0x2B0)
	char pad_696[8];  // 0x2B8 (0x2B8)
	struct AController* LastHitBy;  // 0x2C0 (0x2C0)
	struct AController* Controller;  // 0x2C8 (0x2C8)
	struct AController* PreviousController;  // 0x2D0 (0x2D0)
	char pad_728[4];  // 0x2D8 (0x2D8)
	struct FMulticastSparseDelegate ReceiveControllerChangedDelegate;  // 0x2DC (0x2DC)
	struct FMulticastSparseDelegate ReceiveRestartedDelegate;  // 0x2DD (0x2DD)
	char pad_734[2];  // 0x2DE (0x2DE)
	struct FVector ControlInputVector;  // 0x2E0 (0x2E0)
	struct FVector LastControlInputVector;  // 0x2F8 (0x2F8)
	UInputComponent* OverrideInputComponentClass;  // 0x310 (0x310)


	void SpawnDefaultController(); // Function Engine.Pawn.SpawnDefaultController
	void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate); // Function Engine.Pawn.SetCanAffectNavigationGeneration
	void ReceiveUnpossessed(struct AController* OldController); // Function Engine.Pawn.ReceiveUnpossessed
	void ReceiveRestarted(); // Function Engine.Pawn.ReceiveRestarted
	void ReceivePossessed(struct AController* NewController); // Function Engine.Pawn.ReceivePossessed
	void ReceiveControllerChanged(struct AController* OldController, struct AController* NewController); // Function Engine.Pawn.ReceiveControllerChanged
	void PawnMakeNoise(float Loudness, struct FVector NoiseLocation, bool bUseNoiseMakerLocation, struct AActor* NoiseMaker); // Function Engine.Pawn.PawnMakeNoise
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller
	bool IsPlayerControlled(); // Function Engine.Pawn.IsPlayerControlled
	bool IsPawnControlled(); // Function Engine.Pawn.IsPawnControlled
	bool IsMoveInputIgnored(); // Function Engine.Pawn.IsMoveInputIgnored
	bool IsLocallyViewed(); // Function Engine.Pawn.IsLocallyViewed
	bool IsLocallyControlled(); // Function Engine.Pawn.IsLocallyControlled
	bool IsControlled(); // Function Engine.Pawn.IsControlled
	bool IsBotControlled(); // Function Engine.Pawn.IsBotControlled
	struct FVector GetPendingMovementInputVector(); // Function Engine.Pawn.GetPendingMovementInputVector
	UInputComponent* GetOverrideInputComponentClass(); // Function Engine.Pawn.GetOverrideInputComponentClass
	struct FVector GetNavAgentLocation(); // Function Engine.Pawn.GetNavAgentLocation
	struct UPawnMovementComponent* GetMovementComponent(); // Function Engine.Pawn.GetMovementComponent
	struct AActor* GetMovementBaseActor(struct APawn* Pawn); // Function Engine.Pawn.GetMovementBaseActor
	struct APlayerController* GetLocalViewingPlayerController(); // Function Engine.Pawn.GetLocalViewingPlayerController
	struct FVector GetLastMovementInputVector(); // Function Engine.Pawn.GetLastMovementInputVector
	struct FRotator GetControlRotation(); // Function Engine.Pawn.GetControlRotation
	struct AController* GetController(); // Function Engine.Pawn.GetController
	struct FRotator GetBaseAimRotation(); // Function Engine.Pawn.GetBaseAimRotation
	void DetachFromControllerPendingDestroy(); // Function Engine.Pawn.DetachFromControllerPendingDestroy
	struct FVector ConsumeMovementInputVector(); // Function Engine.Pawn.ConsumeMovementInputVector
	void AddMovementInput(struct FVector WorldDirection, float ScaleValue, bool bForce); // Function Engine.Pawn.AddMovementInput
	void AddControllerYawInput(float Val); // Function Engine.Pawn.AddControllerYawInput
	void AddControllerRollInput(float Val); // Function Engine.Pawn.AddControllerRollInput
	void AddControllerPitchInput(float Val); // Function Engine.Pawn.AddControllerPitchInput
}; 
 
 


// Class Engine.PhysicsVolume
// Size: 0x2D8(Inherited: 0x2C8)
struct APhysicsVolume : AVolume
{
	float TerminalVelocity;  // 0x2C8 (0x2C8)
	int32_t Priority;  // 0x2CC (0x2CC)
	float FluidFriction;  // 0x2D0 (0x2D0)
	char bWaterVolume : 1;  // 0x2D4 (0x2D4)
	char bPhysicsOnContact : 1;  // 0x2D4 (0x2D4)
	char pad_724_1 : 6;  // 0x2D4 (0x2D4)
	char pad_725[4];  // 0x2D5 (0x2D5)


}; 
 
 


// Class Engine.MaterialExpressionObjectOrientation
// Size: 0xB0(Inherited: 0xB0)
struct UMaterialExpressionObjectOrientation : UMaterialExpression
{


}; 
 
 


// Class Engine.MaterialExpressionDecalMipmapLevel
// Size: 0xE0(Inherited: 0xB0)
struct UMaterialExpressionDecalMipmapLevel : UMaterialExpression
{
	struct FExpressionInput TextureSize;  // 0xB0 (0xB0)
	float ConstWidth;  // 0xD8 (0xD8)
	float ConstHeight;  // 0xDC (0xDC)


}; 
 
 


// Class Engine.MaterialExpressionParticleDirection
// Size: 0xB0(Inherited: 0xB0)
struct UMaterialExpressionParticleDirection : UMaterialExpression
{


}; 
 
 


// Class Engine.BlueprintFunctionLibrary
// Size: 0x28(Inherited: 0x28)
struct UBlueprintFunctionLibrary : UObject
{


}; 
 
 


// Class Engine.MaterialExpressionHairColor
// Size: 0x128(Inherited: 0xB0)
struct UMaterialExpressionHairColor : UMaterialExpression
{
	struct FExpressionInput Melanin;  // 0xB0 (0xB0)
	struct FExpressionInput Redness;  // 0xD8 (0xD8)
	struct FExpressionInput DyeColor;  // 0x100 (0x100)


}; 
 
 


// Class Engine.PlayerStart
// Size: 0x2C0(Inherited: 0x2B8)
struct APlayerStart : ANavigationObjectBase
{
	struct FName PlayerStartTag;  // 0x2B8 (0x2B8)


}; 
 
 


// Class Engine.VectorFieldAnimated
// Size: 0xA8(Inherited: 0x68)
struct UVectorFieldAnimated : UVectorField
{
	struct UTexture2D* Texture;  // 0x68 (0x68)
	enum class EVectorFieldConstructionOp ConstructionOp;  // 0x70 (0x70)
	char pad_113[3];  // 0x71 (0x71)
	int32_t VolumeSizeX;  // 0x74 (0x74)
	int32_t VolumeSizeY;  // 0x78 (0x78)
	int32_t VolumeSizeZ;  // 0x7C (0x7C)
	int32_t SubImagesX;  // 0x80 (0x80)
	int32_t SubImagesY;  // 0x84 (0x84)
	int32_t FrameCount;  // 0x88 (0x88)
	float FramesPerSecond;  // 0x8C (0x8C)
	char bLoop : 1;  // 0x90 (0x90)
	char pad_144_1 : 7;  // 0x90 (0x90)
	char pad_145[8];  // 0x91 (0x91)
	struct UVectorFieldStatic* NoiseField;  // 0x98 (0x98)
	float NoiseScale;  // 0xA0 (0xA0)
	float NoiseMax;  // 0xA4 (0xA4)


}; 
 
 


// Class Engine.AnimStateMachineTypes
// Size: 0x28(Inherited: 0x28)
struct UAnimStateMachineTypes : UObject
{


}; 
 
 


// Class Engine.ActorComponent
// Size: 0xA0(Inherited: 0x28)
struct UActorComponent : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	struct FActorComponentTickFunction PrimaryComponentTick;  // 0x30 (0x30)
	struct TArray<struct FName> ComponentTags;  // 0x60 (0x60)
	struct TArray<struct UAssetUserData*> AssetUserData;  // 0x70 (0x70)
	char pad_128[4];  // 0x80 (0x80)
	int32_t UCSSerializationIndex;  // 0x84 (0x84)
	char pad_136_1 : 3;  // 0x88 (0x88)
	char bNetAddressable : 1;  // 0x88 (0x88)
	char bReplicateUsingRegisteredSubObjectList : 1;  // 0x88 (0x88)
	char bReplicates : 1;  // 0x88 (0x88)
	char pad_136_2 : 2;  // 0x88 (0x88)
	char pad_137[2];  // 0x89 (0x89)
	char pad_138_1 : 1;  // 0x8A (0x8A)
	char bAutoActivate : 1;  // 0x8A (0x8A)
	char bIsActive : 1;  // 0x8A (0x8A)
	char bEditableWhenInherited : 1;  // 0x8A (0x8A)
	char pad_138_2 : 1;  // 0x8A (0x8A)
	char bCanEverAffectNavigation : 1;  // 0x8A (0x8A)
	char pad_138_3 : 1;  // 0x8A (0x8A)
	char bIsEditorOnly : 1;  // 0x8A (0x8A)
	char pad_139[2];  // 0x8B (0x8B)
	uint8_t CreationMethod;  // 0x8D (0x8D)
	struct FMulticastSparseDelegate OnComponentActivated;  // 0x8E (0x8E)
	struct FMulticastSparseDelegate OnComponentDeactivated;  // 0x8F (0x8F)
	char pad_144[16];  // 0x90 (0x90)


	void ToggleActive(); // Function Engine.ActorComponent.ToggleActive
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.ActorComponent.SetTickGroup
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.ActorComponent.SetTickableWhenPaused
	void SetIsReplicated(bool ShouldReplicate); // Function Engine.ActorComponent.SetIsReplicated
	void SetComponentTickIntervalAndCooldown(float TickInterval); // Function Engine.ActorComponent.SetComponentTickIntervalAndCooldown
	void SetComponentTickInterval(float TickInterval); // Function Engine.ActorComponent.SetComponentTickInterval
	void SetComponentTickEnabled(bool bEnabled); // Function Engine.ActorComponent.SetComponentTickEnabled
	void SetAutoActivate(bool bNewAutoActivate); // Function Engine.ActorComponent.SetAutoActivate
	void SetActive(bool bNewActive, bool bReset); // Function Engine.ActorComponent.SetActive
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.RemoveTickPrerequisiteComponent
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.RemoveTickPrerequisiteActor
	void ReceiveTick(float DeltaSeconds); // Function Engine.ActorComponent.ReceiveTick
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.ActorComponent.ReceiveEndPlay
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds); // Function Engine.ActorComponent.ReceiveAsyncPhysicsTick
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive
	void K2_DestroyComponent(struct UObject* Object); // Function Engine.ActorComponent.K2_DestroyComponent
	bool IsComponentTickEnabled(); // Function Engine.ActorComponent.IsComponentTickEnabled
	bool IsBeingDestroyed(); // Function Engine.ActorComponent.IsBeingDestroyed
	bool IsActive(); // Function Engine.ActorComponent.IsActive
	struct AActor* GetOwner(); // Function Engine.ActorComponent.GetOwner
	float GetComponentTickInterval(); // Function Engine.ActorComponent.GetComponentTickInterval
	void Deactivate(); // Function Engine.ActorComponent.Deactivate
	bool ComponentHasTag(struct FName Tag); // Function Engine.ActorComponent.ComponentHasTag
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.AddTickPrerequisiteComponent
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.AddTickPrerequisiteActor
	void Activate(bool bReset); // Function Engine.ActorComponent.Activate
}; 
 
 


// Class Engine.DefaultPawn
// Size: 0x340(Inherited: 0x318)
struct ADefaultPawn : APawn
{
	float BaseTurnRate;  // 0x318 (0x318)
	float BaseLookUpRate;  // 0x31C (0x31C)
	struct UPawnMovementComponent* MovementComponent;  // 0x320 (0x320)
	struct USphereComponent* CollisionComponent;  // 0x328 (0x328)
	struct UStaticMeshComponent* MeshComponent;  // 0x330 (0x330)
	char bAddDefaultMovementBindings : 1;  // 0x338 (0x338)
	char pad_824_1 : 7;  // 0x338 (0x338)
	char pad_825[8];  // 0x339 (0x339)


	void TurnAtRate(float Rate); // Function Engine.DefaultPawn.TurnAtRate
	void MoveUp_World(float Val); // Function Engine.DefaultPawn.MoveUp_World
	void MoveRight(float Val); // Function Engine.DefaultPawn.MoveRight
	void MoveForward(float Val); // Function Engine.DefaultPawn.MoveForward
	void LookUpAtRate(float Rate); // Function Engine.DefaultPawn.LookUpAtRate
}; 
 
 


// Class Engine.AnimNotify
// Size: 0x38(Inherited: 0x28)
struct UAnimNotify : UObject
{
	char pad_40[16];  // 0x28 (0x28)


	bool Received_Notify(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, struct FAnimNotifyEventReference& EventReference); // Function Engine.AnimNotify.Received_Notify
	struct FString GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName
	float GetDefaultTriggerWeightThreshold(); // Function Engine.AnimNotify.GetDefaultTriggerWeightThreshold
}; 
 
 


// Class Engine.NullHLODBuilder
// Size: 0x28(Inherited: 0x28)
struct UNullHLODBuilder : UHLODBuilder
{


}; 
 
 


// Class Engine.MaterialExpressionIf
// Size: 0x188(Inherited: 0xB0)
struct UMaterialExpressionIf : UMaterialExpression
{
	struct FExpressionInput A;  // 0xB0 (0xB0)
	struct FExpressionInput B;  // 0xD8 (0xD8)
	struct FExpressionInput AGreaterThanB;  // 0x100 (0x100)
	struct FExpressionInput AEqualsB;  // 0x128 (0x128)
	struct FExpressionInput ALessThanB;  // 0x150 (0x150)
	float EqualsThreshold;  // 0x178 (0x178)
	float ConstB;  // 0x17C (0x17C)
	float ConstAEqualsB;  // 0x180 (0x180)
	char pad_388[4];  // 0x184 (0x184)


}; 
 
 


// Class Engine.NavigationObjectBase
// Size: 0x2B8(Inherited: 0x290)
struct ANavigationObjectBase : AActor
{
	char pad_656[8];  // 0x290 (0x290)
	struct UCapsuleComponent* CapsuleComponent;  // 0x298 (0x298)
	struct UBillboardComponent* GoodSprite;  // 0x2A0 (0x2A0)
	struct UBillboardComponent* BadSprite;  // 0x2A8 (0x2A8)
	char bIsPIEPlayerStart : 1;  // 0x2B0 (0x2B0)
	char pad_688_1 : 7;  // 0x2B0 (0x2B0)
	char pad_689[8];  // 0x2B1 (0x2B1)


}; 
 
 


// Class Engine.MaterialExpressionShadowReplace
// Size: 0x100(Inherited: 0xB0)
struct UMaterialExpressionShadowReplace : UMaterialExpression
{
	struct FExpressionInput Default;  // 0xB0 (0xB0)
	struct FExpressionInput Shadow;  // 0xD8 (0xD8)


}; 
 
 


// Class Engine.StructCookedMetaData
// Size: 0xC8(Inherited: 0x28)
struct UStructCookedMetaData : UObject
{
	struct FStructCookedMetaDataStore StructMetaData;  // 0x28 (0x28)


}; 
 
 


// Class Engine.MaterialExpressionTextureSampleParameter2D
// Size: 0x240(Inherited: 0x240)
struct UMaterialExpressionTextureSampleParameter2D : UMaterialExpressionTextureSampleParameter
{


}; 
 
 


// Class Engine.MaterialExpressionStrataConvertToDecal
// Size: 0x100(Inherited: 0xB0)
struct UMaterialExpressionStrataConvertToDecal : UMaterialExpressionStrataBSDF
{
	struct FExpressionInput DecalMaterial;  // 0xB0 (0xB0)
	struct FExpressionInput Coverage;  // 0xD8 (0xD8)


}; 
 
 


// Class Engine.MaterialExpressionCurveAtlasRowParameter
// Size: 0x120(Inherited: 0xE8)
struct UMaterialExpressionCurveAtlasRowParameter : UMaterialExpressionScalarParameter
{
	struct UCurveLinearColor* Curve;  // 0xE8 (0xE8)
	struct UCurveLinearColorAtlas* Atlas;  // 0xF0 (0xF0)
	struct FExpressionInput InputTime;  // 0xF8 (0xF8)


}; 
 
 


// Class Engine.ParticleModuleCameraBase
// Size: 0x30(Inherited: 0x30)
struct UParticleModuleCameraBase : UParticleModule
{


}; 
 
 


// Class Engine.WorldPartitionRuntimeCellOwner
// Size: 0x28(Inherited: 0x28)
struct UWorldPartitionRuntimeCellOwner : UInterface
{


}; 
 
 


// Class Engine.MaterialExpressionActorPositionWS
// Size: 0xB0(Inherited: 0xB0)
struct UMaterialExpressionActorPositionWS : UMaterialExpression
{


}; 
 
 


// Class Engine.AnimNotifyState
// Size: 0x30(Inherited: 0x28)
struct UAnimNotifyState : UObject
{
	char pad_40[8];  // 0x28 (0x28)


	bool Received_NotifyTick(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float FrameDeltaTime, struct FAnimNotifyEventReference& EventReference); // Function Engine.AnimNotifyState.Received_NotifyTick
	bool Received_NotifyEnd(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, struct FAnimNotifyEventReference& EventReference); // Function Engine.AnimNotifyState.Received_NotifyEnd
	bool Received_NotifyBegin(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float TotalDuration, struct FAnimNotifyEventReference& EventReference); // Function Engine.AnimNotifyState.Received_NotifyBegin
	struct FString GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName
	float GetDefaultTriggerWeightThreshold(); // Function Engine.AnimNotifyState.GetDefaultTriggerWeightThreshold
}; 
 
 


// Class Engine.LevelInstancePivot
// Size: 0x298(Inherited: 0x290)
struct ALevelInstancePivot : AActor
{
	char pad_656[8];  // 0x290 (0x290)


}; 
 
 


// Class Engine.AnimNotify_PlaySound
// Size: 0x58(Inherited: 0x38)
struct UAnimNotify_PlaySound : UAnimNotify
{
	struct USoundBase* Sound;  // 0x38 (0x38)
	float VolumeMultiplier;  // 0x40 (0x40)
	float PitchMultiplier;  // 0x44 (0x44)
	char bFollow : 1;  // 0x48 (0x48)
	char pad_72_1 : 7;  // 0x48 (0x48)
	char pad_73[4];  // 0x49 (0x49)
	struct FName AttachName;  // 0x4C (0x4C)
	char pad_84[4];  // 0x54 (0x54)


}; 
 
 


// Class Engine.Brush
// Size: 0x2C8(Inherited: 0x290)
struct ABrush : AActor
{
	enum class EBrushType BrushType;  // 0x290 (0x290)
	char pad_657[3];  // 0x291 (0x291)
	struct FColor BrushColor;  // 0x294 (0x294)
	int32_t PolyFlags;  // 0x298 (0x298)
	char bColored : 1;  // 0x29C (0x29C)
	char bSolidWhenSelected : 1;  // 0x29C (0x29C)
	char bPlaceableFromClassBrowser : 1;  // 0x29C (0x29C)
	char bNotForClientOrServer : 1;  // 0x29C (0x29C)
	char pad_668_1 : 4;  // 0x29C (0x29C)
	char pad_669[4];  // 0x29D (0x29D)
	struct UModel* Brush;  // 0x2A0 (0x2A0)
	struct UBrushComponent* BrushComponent;  // 0x2A8 (0x2A8)
	char bInManipulation : 1;  // 0x2B0 (0x2B0)
	char pad_688_1 : 7;  // 0x2B0 (0x2B0)
	char pad_689[8];  // 0x2B1 (0x2B1)
	struct TArray<struct FGeomSelection> SavedSelections;  // 0x2B8 (0x2B8)


}; 
 
 


// Class Engine.EmitterCameraLensEffectBase
// Size: 0x380(Inherited: 0x2E0)
struct AEmitterCameraLensEffectBase : AEmitter
{
	char pad_736[8];  // 0x2E0 (0x2E0)
	struct UParticleSystem* PS_CameraEffect;  // 0x2E8 (0x2E8)
	struct APlayerCameraManager* BaseCamera;  // 0x2F0 (0x2F0)
	char pad_760[8];  // 0x2F8 (0x2F8)
	struct FTransform RelativeTransform;  // 0x300 (0x300)
	float BaseFOV;  // 0x360 (0x360)
	char bAllowMultipleInstances : 1;  // 0x364 (0x364)
	char bResetWhenRetriggered : 1;  // 0x364 (0x364)
	char pad_868_1 : 6;  // 0x364 (0x364)
	char pad_869[4];  // 0x365 (0x365)
	struct TArray<AActor*> EmittersToTreatAsSame;  // 0x368 (0x368)
	float DistFromCamera;  // 0x378 (0x378)
	char pad_892[4];  // 0x37C (0x37C)


}; 
 
 


// Class Engine.BlueprintCore
// Size: 0x50(Inherited: 0x28)
struct UBlueprintCore : UObject
{
	UObject* SkeletonGeneratedClass;  // 0x28 (0x28)
	UObject* GeneratedClass;  // 0x30 (0x30)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool bLegacyNeedToPurgeSkelRefs : 1;  // 0x38 (0x38)
	char pad_57[3];  // 0x39 (0x39)
	struct FGuid BlueprintGuid;  // 0x3C (0x3C)
	char pad_76[4];  // 0x4C (0x4C)


}; 
 
 


// Class Engine.BlueprintExtension
// Size: 0x28(Inherited: 0x28)
struct UBlueprintExtension : UObject
{


}; 
 
 


// Class Engine.ReplayNetConnection
// Size: 0x3D80(Inherited: 0x3310)
struct UReplayNetConnection : UNetConnection
{
	char pad_13072[2672];  // 0x3310 (0x3310)


}; 
 
 


// Class Engine.Blueprint
// Size: 0xA8(Inherited: 0x50)
struct UBlueprint : UBlueprintCore
{
	char pad_80[8];  // 0x50 (0x50)
	UObject* ParentClass;  // 0x58 (0x58)
	enum class EBlueprintType BlueprintType;  // 0x60 (0x60)
	char bRecompileOnLoad : 1;  // 0x61 (0x61)
	char bHasBeenRegenerated : 1;  // 0x61 (0x61)
	char bIsRegeneratingOnLoad : 1;  // 0x61 (0x61)
	char pad_97_1 : 5;  // 0x61 (0x61)
	char pad_98[3];  // 0x62 (0x62)
	int32_t BlueprintSystemVersion;  // 0x7FF7D35967D0 (0x1705D6E0080) (0x7FF7D35967D0 (0x1705D6E0080))
	struct USimpleConstructionScript* SimpleConstructionScript;  // 0x68 (0x68)
	struct TArray<struct UActorComponent*> ComponentTemplates;  // 0x70 (0x70)
	struct TArray<struct UTimelineTemplate*> Timelines;  // 0x80 (0x80)
	struct TArray<struct FBPComponentClassOverride> ComponentClassOverrides;  // 0x90 (0x90)
	struct UInheritableComponentHandler* InheritableComponentHandler;  // 0xA0 (0xA0)


}; 
 
 


// Class Engine.LevelInstanceComponent
// Size: 0x2A0(Inherited: 0x2A0)
struct ULevelInstanceComponent : USceneComponent
{


}; 
 
 


// Class Engine.MaterialExpressionSceneColor
// Size: 0x118(Inherited: 0xB0)
struct UMaterialExpressionSceneColor : UMaterialExpression
{
	enum class EMaterialSceneAttributeInputMode InputMode;  // 0xB0 (0xB0)
	char pad_177[7];  // 0xB1 (0xB1)
	struct FExpressionInput Input;  // 0xB8 (0xB8)
	struct FExpressionInput OffsetFraction;  // 0xE0 (0xE0)
	struct FVector2D ConstInput;  // 0x108 (0x108)


}; 
 
 


// Class Engine.PrimitiveComponent
// Size: 0x540(Inherited: 0x2A0)
struct UPrimitiveComponent : USceneComponent
{
	char pad_672[16];  // 0x2A0 (0x2A0)
	float MinDrawDistance;  // 0x2B0 (0x2B0)
	float LDMaxDrawDistance;  // 0x2B4 (0x2B4)
	float CachedMaxDrawDistance;  // 0x7FF7D35967D0 (0x1705D6E0080) (0x7FF7D35967D0 (0x1705D6E0080))
	enum class ESceneDepthPriorityGroup DepthPriorityGroup;  // 0x2BC (0x2BC)
	enum class ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup;  // 0x2BD (0x0 ()
	enum class EIndirectLightingCacheQuality IndirectLightingCacheQuality;  // 0x2BE (0x2BE)
	uint8_t LightmapType;  // 0x2BF (0x2BF)
	char bIsValidTextureStreamingBuiltData : 1;  // 0x2C0 (0x2C0)
	char bNeverDistanceCull : 1;  // 0x2C0 (0x2C0)
	char pad_704_1 : 5;  // 0x2C0 (0x2C0)
	char bAlwaysCreatePhysicsState : 1;  // 0x2C0 (0x2C0)
	char bGenerateOverlapEvents : 1;  // 0x2C1 (0x2C1)
	char bMultiBodyOverlap : 1;  // 0x2C1 (0x2C1)
	char bTraceComplexOnMove : 1;  // 0x0 (0x0)
	char bReturnMaterialOnMove : 1;  // 0x0 (0x0)
	char bUseViewOwnerDepthPriorityGroup : 1;  // 0x2C1 (0x2C1)
	char bAllowCullDistanceVolume : 1;  // 0x2C1 (0x2C1)
	char bVisibleInReflectionCaptures : 1;  // 0x2C1 (0x2C1)
	char bVisibleInRealTimeSkyCaptures : 1;  // 0x2C1 (0x2C1)
	char bVisibleInRayTracing : 1;  // 0x2C2 (0x2C2)
	char bRenderInMainPass : 1;  // 0x2C2 (0x2C2)
	char bRenderInDepthPass : 1;  // 0x2C2 (0x2C2)
	char bReceivesDecals : 1;  // 0x2C2 (0x2C2)
	char bOwnerNoSee : 1;  // 0x2C2 (0x2C2)
	char bOnlyOwnerSee : 1;  // 0x2C2 (0x2C2)
	char bTreatAsBackgroundForOcclusion : 1;  // 0x2C2 (0x2C2)
	char bUseAsOccluder : 1;  // 0x2C2 (0x2C2)
	char bSelectable : 1;  // 0x2C3 (0x2C3)
	char bForceMipStreaming : 1;  // 0x2C3 (0x2C3)
	char bHasPerInstanceHitProxies : 1;  // 0x2C3 (0x2C3)
	char CastShadow : 1;  // 0x2C3 (0x2C3)
	char bEmissiveLightSource : 1;  // 0x2C3 (0x2C3)
	char bAffectDynamicIndirectLighting : 1;  // 0x2C3 (0x2C3)
	char bAffectIndirectLightingWhileHidden : 1;  // 0x2C3 (0x2C3)
	char bAffectDistanceFieldLighting : 1;  // 0x2C3 (0x2C3)
	char bCastDynamicShadow : 1;  // 0x2C4 (0x2C4)
	char bCastStaticShadow : 1;  // 0x2C4 (0x2C4)
	char bCastVolumetricTranslucentShadow : 1;  // 0x2C4 (0x2C4)
	char bCastContactShadow : 1;  // 0x2C4 (0x2C4)
	char bSelfShadowOnly : 1;  // 0x2C4 (0x2C4)
	char bCastFarShadow : 1;  // 0x2C4 (0x2C4)
	char bCastInsetShadow : 1;  // 0x2C4 (0x2C4)
	char bCastCinematicShadow : 1;  // 0x2C4 (0x2C4)
	char bCastHiddenShadow : 1;  // 0x2C5 (0x2C5)
	char bCastShadowAsTwoSided : 1;  // 0x2C5 (0x2C5)
	char bLightAsIfStatic : 1;  // 0x2C5 (0x2C5)
	char bLightAttachmentsAsGroup : 1;  // 0x2C5 (0x2C5)
	char bExcludeFromLightAttachmentGroup : 1;  // 0x2C5 (0x2C5)
	char bReceiveMobileCSMShadows : 1;  // 0x2C5 (0x2C5)
	char bSingleSampleShadowFromStationaryLights : 1;  // 0x2C5 (0x2C5)
	char bIgnoreRadialImpulse : 1;  // 0x2C5 (0x2C5)
	char bIgnoreRadialForce : 1;  // 0x2C6 (0x2C6)
	char bApplyImpulseOnDamage : 1;  // 0x2C6 (0x2C6)
	char bReplicatePhysicsToAutonomousProxy : 1;  // 0x2C6 (0x2C6)
	char bFillCollisionUnderneathForNavmesh : 1;  // 0x2C6 (0x2C6)
	char AlwaysLoadOnClient : 1;  // 0x2C6 (0x2C6)
	char AlwaysLoadOnServer : 1;  // 0x2C6 (0x2C6)
	char bUseEditorCompositing : 1;  // 0x2C6 (0x2C6)
	char bIsBeingMovedByEditor : 1;  // 0x2C6 (0x2C6)
	char bRenderCustomDepth : 1;  // 0x2C7 (0x2C7)
	char bVisibleInSceneCaptureOnly : 1;  // 0x2C7 (0x2C7)
	char bHiddenInSceneCapture : 1;  // 0x2C7 (0x2C7)
	char bRayTracingFarField : 1;  // 0x2C7 (0x2C7)
	char pad_711_1 : 1;  // 0x2C7 (0x2C7)
	char bHasNoStreamableTextures : 1;  // 0x2C7 (0x2C7)
	char pad_711_2 : 2;  // 0x2C7 (0x2C7)
	enum class EHasCustomNavigableGeometry bHasCustomNavigableGeometry;  // 0x2C8 (0x2C8)
	char pad_713[1];  // 0x2C9 (0x2C9)
	enum class ECanBeCharacterBase CanCharacterStepUpOn;  // 0x2CA (0x2CA)
	struct FLightingChannels LightingChannels;  // 0x2CB (0x2CB)
	int32_t RayTracingGroupId;  // 0x2CC (0x2CC)
	int32_t VisibilityId;  // 0x2D0 (0x2D0)
	int32_t CustomDepthStencilValue;  // 0x2D4 (0x2D4)
	struct FCustomPrimitiveData CustomPrimitiveData;  // 0x2D8 (0x2D8)
	struct FCustomPrimitiveData CustomPrimitiveDataInternal;  // 0x2E8 (0x2E8)
	char pad_760[8];  // 0x2F8 (0x2F8)
	int32_t TranslucencySortPriority;  // 0x300 (0x300)
	float TranslucencySortDistanceOffset;  // 0x304 (0x304)
	struct TArray<struct URuntimeVirtualTexture*> RuntimeVirtualTextures;  // 0x308 (0x308)
	int8_t VirtualTextureLodBias;  // 0x318 (0x318)
	int8_t VirtualTextureCullMips;  // 0x319 (0x319)
	int8_t VirtualTextureMinCoverage;  // 0x31A (0x31A)
	uint8_t VirtualTextureRenderPassType;  // 0x31B (0x31B)
	char pad_796[16];  // 0x31C (0x31C)
	float BoundsScale;  // 0x32C (0x32C)
	char pad_816[16];  // 0x330 (0x330)
	struct TArray<struct AActor*> MoveIgnoreActors;  // 0x340 (0x340)
	struct TArray<struct UPrimitiveComponent*> MoveIgnoreComponents;  // 0x350 (0x350)
	char pad_864[16];  // 0x360 (0x360)
	struct FBodyInstance BodyInstance;  // 0x370 (0x370)
	struct FMulticastSparseDelegate OnComponentHit;  // 0x500 (0x500)
	struct FMulticastSparseDelegate OnComponentBeginOverlap;  // 0x501 (0x501)
	struct FMulticastSparseDelegate OnComponentEndOverlap;  // 0x502 (0x502)
	struct FMulticastSparseDelegate OnComponentWake;  // 0x503 (0x503)
	struct FMulticastSparseDelegate OnComponentSleep;  // 0x504 (0x504)
	char pad_1285[1];  // 0x505 (0x505)
	struct FMulticastSparseDelegate OnComponentPhysicsStateChanged;  // 0x506 (0x506)
	struct FMulticastSparseDelegate OnBeginCursorOver;  // 0x507 (0x507)
	struct FMulticastSparseDelegate OnEndCursorOver;  // 0x508 (0x508)
	struct FMulticastSparseDelegate OnClicked;  // 0x509 (0x509)
	struct FMulticastSparseDelegate OnReleased;  // 0x50A (0x50A)
	struct FMulticastSparseDelegate OnInputTouchBegin;  // 0x50B (0x50B)
	struct FMulticastSparseDelegate OnInputTouchEnd;  // 0x50C (0x50C)
	struct FMulticastSparseDelegate OnInputTouchEnter;  // 0x50D (0x50D)
	struct FMulticastSparseDelegate OnInputTouchLeave;  // 0x50E (0x50E)
	uint8_t RayTracingGroupCullingPriority;  // 0x50F (0x50F)
	uint8_t CustomDepthStencilWriteMask;  // 0x510 (0x510)
	char pad_1297[31];  // 0x511 (0x511)
	struct UPrimitiveComponent* LODParentPrimitive;  // 0x530 (0x530)
	char pad_1336[8];  // 0x538 (0x538)


	bool WasRecentlyRendered(float Tolerance); // Function Engine.PrimitiveComponent.WasRecentlyRendered
	void WakeRigidBody(struct FName BoneName); // Function Engine.PrimitiveComponent.WakeRigidBody
	void WakeAllRigidBodies(); // Function Engine.PrimitiveComponent.WakeAllRigidBodies
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride& NewOverride); // Function Engine.PrimitiveComponent.SetWalkableSlopeOverride
	void SetVisibleInSceneCaptureOnly(bool bValue); // Function Engine.PrimitiveComponent.SetVisibleInSceneCaptureOnly
	void SetVisibleInRayTracing(bool bNewVisibleInRayTracing); // Function Engine.PrimitiveComponent.SetVisibleInRayTracing
	void SetVectorParameterForDefaultCustomPrimitiveData(struct FName ParameterName, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetVectorParameterForDefaultCustomPrimitiveData
	void SetVectorParameterForCustomPrimitiveData(struct FName ParameterName, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetVectorParameterForCustomPrimitiveData
	void SetUseCCD(bool InUseCCD, struct FName BoneName); // Function Engine.PrimitiveComponent.SetUseCCD
	void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority); // Function Engine.PrimitiveComponent.SetTranslucentSortPriority
	void SetTranslucencySortDistanceOffset(float NewTranslucencySortDistanceOffset); // Function Engine.PrimitiveComponent.SetTranslucencySortDistanceOffset
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights); // Function Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights
	void SetSimulatePhysics(bool bSimulate); // Function Engine.PrimitiveComponent.SetSimulatePhysics
	void SetScalarParameterForDefaultCustomPrimitiveData(struct FName ParameterName, float Value); // Function Engine.PrimitiveComponent.SetScalarParameterForDefaultCustomPrimitiveData
	void SetScalarParameterForCustomPrimitiveData(struct FName ParameterName, float Value); // Function Engine.PrimitiveComponent.SetScalarParameterForCustomPrimitiveData
	void SetRenderInMainPass(bool bValue); // Function Engine.PrimitiveComponent.SetRenderInMainPass
	void SetRenderInDepthPass(bool bValue); // Function Engine.PrimitiveComponent.SetRenderInDepthPass
	void SetRenderCustomDepth(bool bValue); // Function Engine.PrimitiveComponent.SetRenderCustomDepth
	void SetReceivesDecals(bool bNewReceivesDecals); // Function Engine.PrimitiveComponent.SetReceivesDecals
	void SetPhysMaterialOverride(struct UPhysicalMaterial* NewPhysMaterial); // Function Engine.PrimitiveComponent.SetPhysMaterialOverride
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInRadians
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees
	void SetPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity
	void SetPhysicsAngularVelocityInRadians(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInRadians
	void SetPhysicsAngularVelocityInDegrees(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInDegrees
	void SetOwnerNoSee(bool bNewOwnerNoSee); // Function Engine.PrimitiveComponent.SetOwnerNoSee
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee); // Function Engine.PrimitiveComponent.SetOnlyOwnerSee
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision); // Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision
	void SetMaterialByName(struct FName MaterialSlotName, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterialByName
	void SetMaterial(int32_t ElementIndex, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterial
	void SetMassScale(struct FName BoneName, float InMassScale); // Function Engine.PrimitiveComponent.SetMassScale
	void SetMassOverrideInKg(struct FName BoneName, float MassInKg, bool bOverrideMass); // Function Engine.PrimitiveComponent.SetMassOverrideInKg
	void SetLinearDamping(float InDamping); // Function Engine.PrimitiveComponent.SetLinearDamping
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2); // Function Engine.PrimitiveComponent.SetLightingChannels
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup); // Function Engine.PrimitiveComponent.SetLightAttachmentsAsGroup
	void SetHiddenInSceneCapture(bool bValue); // Function Engine.PrimitiveComponent.SetHiddenInSceneCapture
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents); // Function Engine.PrimitiveComponent.SetGenerateOverlapEvents
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup); // Function Engine.PrimitiveComponent.SetExcludeFromLightAttachmentGroup
	void SetEnableGravity(bool bGravityEnabled); // Function Engine.PrimitiveComponent.SetEnableGravity
	void SetEmissiveLightSource(bool NewEmissiveLightSource); // Function Engine.PrimitiveComponent.SetEmissiveLightSource
	void SetDefaultCustomPrimitiveDataVector4(int32_t DataIndex, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector4
	void SetDefaultCustomPrimitiveDataVector3(int32_t DataIndex, struct FVector Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector3
	void SetDefaultCustomPrimitiveDataVector2(int32_t DataIndex, struct FVector2D Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector2
	void SetDefaultCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataFloat
	void SetCustomPrimitiveDataVector4(int32_t DataIndex, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4
	void SetCustomPrimitiveDataVector3(int32_t DataIndex, struct FVector Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector3
	void SetCustomPrimitiveDataVector2(int32_t DataIndex, struct FVector2D Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2
	void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataFloat
	void SetCustomDepthStencilWriteMask(uint8_t WriteMaskBit); // Function Engine.PrimitiveComponent.SetCustomDepthStencilWriteMask
	void SetCustomDepthStencilValue(int32_t Value); // Function Engine.PrimitiveComponent.SetCustomDepthStencilValue
	void SetCullDistance(float NewCullDistance); // Function Engine.PrimitiveComponent.SetCullDistance
	void SetConstraintMode(enum class EDOFMode ConstraintMode); // Function Engine.PrimitiveComponent.SetConstraintMode
	void SetCollisionResponseToChannel(enum class ECollisionChannel Channel, enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToChannel
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToAllChannels
	void SetCollisionProfileName(struct FName InCollisionProfileName, bool bUpdateOverlaps); // Function Engine.PrimitiveComponent.SetCollisionProfileName
	void SetCollisionObjectType(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.SetCollisionObjectType
	void SetCollisionEnabled(enum class ECollisionEnabled NewType); // Function Engine.PrimitiveComponent.SetCollisionEnabled
	void SetCenterOfMass(struct FVector CenterOfMassOffset, struct FName BoneName); // Function Engine.PrimitiveComponent.SetCenterOfMass
	void SetCastShadow(bool NewCastShadow); // Function Engine.PrimitiveComponent.SetCastShadow
	void SetCastInsetShadow(bool bInCastInsetShadow); // Function Engine.PrimitiveComponent.SetCastInsetShadow
	void SetCastHiddenShadow(bool NewCastHiddenShadow); // Function Engine.PrimitiveComponent.SetCastHiddenShadow
	void SetCastContactShadow(bool bInCastContactShadow); // Function Engine.PrimitiveComponent.SetCastContactShadow
	void SetBoundsScale(float NewBoundsScale); // Function Engine.PrimitiveComponent.SetBoundsScale
	void SetAngularDamping(float InDamping); // Function Engine.PrimitiveComponent.SetAngularDamping
	void SetAllUseCCD(bool InUseCCD); // Function Engine.PrimitiveComponent.SetAllUseCCD
	void SetAllPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity
	void SetAllPhysicsAngularVelocityInRadians(struct FVector& NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInRadians
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector& NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInDegrees
	void SetAllMassScale(float InMassScale); // Function Engine.PrimitiveComponent.SetAllMassScale
	struct FVector ScaleByMomentOfInertia(struct FVector InputVector, struct FName BoneName); // Function Engine.PrimitiveComponent.ScaleByMomentOfInertia
	void PutRigidBodyToSleep(struct FName BoneName); // Function Engine.PrimitiveComponent.PutRigidBodyToSleep
	bool K2_SphereTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_SphereTraceComponent
	bool K2_SphereOverlapComponent(struct FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_SphereOverlapComponent
	bool K2_LineTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_LineTraceComponent
	bool K2_IsQueryCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsQueryCollisionEnabled
	bool K2_IsPhysicsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled
	bool K2_IsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsCollisionEnabled
	bool K2_BoxOverlapComponent(struct FVector InBoxCentre, struct FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_BoxOverlapComponent
	bool IsOverlappingComponent(struct UPrimitiveComponent* OtherComp); // Function Engine.PrimitiveComponent.IsOverlappingComponent
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.PrimitiveComponent.IsOverlappingActor
	bool IsGravityEnabled(); // Function Engine.PrimitiveComponent.IsGravityEnabled
	bool IsAnyRigidBodyAwake(); // Function Engine.PrimitiveComponent.IsAnyRigidBodyAwake
	void InvalidateLumenSurfaceCache(); // Function Engine.PrimitiveComponent.InvalidateLumenSurfaceCache
	void IgnoreComponentWhenMoving(struct UPrimitiveComponent* Component, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreComponentWhenMoving
	void IgnoreActorWhenMoving(struct AActor* Actor, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreActorWhenMoving
	struct FWalkableSlopeOverride GetWalkableSlopeOverride(); // Function Engine.PrimitiveComponent.GetWalkableSlopeOverride
	struct FVector GetPhysicsLinearVelocityAtPoint(struct FVector Point, struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint
	struct FVector GetPhysicsLinearVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity
	struct FVector GetPhysicsAngularVelocityInRadians(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInRadians
	struct FVector GetPhysicsAngularVelocityInDegrees(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInDegrees
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OutOverlappingComponents); // Function Engine.PrimitiveComponent.GetOverlappingComponents
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, AActor* ClassFilter); // Function Engine.PrimitiveComponent.GetOverlappingActors
	int32_t GetNumMaterials(); // Function Engine.PrimitiveComponent.GetNumMaterials
	struct UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t& SectionIndex); // Function Engine.PrimitiveComponent.GetMaterialFromCollisionFaceIndex
	struct UMaterialInterface* GetMaterial(int32_t ElementIndex); // Function Engine.PrimitiveComponent.GetMaterial
	float GetMassScale(struct FName BoneName); // Function Engine.PrimitiveComponent.GetMassScale
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass
	float GetLinearDamping(); // Function Engine.PrimitiveComponent.GetLinearDamping
	struct FVector GetInertiaTensor(struct FName BoneName); // Function Engine.PrimitiveComponent.GetInertiaTensor
	bool GetGenerateOverlapEvents(); // Function Engine.PrimitiveComponent.GetGenerateOverlapEvents
	int32_t GetCustomPrimitiveDataIndexForVectorParameter(struct FName ParameterName); // Function Engine.PrimitiveComponent.GetCustomPrimitiveDataIndexForVectorParameter
	int32_t GetCustomPrimitiveDataIndexForScalarParameter(struct FName ParameterName); // Function Engine.PrimitiveComponent.GetCustomPrimitiveDataIndexForScalarParameter
	enum class ECollisionResponse GetCollisionResponseToChannel(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.GetCollisionResponseToChannel
	struct FName GetCollisionProfileName(); // Function Engine.PrimitiveComponent.GetCollisionProfileName
	enum class ECollisionChannel GetCollisionObjectType(); // Function Engine.PrimitiveComponent.GetCollisionObjectType
	enum class ECollisionEnabled GetCollisionEnabled(); // Function Engine.PrimitiveComponent.GetCollisionEnabled
	float GetClosestPointOnCollision(struct FVector& Point, struct FVector& OutPointOnBody, struct FName BoneName); // Function Engine.PrimitiveComponent.GetClosestPointOnCollision
	struct FVector GetCenterOfMass(struct FName BoneName); // Function Engine.PrimitiveComponent.GetCenterOfMass
	struct FBodyInstanceAsyncPhysicsTickHandle GetBodyInstanceAsyncPhysicsTickHandle(struct FName BoneName, bool bGetWelded, int32_t Index); // Function Engine.PrimitiveComponent.GetBodyInstanceAsyncPhysicsTickHandle
	float GetAngularDamping(); // Function Engine.PrimitiveComponent.GetAngularDamping
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32_t ElementIndex, struct UMaterialInterface* SourceMaterial, struct FName OptionalName); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, struct UMaterialInterface* Parent); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic
	struct TArray<struct UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors
	void ClearMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreComponents
	void ClearMoveIgnoreActors(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreActors
	bool CanCharacterStepUp(struct APawn* Pawn); // Function Engine.PrimitiveComponent.CanCharacterStepUp
	void AddVelocityChangeImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddVelocityChangeImpulseAtLocation
	void AddTorqueInRadians(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInRadians
	void AddTorqueInDegrees(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInDegrees
	void AddRadialImpulse(struct FVector Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bVelChange); // Function Engine.PrimitiveComponent.AddRadialImpulse
	void AddRadialForce(struct FVector Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bAccelChange); // Function Engine.PrimitiveComponent.AddRadialForce
	void AddImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddImpulseAtLocation
	void AddImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddImpulse
	void AddForceAtLocationLocal(struct FVector Force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal
	void AddForceAtLocation(struct FVector Force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocation
	void AddForce(struct FVector Force, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddForce
	void AddAngularImpulseInRadians(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInRadians
	void AddAngularImpulseInDegrees(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInDegrees
}; 
 
 


// Class Engine.MaterialExpressionVertexTangentWS
// Size: 0xB0(Inherited: 0xB0)
struct UMaterialExpressionVertexTangentWS : UMaterialExpression
{


}; 
 
 


// Class Engine.SceneComponent
// Size: 0x2A0(Inherited: 0xA0)
struct USceneComponent : UActorComponent
{
	char pad_160[8];  // 0xA0 (0xA0)
	struct TWeakObjectPtr<APhysicsVolume> PhysicsVolume;  // 0xA8 (0xA8)
	struct USceneComponent* AttachParent;  // 0xB0 (0xB0)
	struct FName AttachSocketName;  // 0xB8 (0xB8)
	struct TArray<struct USceneComponent*> AttachChildren;  // 0xC0 (0xC0)
	struct TArray<struct USceneComponent*> ClientAttachedChildren;  // 0xD0 (0xD0)
	char pad_224[72];  // 0xE0 (0xE0)
	struct FVector RelativeLocation;  // 0x128 (0x128)
	struct FRotator RelativeRotation;  // 0x140 (0x140)
	struct FVector RelativeScale3D;  // 0x158 (0x158)
	struct FVector ComponentVelocity;  // 0x170 (0x170)
	char bComponentToWorldUpdated : 1;  // 0x188 (0x188)
	char pad_392_1 : 1;  // 0x188 (0x188)
	char bAbsoluteLocation : 1;  // 0x188 (0x188)
	char bAbsoluteRotation : 1;  // 0x188 (0x188)
	char bAbsoluteScale : 1;  // 0x188 (0x188)
	char bVisible : 1;  // 0x188 (0x188)
	char bShouldBeAttached : 1;  // 0x188 (0x188)
	char bShouldSnapLocationWhenAttached : 1;  // 0x188 (0x188)
	char bShouldSnapRotationWhenAttached : 1;  // 0x189 (0x189)
	char bShouldSnapScaleWhenAttached : 1;  // 0x189 (0x189)
	char bShouldUpdatePhysicsVolume : 1;  // 0x189 (0x189)
	char bHiddenInGame : 1;  // 0x189 (0x189)
	char bBoundsChangeTriggersStreamingDataRebuild : 1;  // 0x189 (0x189)
	char bUseAttachParentBound : 1;  // 0x189 (0x189)
	char bComputeFastLocalBounds : 1;  // 0x189 (0x189)
	char bComputeBoundsOnceForGame : 1;  // 0x189 (0x189)
	char bComputedBoundsOnceForGame : 1;  // 0x18A (0x18A)
	char bIsNotRenderAttachmentRoot : 1;  // 0x18A (0x18A)
	char pad_394_1 : 6;  // 0x18A (0x18A)
	enum class EComponentMobility Mobility;  // 0x18B (0x18B)
	enum class EDetailMode DetailMode;  // 0x18C (0x18C)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate;  // 0x18D (0x18D)
	char pad_398[274];  // 0x18E (0x18E)


	void ToggleVisibility(bool bPropagateToChildren); // Function Engine.SceneComponent.ToggleVisibility
	void SetWorldScale3D(struct FVector NewScale); // Function Engine.SceneComponent.SetWorldScale3D
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Function Engine.SceneComponent.SetVisibility
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume); // Function Engine.SceneComponent.SetShouldUpdatePhysicsVolume
	void SetRelativeScale3D(struct FVector NewScale3D); // Function Engine.SceneComponent.SetRelativeScale3D
	void SetMobility(enum class EComponentMobility NewMobility); // Function Engine.SceneComponent.SetMobility
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren); // Function Engine.SceneComponent.SetHiddenInGame
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale); // Function Engine.SceneComponent.SetAbsolute
	void ResetRelativeTransform(); // Function Engine.SceneComponent.ResetRelativeTransform
	void OnRep_Visibility(bool OldValue); // Function Engine.SceneComponent.OnRep_Visibility
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren
	void K2_SetWorldTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldTransform
	void K2_SetWorldRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldRotation
	void K2_SetWorldLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocationAndRotation
	void K2_SetWorldLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocation
	void K2_SetRelativeTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeTransform
	void K2_SetRelativeRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeRotation
	void K2_SetRelativeLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocationAndRotation
	void K2_SetRelativeLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocation
	struct FTransform K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld
	struct FVector K2_GetComponentScale(); // Function Engine.SceneComponent.K2_GetComponentScale
	struct FRotator K2_GetComponentRotation(); // Function Engine.SceneComponent.K2_GetComponentRotation
	struct FVector K2_GetComponentLocation(); // Function Engine.SceneComponent.K2_GetComponentLocation
	void K2_DetachFromComponent(uint8_t LocationRule, uint8_t RotationRule, uint8_t ScaleRule, bool bCallModify); // Function Engine.SceneComponent.K2_DetachFromComponent
	bool K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, uint8_t LocationRule, uint8_t RotationRule, uint8_t ScaleRule, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachToComponent
	bool K2_AttachTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachType, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachTo
	void K2_AddWorldTransformKeepScale(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransformKeepScale
	void K2_AddWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransform
	void K2_AddWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldRotation
	void K2_AddWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldOffset
	void K2_AddRelativeRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeRotation
	void K2_AddRelativeLocation(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeLocation
	void K2_AddLocalTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalTransform
	void K2_AddLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalRotation
	void K2_AddLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalOffset
	bool IsVisible(); // Function Engine.SceneComponent.IsVisible
	bool IsSimulatingPhysics(struct FName BoneName); // Function Engine.SceneComponent.IsSimulatingPhysics
	bool IsAnySimulatingPhysics(); // Function Engine.SceneComponent.IsAnySimulatingPhysics
	struct FVector GetUpVector(); // Function Engine.SceneComponent.GetUpVector
	struct FTransform GetSocketTransform(struct FName InSocketName, enum class ERelativeTransformSpace TransformSpace); // Function Engine.SceneComponent.GetSocketTransform
	struct FRotator GetSocketRotation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketRotation
	struct FQuat GetSocketQuaternion(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketQuaternion
	struct FVector GetSocketLocation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketLocation
	bool GetShouldUpdatePhysicsVolume(); // Function Engine.SceneComponent.GetShouldUpdatePhysicsVolume
	struct FVector GetRightVector(); // Function Engine.SceneComponent.GetRightVector
	struct FTransform GetRelativeTransform(); // Function Engine.SceneComponent.GetRelativeTransform
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.SceneComponent.GetPhysicsVolume
	void GetParentComponents(struct TArray<struct USceneComponent*>& Parents); // Function Engine.SceneComponent.GetParentComponents
	int32_t GetNumChildrenComponents(); // Function Engine.SceneComponent.GetNumChildrenComponents
	struct FVector GetForwardVector(); // Function Engine.SceneComponent.GetForwardVector
	struct FVector GetComponentVelocity(); // Function Engine.SceneComponent.GetComponentVelocity
	void GetChildrenComponents(bool bIncludeAllDescendants, struct TArray<struct USceneComponent*>& Children); // Function Engine.SceneComponent.GetChildrenComponents
	struct USceneComponent* GetChildComponent(int32_t ChildIndex); // Function Engine.SceneComponent.GetChildComponent
	struct FName GetAttachSocketName(); // Function Engine.SceneComponent.GetAttachSocketName
	struct USceneComponent* GetAttachParent(); // Function Engine.SceneComponent.GetAttachParent
	struct TArray<struct FName> GetAllSocketNames(); // Function Engine.SceneComponent.GetAllSocketNames
	bool DoesSocketExist(struct FName InSocketName); // Function Engine.SceneComponent.DoesSocketExist
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify); // Function Engine.SceneComponent.DetachFromParent
}; 
 
 


// Class Engine.FXSystemComponent
// Size: 0x540(Inherited: 0x540)
struct UFXSystemComponent : UPrimitiveComponent
{


	void SetVectorParameter(struct FName ParameterName, struct FVector Param); // Function Engine.FXSystemComponent.SetVectorParameter
	void SetUseAutoManageAttachment(bool bAutoManage); // Function Engine.FXSystemComponent.SetUseAutoManageAttachment
	void SetIntParameter(struct FName ParameterName, int32_t Param); // Function Engine.FXSystemComponent.SetIntParameter
	void SetFloatParameter(struct FName ParameterName, float Param); // Function Engine.FXSystemComponent.SetFloatParameter
	void SetEmitterEnable(struct FName EmitterName, bool bNewEnableState); // Function Engine.FXSystemComponent.SetEmitterEnable
	void SetColorParameter(struct FName ParameterName, struct FLinearColor Param); // Function Engine.FXSystemComponent.SetColorParameter
	void SetBoolParameter(struct FName ParameterName, bool Param); // Function Engine.FXSystemComponent.SetBoolParameter
	void SetAutoAttachmentParameters(struct USceneComponent* Parent, struct FName SocketName, uint8_t LocationRule, uint8_t RotationRule, uint8_t ScaleRule); // Function Engine.FXSystemComponent.SetAutoAttachmentParameters
	void SetActorParameter(struct FName ParameterName, struct AActor* Param); // Function Engine.FXSystemComponent.SetActorParameter
	void ReleaseToPool(); // Function Engine.FXSystemComponent.ReleaseToPool
	struct UFXSystemAsset* GetFXSystemAsset(); // Function Engine.FXSystemComponent.GetFXSystemAsset
}; 
 
 


// Class Engine.MaterialExpressionStrataPostProcess
// Size: 0x100(Inherited: 0xB0)
struct UMaterialExpressionStrataPostProcess : UMaterialExpressionStrataBSDF
{
	struct FExpressionInput Color;  // 0xB0 (0xB0)
	struct FExpressionInput Opacity;  // 0xD8 (0xD8)


}; 
 
 


// Class Engine.MaterialExpressionStrataLegacyConversion
// Size: 0x3F8(Inherited: 0xB0)
struct UMaterialExpressionStrataLegacyConversion : UMaterialExpressionStrataBSDF
{
	struct FExpressionInput BaseColor;  // 0xB0 (0xB0)
	struct FExpressionInput Metallic;  // 0xD8 (0xD8)
	struct FExpressionInput Specular;  // 0x100 (0x100)
	struct FExpressionInput Roughness;  // 0x128 (0x128)
	struct FExpressionInput Anisotropy;  // 0x150 (0x150)
	struct FExpressionInput EmissiveColor;  // 0x178 (0x178)
	struct FExpressionInput Normal;  // 0x1A0 (0x1A0)
	struct FExpressionInput Tangent;  // 0x1C8 (0x1C8)
	struct FExpressionInput SubsurfaceColor;  // 0x1F0 (0x1F0)
	struct FExpressionInput ClearCoat;  // 0x218 (0x218)
	struct FExpressionInput ClearCoatRoughness;  // 0x240 (0x240)
	struct FExpressionInput Opacity;  // 0x268 (0x268)
	struct FExpressionInput TransmittanceColor;  // 0x290 (0x290)
	struct FExpressionInput WaterScatteringCoefficients;  // 0x2B8 (0x2B8)
	struct FExpressionInput WaterAbsorptionCoefficients;  // 0x2E0 (0x2E0)
	struct FExpressionInput WaterPhaseG;  // 0x308 (0x308)
	struct FExpressionInput ColorScaleBehindWater;  // 0x330 (0x330)
	struct FExpressionInput ClearCoatNormal;  // 0x358 (0x358)
	struct FExpressionInput CustomTangent;  // 0x380 (0x380)
	struct FShadingModelMaterialInput ShadingModel;  // 0x3A8 (0x3A8)
	char pad_976[8];  // 0x3D0 (0x3D0)
	struct USubsurfaceProfile* SubsurfaceProfile;  // 0x3D8 (0x3D8)
	struct FStrataMaterialInfo ConvertedStrataMaterialInfo;  // 0x3E0 (0x3E0)


}; 
 
 


// Class Engine.DistributionFloat
// Size: 0x38(Inherited: 0x30)
struct UDistributionFloat : UDistribution
{
	char bCanBeBaked : 1;  // 0x30 (0x30)
	char pad_48_1 : 1;  // 0x30 (0x30)
	char bBakedDataSuccesfully : 1;  // 0x30 (0x30)
	char pad_48_2 : 5;  // 0x30 (0x30)
	char pad_49[8];  // 0x31 (0x31)


}; 
 
 


// Class Engine.VolumeTexture
// Size: 0x2A0(Inherited: 0x1F0)
struct UVolumeTexture : UTexture
{
	char pad_496[160];  // 0x1F0 (0x1F0)
	enum class TextureAddress AddressMode;  // 0x290 (0x290)
	char pad_657[15];  // 0x291 (0x291)


}; 
 
 


// Class Engine.MaterialExpressionSetMaterialAttributes
// Size: 0xD0(Inherited: 0xB0)
struct UMaterialExpressionSetMaterialAttributes : UMaterialExpression
{
	struct TArray<struct FExpressionInput> Inputs;  // 0xB0 (0xB0)
	struct TArray<struct FGuid> AttributeSetTypes;  // 0xC0 (0xC0)


}; 
 
 


// Class Engine.FXSystemAsset
// Size: 0x30(Inherited: 0x28)
struct UFXSystemAsset : UObject
{
	uint32_t MaxPoolSize;  // 0x28 (0x28)
	uint32_t PoolPrimeSize;  // 0x2C (0x2C)


}; 
 
 


// Class Engine.PlayerInput
// Size: 0x498(Inherited: 0x28)
struct UPlayerInput : UObject
{
	char pad_40[376];  // 0x28 (0x28)
	struct TArray<struct FKeyBind> DebugExecBindings;  // 0x1A0 (0x1A0)
	char pad_432[48];  // 0x1B0 (0x1B0)
	struct TArray<struct FName> InvertedAxis;  // 0x1E0 (0x1E0)
	char pad_496[680];  // 0x1F0 (0x1F0)


	void SetMouseSensitivity(float Sensitivity); // Function Engine.PlayerInput.SetMouseSensitivity
	void SetBind(struct FName BindName, struct FString Command); // Function Engine.PlayerInput.SetBind
	void InvertAxisKey(struct FKey AxisKey); // Function Engine.PlayerInput.InvertAxisKey
	void InvertAxis(struct FName AxisName); // Function Engine.PlayerInput.InvertAxis
	struct APlayerController* GetOuterAPlayerController(); // Function Engine.PlayerInput.GetOuterAPlayerController
	void ClearSmoothing(); // Function Engine.PlayerInput.ClearSmoothing
}; 
 
 


// Class Engine.SoundNodeModulatorContinuous
// Size: 0x88(Inherited: 0x48)
struct USoundNodeModulatorContinuous : USoundNode
{
	struct FModulatorContinuousParams PitchModulationParams;  // 0x48 (0x48)
	struct FModulatorContinuousParams VolumeModulationParams;  // 0x68 (0x68)


}; 
 
 


// Class Engine.AnimNotify_PlayParticleEffect
// Size: 0xC0(Inherited: 0x38)
struct UAnimNotify_PlayParticleEffect : UAnimNotify
{
	struct UParticleSystem* PSTemplate;  // 0x38 (0x38)
	struct FVector LocationOffset;  // 0x40 (0x40)
	struct FRotator RotationOffset;  // 0x58 (0x58)
	struct FVector Scale;  // 0x70 (0x70)
	char pad_136[40];  // 0x88 (0x88)
	char Attached : 1;  // 0xB0 (0xB0)
	char pad_176_1 : 7;  // 0xB0 (0xB0)
	char pad_177[4];  // 0xB1 (0xB1)
	struct FName SocketName;  // 0xB4 (0xB4)
	char pad_188[4];  // 0xBC (0xBC)


}; 
 
 


// Class Engine.Subsystem
// Size: 0x30(Inherited: 0x28)
struct USubsystem : UObject
{
	char pad_40[8];  // 0x28 (0x28)


}; 
 
 


// Class Engine.LevelStreamingPersistent
// Size: 0x1B0(Inherited: 0x1B0)
struct ULevelStreamingPersistent : ULevelStreaming
{


}; 
 
 


// Class Engine.SkeletalMeshComponent
// Size: 0xF80(Inherited: 0x8A0)
struct USkeletalMeshComponent : USkinnedMeshComponent
{
	 AnimBlueprintGeneratedClass;  // 0x8A0 (0x8A0)
	UAnimInstance* AnimClass;  // 0x8A8 (0x8A8)
	struct UAnimInstance* AnimScriptInstance;  // 0x8B0 (0x8B0)
	struct UAnimInstance* PostProcessAnimInstance;  // 0x8B8 (0x8B8)
	struct FSingleAnimationPlayData AnimationData;  // 0x8C0 (0x8C0)
	char pad_2264[16];  // 0x8D8 (0x8D8)
	struct FVector RootBoneTranslation;  // 0x8E8 (0x8E8)
	struct FVector LineCheckBoundsScale;  // 0x900 (0x900)
	char pad_2328[48];  // 0x918 (0x918)
	struct TArray<struct UAnimInstance*> LinkedInstances;  // 0x948 (0x948)
	struct TArray<struct FTransform> CachedBoneSpaceTransforms;  // 0x958 (0x958)
	struct TArray<struct FTransform> CachedComponentSpaceTransforms;  // 0x968 (0x968)
	char pad_2424[176];  // 0x978 (0x978)
	float GlobalAnimRateScale;  // 0xA28 (0xA28)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType;  // 0xA2C (0xA2C)
	enum class EPhysicsTransformUpdateMode PhysicsTransformUpdateMode;  // 0xA2D (0xA2D)
	char pad_2606[1];  // 0xA2E (0xA2E)
	enum class EAnimationMode AnimationMode;  // 0xA2F (0xA2F)
	char pad_2608[1];  // 0xA30 (0xA30)
	char bDisablePostProcessBlueprint : 1;  // 0xA31 (0xA31)
	char pad_2609_1 : 1;  // 0xA31 (0xA31)
	char bUpdateOverlapsOnAnimationFinalize : 1;  // 0xA31 (0xA31)
	char pad_2609_2 : 1;  // 0xA31 (0xA31)
	char bHasValidBodies : 1;  // 0xA31 (0xA31)
	char bBlendPhysics : 1;  // 0xA31 (0xA31)
	char bEnablePhysicsOnDedicatedServer : 1;  // 0xA31 (0xA31)
	char bUpdateMeshWhenKinematic : 1;  // 0xA31 (0xA31)
	char bUpdateJointsFromAnimation : 1;  // 0xA32 (0xA32)
	char bAllowClothActors : 1;  // 0xA32 (0xA32)
	char bDisableClothSimulation : 1;  // 0xA32 (0xA32)
	char pad_2610_1 : 5;  // 0xA32 (0xA32)
	char pad_2611[6];  // 0xA33 (0xA33)
	char bDisableRigidBodyAnimNode : 1;  // 0xA38 (0xA38)
	char bAllowAnimCurveEvaluation : 1;  // 0xA38 (0xA38)
	char bDisableAnimCurves : 1;  // 0xA38 (0xA38)
	char pad_2616_1 : 3;  // 0xA38 (0xA38)
	char bCollideWithEnvironment : 1;  // 0xA38 (0xA38)
	char bCollideWithAttachedChildren : 1;  // 0xA38 (0xA38)
	char bForceCollisionUpdate : 1;  // 0xA39 (0xA39)
	char bLocalSpaceSimulation : 1;  // 0xA39 (0xA39)
	char bResetAfterTeleport : 1;  // 0xA39 (0xA39)
	char pad_2617_1 : 1;  // 0xA39 (0xA39)
	char bDeferKinematicBoneUpdate : 1;  // 0xA39 (0xA39)
	char bNoSkeletonUpdate : 1;  // 0xA39 (0xA39)
	char bPauseAnims : 1;  // 0xA39 (0xA39)
	char bUseRefPoseOnInitAnim : 1;  // 0xA39 (0xA39)
	char bEnablePerPolyCollision : 1;  // 0xA3A (0xA3A)
	char bForceRefpose : 1;  // 0xA3A (0xA3A)
	char bOnlyAllowAutonomousTickPose : 1;  // 0xA3A (0xA3A)
	char bIsAutonomousTickPose : 1;  // 0xA3A (0xA3A)
	char bOldForceRefPose : 1;  // 0xA3A (0xA3A)
	char bShowPrePhysBones : 1;  // 0xA3A (0xA3A)
	char bRequiredBonesUpToDate : 1;  // 0xA3A (0xA3A)
	char bAnimTreeInitialised : 1;  // 0xA3A (0xA3A)
	char bIncludeComponentLocationIntoBounds : 1;  // 0xA3B (0xA3B)
	char bEnableLineCheckWithBounds : 1;  // 0xA3B (0xA3B)
	char bPropagateCurvesToFollowers : 1;  // 0xA3B (0xA3B)
	char bSkipKinematicUpdateWhenInterpolating : 1;  // 0xA3B (0xA3B)
	char bSkipBoundsUpdateWhenInterpolating : 1;  // 0xA3B (0xA3B)
	char pad_2619_1 : 2;  // 0xA3B (0xA3B)
	char bNeedsQueuedAnimEventsDispatched : 1;  // 0xA3B (0xA3B)
	char pad_2620[2];  // 0xA3C (0xA3C)
	uint16_t CachedAnimCurveUidVersion;  // 0xA3E (0xA3E)
	float ClothBlendWeight;  // 0xA40 (0xA40)
	char pad_2628_1 : 7;  // 0xA44 (0xA44)
	bool bWaitForParallelClothTask : 1;  // 0xA44 (0xA44)
	char pad_2629[3];  // 0xA45 (0xA45)
	struct TArray<struct FName> DisallowedAnimCurves;  // 0xA48 (0xA48)
	struct UBodySetup* BodySetup;  // 0xA58 (0xA58)
	char pad_2656[4];  // 0xA60 (0xA60)
	float ClothMaxDistanceScale;  // 0xA64 (0xA64)
	struct FMulticastInlineDelegate OnConstraintBroken;  // 0xA68 (0xA68)
	struct FMulticastInlineDelegate OnPlasticDeformation;  // 0xA78 (0xA78)
	UClothingSimulationFactory* ClothingSimulationFactory;  // 0xA88 (0xA88)
	char pad_2704[248];  // 0xA90 (0xA90)
	float TeleportDistanceThreshold;  // 0xB88 (0xB88)
	float TeleportRotationThreshold;  // 0xB8C (0xB8C)
	char pad_2960[8];  // 0xB90 (0xB90)
	uint32_t LastPoseTickFrame;  // 0xB98 (0xB98)
	char pad_2972[148];  // 0xB9C (0xB9C)
	struct UClothingSimulationInteractor* ClothingInteractor;  // 0xC30 (0xC30)
	char pad_3128[200];  // 0xC38 (0xC38)
	struct FMulticastInlineDelegate OnAnimInitialized;  // 0xD00 (0xD00)
	char pad_3344[624];  // 0xD10 (0xD10)


	void UnlinkAnimClassLayers(UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.UnlinkAnimClassLayers
	void UnbindClothFromLeaderPoseComponent(bool bRestoreSimulationSpace); // Function Engine.SkeletalMeshComponent.UnbindClothFromLeaderPoseComponent
	void ToggleDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.ToggleDisablePostProcessBlueprint
	void TermBodiesBelow(struct FName ParentBoneName); // Function Engine.SkeletalMeshComponent.TermBodiesBelow
	void SuspendClothingSimulation(); // Function Engine.SkeletalMeshComponent.SuspendClothingSimulation
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop
	void SnapshotPose(struct FPoseSnapshot& Snapshot); // Function Engine.SkeletalMeshComponent.SnapshotPose
	void SetUpdateClothInEditor(bool NewUpdateState); // Function Engine.SkeletalMeshComponent.SetUpdateClothInEditor
	void SetUpdateAnimationInEditor(bool NewUpdateState); // Function Engine.SkeletalMeshComponent.SetUpdateAnimationInEditor
	void SetTeleportRotationThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportRotationThreshold
	void SetTeleportDistanceThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportDistanceThreshold
	void SetSkeletalMeshAsset(struct USkeletalMesh* NewMesh); // Function Engine.SkeletalMeshComponent.SetSkeletalMeshAsset
	void SetPosition(float InPos, bool bFireNotifies); // Function Engine.SkeletalMeshComponent.SetPosition
	void SetPlayRate(float Rate); // Function Engine.SkeletalMeshComponent.SetPlayRate
	void SetPhysicsBlendWeight(float PhysicsBlendWeight); // Function Engine.SkeletalMeshComponent.SetPhysicsBlendWeight
	void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetNotifyRigidBodyCollisionBelow
	void SetMorphTarget(struct FName MorphTargetName, float Value, bool bRemoveZeroWeight); // Function Engine.SkeletalMeshComponent.SetMorphTarget
	void SetEnablePhysicsBlending(bool bNewBlendPhysics); // Function Engine.SkeletalMeshComponent.SetEnablePhysicsBlending
	void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetEnableGravityOnAllBodiesBelow
	void SetEnableBodyGravity(bool bEnableGravity, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetEnableBodyGravity
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess); // Function Engine.SkeletalMeshComponent.SetDisablePostProcessBlueprint
	void SetDisableAnimCurves(bool bInDisableAnimCurves); // Function Engine.SkeletalMeshComponent.SetDisableAnimCurves
	void SetConstraintProfileForAll(struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfileForAll
	void SetConstraintProfile(struct FName JointName, struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfile
	void SetClothMaxDistanceScale(float Scale); // Function Engine.SkeletalMeshComponent.SetClothMaxDistanceScale
	void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetBodyNotifyRigidBodyCollision
	void SetAnimClass(UObject* NewClass); // Function Engine.SkeletalMeshComponent.SetAnimClass
	void SetAnimationMode(enum class EAnimationMode InAnimationMode); // Function Engine.SkeletalMeshComponent.SetAnimationMode
	void SetAnimation(struct UAnimationAsset* NewAnimToPlay); // Function Engine.SkeletalMeshComponent.SetAnimation
	void SetAngularLimits(struct FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle); // Function Engine.SkeletalMeshComponent.SetAngularLimits
	void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim); // Function Engine.SkeletalMeshComponent.SetAllowRigidBodyAnimNode
	void SetAllowedAnimCurvesEvaluation(struct TArray<struct FName>& List, bool bAllow); // Function Engine.SkeletalMeshComponent.SetAllowedAnimCurvesEvaluation
	void SetAllowClothActors(bool bInAllow); // Function Engine.SkeletalMeshComponent.SetAllowClothActors
	void SetAllowAnimCurveEvaluation(bool bInAllow); // Function Engine.SkeletalMeshComponent.SetAllowAnimCurveEvaluation
	void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive
	void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularPositionDrive
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularDriveParams
	void SetAllBodiesSimulatePhysics(bool bNewSimulate); // Function Engine.SkeletalMeshComponent.SetAllBodiesSimulatePhysics
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllBodiesPhysicsBlendWeight
	void SetAllBodiesBelowSimulatePhysics(struct FName& InBoneName, bool bNewSimulate, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowSimulatePhysics
	void SetAllBodiesBelowPhysicsDisabled(struct FName& InBoneName, bool bDisabled, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsDisabled
	void SetAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight
	void SetAllBodiesBelowLinearVelocity(struct FName& InBoneName, struct FVector& LinearVelocity, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowLinearVelocity
	void ResumeClothingSimulation(); // Function Engine.SkeletalMeshComponent.ResumeClothingSimulation
	void ResetClothTeleportMode(); // Function Engine.SkeletalMeshComponent.ResetClothTeleportMode
	void ResetAnimInstanceDynamics(uint8_t InTeleportType); // Function Engine.SkeletalMeshComponent.ResetAnimInstanceDynamics
	void ResetAllowedAnimCurveEvaluation(); // Function Engine.SkeletalMeshComponent.ResetAllowedAnimCurveEvaluation
	void ResetAllBodiesSimulatePhysics(); // Function Engine.SkeletalMeshComponent.ResetAllBodiesSimulatePhysics
	void PlayAnimation(struct UAnimationAsset* NewAnimToPlay, bool bLooping); // Function Engine.SkeletalMeshComponent.PlayAnimation
	void Play(bool bLooping); // Function Engine.SkeletalMeshComponent.Play
	void OverrideAnimationData(struct UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate); // Function Engine.SkeletalMeshComponent.OverrideAnimationData
	void LinkAnimGraphByTag(struct FName InTag, UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimGraphByTag
	void LinkAnimClassLayers(UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimClassLayers
	bool K2_GetClosestPointOnPhysicsAsset(struct FVector& WorldPosition, struct FVector& ClosestWorldPosition, struct FVector& Normal, struct FName& BoneName, float& Distance); // Function Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset
	bool IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying
	bool IsClothingSimulationSuspended(); // Function Engine.SkeletalMeshComponent.IsClothingSimulationSuspended
	bool IsBodyGravityEnabled(struct FName BoneName); // Function Engine.SkeletalMeshComponent.IsBodyGravityEnabled
	bool HasValidAnimationInstance(); // Function Engine.SkeletalMeshComponent.HasValidAnimationInstance
	bool GetTransformAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, struct FTransform& OutValue, uint8_t LookupType); // Function Engine.SkeletalMeshComponent.GetTransformAttribute_Ref
	bool GetTransformAttribute(struct FName& BoneName, struct FName& AttributeName, struct FTransform DefaultValue, struct FTransform& OutValue, uint8_t LookupType); // Function Engine.SkeletalMeshComponent.GetTransformAttribute
	float GetTeleportRotationThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportRotationThreshold
	float GetTeleportDistanceThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportDistanceThreshold
	bool GetStringAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, struct FString& OutValue, uint8_t LookupType); // Function Engine.SkeletalMeshComponent.GetStringAttribute_Ref
	bool GetStringAttribute(struct FName& BoneName, struct FName& AttributeName, struct FString DefaultValue, struct FString& OutValue, uint8_t LookupType); // Function Engine.SkeletalMeshComponent.GetStringAttribute
	struct USkeletalMesh* GetSkeletalMeshAsset(); // Function Engine.SkeletalMeshComponent.GetSkeletalMeshAsset
	struct FVector GetSkeletalCenterOfMass(); // Function Engine.SkeletalMeshComponent.GetSkeletalCenterOfMass
	struct UAnimInstance* GetPostProcessInstance(); // Function Engine.SkeletalMeshComponent.GetPostProcessInstance
	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition
	float GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate
	float GetMorphTarget(struct FName MorphTargetName); // Function Engine.SkeletalMeshComponent.GetMorphTarget
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByGroup
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByClass
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstanceByTag
	bool GetIntegerAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, int32_t& OutValue, uint8_t LookupType); // Function Engine.SkeletalMeshComponent.GetIntegerAttribute_Ref
	bool GetIntegerAttribute(struct FName& BoneName, struct FName& AttributeName, int32_t DefaultValue, int32_t& OutValue, uint8_t LookupType); // Function Engine.SkeletalMeshComponent.GetIntegerAttribute
	bool GetFloatAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, float& OutValue, uint8_t LookupType); // Function Engine.SkeletalMeshComponent.GetFloatAttribute_Ref
	bool GetFloatAttribute(struct FName& BoneName, struct FName& AttributeName, float DefaultValue, float& OutValue, uint8_t LookupType); // Function Engine.SkeletalMeshComponent.GetFloatAttribute
	bool GetDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.GetDisablePostProcessBlueprint
	bool GetDisableAnimCurves(); // Function Engine.SkeletalMeshComponent.GetDisableAnimCurves
	void GetCurrentJointAngles(struct FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle); // Function Engine.SkeletalMeshComponent.GetCurrentJointAngles
	void GetConstraintsFromBody(struct FName BodyName, bool bParentConstraints, bool bChildConstraints, bool bIncludesTerminated, struct TArray<struct FConstraintInstanceAccessor>& OutConstraints); // Function Engine.SkeletalMeshComponent.GetConstraintsFromBody
	void GetConstraints(bool bIncludesTerminated, struct TArray<struct FConstraintInstanceAccessor>& OutConstraints); // Function Engine.SkeletalMeshComponent.GetConstraints
	struct FConstraintInstanceAccessor GetConstraintByName(struct FName ConstraintName, bool bIncludesTerminated); // Function Engine.SkeletalMeshComponent.GetConstraintByName
	float GetClothMaxDistanceScale(); // Function Engine.SkeletalMeshComponent.GetClothMaxDistanceScale
	struct UClothingSimulationInteractor* GetClothingSimulationInteractor(); // Function Engine.SkeletalMeshComponent.GetClothingSimulationInteractor
	float GetBoneMass(struct FName BoneName, bool bScaleMass); // Function Engine.SkeletalMeshComponent.GetBoneMass
	struct FVector GetBoneLinearVelocity(struct FName& InBoneName); // Function Engine.SkeletalMeshComponent.GetBoneLinearVelocity
	struct UAnimInstance* GetAnimInstance(); // Function Engine.SkeletalMeshComponent.GetAnimInstance
	UObject* GetAnimClass(); // Function Engine.SkeletalMeshComponent.GetAnimClass
	enum class EAnimationMode GetAnimationMode(); // Function Engine.SkeletalMeshComponent.GetAnimationMode
	bool GetAllowRigidBodyAnimNode(); // Function Engine.SkeletalMeshComponent.GetAllowRigidBodyAnimNode
	bool GetAllowedAnimCurveEvaluate(); // Function Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate
	bool GetAllowClothActors(); // Function Engine.SkeletalMeshComponent.GetAllowClothActors
	void ForceClothNextUpdateTeleportAndReset(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleportAndReset
	void ForceClothNextUpdateTeleport(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleport
	struct FName FindConstraintBoneName(int32_t ConstraintIndex); // Function Engine.SkeletalMeshComponent.FindConstraintBoneName
	void ClearMorphTargets(); // Function Engine.SkeletalMeshComponent.ClearMorphTargets
	void BreakConstraint(struct FVector Impulse, struct FVector HitLocation, struct FName InBoneName); // Function Engine.SkeletalMeshComponent.BreakConstraint
	void BindClothToLeaderPoseComponent(); // Function Engine.SkeletalMeshComponent.BindClothToLeaderPoseComponent
	void AllowAnimCurveEvaluation(struct FName NameOfCurve, bool bAllow); // Function Engine.SkeletalMeshComponent.AllowAnimCurveEvaluation
	void AddImpulseToAllBodiesBelow(struct FVector Impulse, struct FName BoneName, bool bVelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddImpulseToAllBodiesBelow
	void AddForceToAllBodiesBelow(struct FVector Force, struct FName BoneName, bool bAccelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddForceToAllBodiesBelow
	void AccumulateAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.AccumulateAllBodiesBelowPhysicsBlendWeight
}; 
 
 


// Class Engine.EngineSubsystem
// Size: 0x30(Inherited: 0x30)
struct UEngineSubsystem : UDynamicSubsystem
{


}; 
 
 


// Class Engine.Character
// Size: 0x620(Inherited: 0x318)
struct ACharacter : APawn
{
	struct USkeletalMeshComponent* Mesh;  // 0x318 (0x318)
	struct UCharacterMovementComponent* CharacterMovement;  // 0x320 (0x320)
	struct UCapsuleComponent* CapsuleComponent;  // 0x328 (0x328)
	struct FBasedMovementInfo BasedMovement;  // 0x330 (0x330)
	struct FBasedMovementInfo ReplicatedBasedMovement;  // 0x378 (0x378)
	float AnimRootMotionTranslationScale;  // 0x3C0 (0x3C0)
	char pad_964[4];  // 0x3C4 (0x3C4)
	struct FVector BaseTranslationOffset;  // 0x3C8 (0x3C8)
	struct FQuat BaseRotationOffset;  // 0x3E0 (0x3E0)
	float ReplicatedServerLastTransformUpdateTimeStamp;  // 0x400 (0x400)
	float ReplayLastTransformUpdateTimeStamp;  // 0x404 (0x404)
	char ReplicatedMovementMode;  // 0x408 (0x408)
	char pad_1033_1 : 7;  // 0x409 (0x409)
	bool bInBaseReplication : 1;  // 0x409 (0x409)
	char pad_1034[2];  // 0x40A (0x40A)
	float CrouchedEyeHeight;  // 0x40C (0x40C)
	char bIsCrouched : 1;  // 0x410 (0x410)
	char bProxyIsJumpForceApplied : 1;  // 0x410 (0x410)
	char bPressedJump : 1;  // 0x410 (0x410)
	char bClientUpdating : 1;  // 0x410 (0x410)
	char bClientWasFalling : 1;  // 0x410 (0x410)
	char bClientResimulateRootMotion : 1;  // 0x410 (0x410)
	char bClientResimulateRootMotionSources : 1;  // 0x410 (0x410)
	char bSimGravityDisabled : 1;  // 0x410 (0x410)
	char bClientCheckEncroachmentOnNetUpdate : 1;  // 0x411 (0x411)
	char bServerMoveIgnoreRootMotion : 1;  // 0x411 (0x411)
	char bWasJumping : 1;  // 0x411 (0x411)
	char pad_1041_1 : 5;  // 0x411 (0x411)
	char pad_1042[3];  // 0x412 (0x412)
	float JumpKeyHoldTime;  // 0x414 (0x414)
	float JumpForceTimeRemaining;  // 0x418 (0x418)
	float ProxyJumpForceStartedTime;  // 0x41C (0x41C)
	float JumpMaxHoldTime;  // 0x420 (0x420)
	int32_t JumpMaxCount;  // 0x424 (0x424)
	int32_t JumpCurrentCount;  // 0x428 (0x428)
	int32_t JumpCurrentCountPreJump;  // 0x42C (0x42C)
	char pad_1072[8];  // 0x430 (0x430)
	struct FMulticastInlineDelegate OnReachedJumpApex;  // 0x438 (0x438)
	struct FMulticastInlineDelegate LandedDelegate;  // 0x448 (0x448)
	struct FMulticastInlineDelegate MovementModeChangedDelegate;  // 0x458 (0x458)
	struct FMulticastInlineDelegate OnCharacterMovementUpdated;  // 0x468 (0x468)
	struct FRootMotionSourceGroup SavedRootMotion;  // 0x478 (0x478)
	struct FRootMotionMovementParams ClientRootMotionParams;  // 0x4C0 (0x4C0)
	struct TArray<struct FSimulatedRootMotionReplicatedMove> RootMotionRepMoves;  // 0x530 (0x530)
	struct FRepRootMotionMontage RepRootMotion;  // 0x540 (0x540)
	char pad_1560[8];  // 0x618 (0x618)


	void UnCrouch(bool bClientSimulation); // Function Engine.Character.UnCrouch
	void StopJumping(); // Function Engine.Character.StopJumping
	void StopAnimMontage(struct UAnimMontage* AnimMontage); // Function Engine.Character.StopAnimMontage
	void ServerMovePacked(struct FCharacterServerMovePackedBits PackedBits); // Function Engine.Character.ServerMovePacked
	void ServerMoveOld(float OldTimeStamp, struct FVector_NetQuantize10 OldAccel, char OldMoveFlags); // Function Engine.Character.ServerMoveOld
	void ServerMoveNoBase(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // Function Engine.Character.ServerMoveNoBase
	void ServerMoveDualNoBase(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // Function Engine.Character.ServerMoveDualNoBase
	void ServerMoveDualHybridRootMotion(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.Character.ServerMoveDualHybridRootMotion
	void ServerMoveDual(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.Character.ServerMoveDual
	void ServerMove(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.Character.ServerMove
	void RootMotionDebugClientPrintOnScreen(struct FString InString); // Function Engine.Character.RootMotionDebugClientPrintOnScreen
	float PlayAnimMontage(struct UAnimMontage* AnimMontage, float InPlayRate, struct FName StartSectionName); // Function Engine.Character.PlayAnimMontage
	void OnWalkingOffLedge(struct FVector& PreviousFloorImpactNormal, struct FVector& PreviousFloorContactNormal, struct FVector& PreviousLocation, float TimeDelta); // Function Engine.Character.OnWalkingOffLedge
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement
	void OnRep_ReplayLastTransformUpdateTimeStamp(); // Function Engine.Character.OnRep_ReplayLastTransformUpdateTimeStamp
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched
	void OnLaunched(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.OnLaunched
	void OnLanded(struct FHitResult& Hit); // Function Engine.Character.OnLanded
	void OnJumped(); // Function Engine.Character.OnJumped
	void LaunchCharacter(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.LaunchCharacter
	void K2_UpdateCustomMovement(float DeltaTime); // Function Engine.Character.K2_UpdateCustomMovement
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnStartCrouch
	void K2_OnMovementModeChanged(enum class EMovementMode PrevMovementMode, enum class EMovementMode NewMovementMode, char PrevCustomMode, char NewCustomMode); // Function Engine.Character.K2_OnMovementModeChanged
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnEndCrouch
	void Jump(); // Function Engine.Character.Jump
	bool IsPlayingRootMotion(); // Function Engine.Character.IsPlayingRootMotion
	bool IsPlayingNetworkedRootMotionMontage(); // Function Engine.Character.IsPlayingNetworkedRootMotionMontage
	bool IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce
	bool HasAnyRootMotion(); // Function Engine.Character.HasAnyRootMotion
	struct UAnimMontage* GetCurrentMontage(); // Function Engine.Character.GetCurrentMontage
	struct FVector GetBaseTranslationOffset(); // Function Engine.Character.GetBaseTranslationOffset
	struct FRotator GetBaseRotationOffsetRotator(); // Function Engine.Character.GetBaseRotationOffsetRotator
	float GetAnimRootMotionTranslationScale(); // Function Engine.Character.GetAnimRootMotionTranslationScale
	void Crouch(bool bClientSimulation); // Function Engine.Character.Crouch
	void ClientVeryShortAdjustPosition(float Timestamp, struct FVector NewLoc, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientVeryShortAdjustPosition
	void ClientMoveResponsePacked(struct FCharacterMoveResponsePackedBits PackedBits); // Function Engine.Character.ClientMoveResponsePacked
	void ClientCheatWalk(); // Function Engine.Character.ClientCheatWalk
	void ClientCheatGhost(); // Function Engine.Character.ClientCheatGhost
	void ClientCheatFly(); // Function Engine.Character.ClientCheatFly
	void ClientAdjustRootMotionSourcePosition(float Timestamp, struct FRootMotionSourceGroup ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionSourcePosition
	void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionPosition
	void ClientAdjustPosition(float Timestamp, struct FVector NewLoc, struct FVector NewVel, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustPosition
	void ClientAckGoodMove(float Timestamp); // Function Engine.Character.ClientAckGoodMove
	bool CanJumpInternal(); // Function Engine.Character.CanJumpInternal
	bool CanJump(); // Function Engine.Character.CanJump
	bool CanCrouch(); // Function Engine.Character.CanCrouch
	void CacheInitialMeshOffset(struct FVector MeshRelativeLocation, struct FRotator MeshRelativeRotation); // Function Engine.Character.CacheInitialMeshOffset
}; 
 
 


// Class Engine.DynamicSubsystem
// Size: 0x30(Inherited: 0x30)
struct UDynamicSubsystem : USubsystem
{


}; 
 
 


// Class Engine.DPICustomScalingRule
// Size: 0x28(Inherited: 0x28)
struct UDPICustomScalingRule : UObject
{


}; 
 
 


// Class Engine.PrimaryDataAsset
// Size: 0x30(Inherited: 0x30)
struct UPrimaryDataAsset : UDataAsset
{


}; 
 
 


// Class Engine.MeshComponent
// Size: 0x570(Inherited: 0x540)
struct UMeshComponent : UPrimitiveComponent
{
	struct TArray<struct UMaterialInterface*> OverrideMaterials;  // 0x538 (0x538)
	struct UMaterialInterface* OverlayMaterial;  // 0x548 (0x548)
	float OverlayMaterialMaxDrawDistance;  // 0x550 (0x550)
	char pad_1372[12];  // 0x55C (0x55C)
	char bEnableMaterialParameterCaching : 1;  // 0x568 (0x568)
	char pad_1384_1 : 7;  // 0x568 (0x568)
	char pad_1385[8];  // 0x569 (0x569)


	void SetVectorParameterValueOnMaterials(struct FName ParameterName, struct FVector ParameterValue); // Function Engine.MeshComponent.SetVectorParameterValueOnMaterials
	void SetScalarParameterValueOnMaterials(struct FName ParameterName, float ParameterValue); // Function Engine.MeshComponent.SetScalarParameterValueOnMaterials
	void SetOverlayMaterialMaxDrawDistance(float InMaxDrawDistance); // Function Engine.MeshComponent.SetOverlayMaterialMaxDrawDistance
	void SetOverlayMaterial(struct UMaterialInterface* NewOverlayMaterial); // Function Engine.MeshComponent.SetOverlayMaterial
	void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32_t CinematicTextureGroups); // Function Engine.MeshComponent.PrestreamTextures
	bool IsMaterialSlotNameValid(struct FName MaterialSlotName); // Function Engine.MeshComponent.IsMaterialSlotNameValid
	struct UMaterialInterface* GetOverlayMaterial(); // Function Engine.MeshComponent.GetOverlayMaterial
	struct TArray<struct FName> GetMaterialSlotNames(); // Function Engine.MeshComponent.GetMaterialSlotNames
	struct TArray<struct UMaterialInterface*> GetMaterials(); // Function Engine.MeshComponent.GetMaterials
	int32_t GetMaterialIndex(struct FName MaterialSlotName); // Function Engine.MeshComponent.GetMaterialIndex
}; 
 
 


// Class Engine.ShapeComponent
// Size: 0x560(Inherited: 0x540)
struct UShapeComponent : UPrimitiveComponent
{
	struct UBodySetup* ShapeBodySetup;  // 0x538 (0x538)
	struct FColor ShapeColor;  // 0x540 (0x540)
	char bDrawOnlyIfSelected : 1;  // 0x544 (0x544)
	char bShouldCollideWhenPlacing : 1;  // 0x544 (0x544)
	char bDynamicObstacle : 1;  // 0x544 (0x544)
	UNavAreaBase* AreaClassOverride;  // 0x548 (0x548)
	char bUseSystemDefaultObstacleAreaClass : 1;  // 0x550 (0x550)
	char pad_1364_1 : 4;  // 0x554 (0x554)
	char pad_1365[12];  // 0x555 (0x555)


}; 
 
 


// Class Engine.NullNavSysConfig
// Size: 0x58(Inherited: 0x58)
struct UNullNavSysConfig : UNavigationSystemConfig
{


}; 
 
 


// Class Engine.SplineComponent
// Size: 0x640(Inherited: 0x540)
struct USplineComponent : UPrimitiveComponent
{
	struct FSplineCurves SplineCurves;  // 0x538 (0x538)
	struct FInterpCurveVector SplineInfo;  // 0x5A8 (0x5A8)
	struct FInterpCurveQuat SplineRotInfo;  // 0x5C0 (0x5C0)
	struct FInterpCurveVector SplineScaleInfo;  // 0x5D8 (0x5D8)
	struct FInterpCurveFloat SplineReparamTable;  // 0x5F0 (0x5F0)
	char pad_1552_1 : 7;  // 0x610 (0x610)
	bool bAllowSplineEditingPerInstance : 1;  // 0x608 (0x608)
	int32_t ReparamStepsPerSegment;  // 0x60C (0x60C)
	float Duration;  // 0x610 (0x610)
	char pad_1561_1 : 7;  // 0x619 (0x619)
	bool bStationaryEndpoints : 1;  // 0x614 (0x614)
	char pad_1562_1 : 7;  // 0x61A (0x61A)
	bool bSplineHasBeenEdited : 1;  // 0x615 (0x615)
	char pad_1563_1 : 7;  // 0x61B (0x61B)
	bool bModifiedByConstructionScript : 1;  // 0x616 (0x616)
	char pad_1564_1 : 7;  // 0x61C (0x61C)
	bool bInputSplinePointsToConstructionScript : 1;  // 0x617 (0x617)
	char pad_1565_1 : 7;  // 0x61D (0x61D)
	bool bDrawDebug : 1;  // 0x618 (0x618)
	char pad_1566_1 : 7;  // 0x61E (0x61E)
	bool bClosedLoop : 1;  // 0x619 (0x619)
	char pad_1567_1 : 7;  // 0x61F (0x61F)
	bool bLoopPositionOverride : 1;  // 0x61A (0x61A)
	float LoopPosition;  // 0x61C (0x61C)
	struct FVector DefaultUpVector;  // 0x620 (0x620)
	char pad_1596[4];  // 0x63C (0x63C)


	void UpdateSpline(); // Function Engine.SplineComponent.UpdateSpline
	void SetWorldLocationAtSplinePoint(int32_t PointIndex, struct FVector& InLocation); // Function Engine.SplineComponent.SetWorldLocationAtSplinePoint
	void SetUpVectorAtSplinePoint(int32_t PointIndex, struct FVector& InUpVector, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetUpVectorAtSplinePoint
	void SetUnselectedSplineSegmentColor(struct FLinearColor& SegmentColor); // Function Engine.SplineComponent.SetUnselectedSplineSegmentColor
	void SetTangentsAtSplinePoint(int32_t PointIndex, struct FVector& InArriveTangent, struct FVector& InLeaveTangent, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetTangentsAtSplinePoint
	void SetTangentColor(struct FLinearColor& TangentColor); // Function Engine.SplineComponent.SetTangentColor
	void SetTangentAtSplinePoint(int32_t PointIndex, struct FVector& InTangent, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetTangentAtSplinePoint
	void SetSplineWorldPoints(struct TArray<struct FVector>& Points); // Function Engine.SplineComponent.SetSplineWorldPoints
	void SetSplinePointType(int32_t PointIndex, enum class ESplinePointType Type, bool bUpdateSpline); // Function Engine.SplineComponent.SetSplinePointType
	void SetSplinePoints(struct TArray<struct FVector>& Points, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetSplinePoints
	void SetSplineLocalPoints(struct TArray<struct FVector>& Points); // Function Engine.SplineComponent.SetSplineLocalPoints
	void SetSelectedSplineSegmentColor(struct FLinearColor& SegmentColor); // Function Engine.SplineComponent.SetSelectedSplineSegmentColor
	void SetScaleAtSplinePoint(int32_t PointIndex, struct FVector& InScaleVector, bool bUpdateSpline); // Function Engine.SplineComponent.SetScaleAtSplinePoint
	void SetRotationAtSplinePoint(int32_t PointIndex, struct FRotator& InRotation, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetRotationAtSplinePoint
	void SetLocationAtSplinePoint(int32_t PointIndex, struct FVector& InLocation, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetLocationAtSplinePoint
	void SetDrawDebug(bool bShow); // Function Engine.SplineComponent.SetDrawDebug
	void SetDefaultUpVector(struct FVector& UpVector, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.SetDefaultUpVector
	void SetClosedLoopAtPosition(bool bInClosedLoop, float Key, bool bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoopAtPosition
	void SetClosedLoop(bool bInClosedLoop, bool bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoop
	void RemoveSplinePoint(int32_t Index, bool bUpdateSpline); // Function Engine.SplineComponent.RemoveSplinePoint
	bool IsClosedLoop(); // Function Engine.SplineComponent.IsClosedLoop
	struct FVector GetWorldTangentAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldTangentAtDistanceAlongSpline
	struct FRotator GetWorldRotationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldRotationAtTime
	struct FRotator GetWorldRotationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldRotationAtDistanceAlongSpline
	struct FVector GetWorldLocationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldLocationAtTime
	struct FVector GetWorldLocationAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetWorldLocationAtSplinePoint
	struct FVector GetWorldLocationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldLocationAtDistanceAlongSpline
	struct FVector GetWorldDirectionAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldDirectionAtTime
	struct FVector GetWorldDirectionAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldDirectionAtDistanceAlongSpline
	struct FVector GetVectorPropertyAtSplinePoint(int32_t Index, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSplinePoint
	struct FVector GetVectorPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSplineInputKey
	struct FVector GetUpVectorAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetUpVectorAtTime
	struct FVector GetUpVectorAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplinePoint
	struct FVector GetUpVectorAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplineInputKey
	struct FVector GetUpVectorAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtDistanceAlongSpline
	struct FTransform GetTransformAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtTime
	struct FTransform GetTransformAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtSplinePoint
	struct FTransform GetTransformAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtSplineInputKey
	struct FTransform GetTransformAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtDistanceAlongSpline
	float GetTimeAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetTimeAtDistanceAlongSpline
	struct FVector GetTangentAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetTangentAtTime
	struct FVector GetTangentAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplinePoint
	struct FVector GetTangentAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplineInputKey
	struct FVector GetTangentAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtDistanceAlongSpline
	enum class ESplinePointType GetSplinePointType(int32_t PointIndex); // Function Engine.SplineComponent.GetSplinePointType
	float GetSplineLength(); // Function Engine.SplineComponent.GetSplineLength
	struct FVector GetScaleAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetScaleAtTime
	struct FVector GetScaleAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetScaleAtSplinePoint
	struct FVector GetScaleAtSplineInputKey(float InKey); // Function Engine.SplineComponent.GetScaleAtSplineInputKey
	struct FVector GetScaleAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetScaleAtDistanceAlongSpline
	struct FRotator GetRotationAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRotationAtTime
	struct FRotator GetRotationAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtSplinePoint
	struct FRotator GetRotationAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtSplineInputKey
	struct FRotator GetRotationAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtDistanceAlongSpline
	float GetRollAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRollAtTime
	float GetRollAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtSplinePoint
	float GetRollAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtSplineInputKey
	float GetRollAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtDistanceAlongSpline
	struct FVector GetRightVectorAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRightVectorAtTime
	struct FVector GetRightVectorAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtSplinePoint
	struct FVector GetRightVectorAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtSplineInputKey
	struct FVector GetRightVectorAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtDistanceAlongSpline
	int32_t GetNumberOfSplineSegments(); // Function Engine.SplineComponent.GetNumberOfSplineSegments
	int32_t GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints
	struct FVector GetLocationAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetLocationAtTime
	struct FVector GetLocationAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtSplinePoint
	struct FVector GetLocationAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtSplineInputKey
	struct FVector GetLocationAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtDistanceAlongSpline
	void GetLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector& Location, struct FVector& Tangent, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAndTangentAtSplinePoint
	void GetLocalLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector& LocalLocation, struct FVector& LocalTangent); // Function Engine.SplineComponent.GetLocalLocationAndTangentAtSplinePoint
	struct FVector GetLeaveTangentAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLeaveTangentAtSplinePoint
	float GetInputKeyValueAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetInputKeyValueAtDistanceAlongSpline
	float GetInputKeyAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetInputKeyAtDistanceAlongSpline
	float GetFloatPropertyAtSplinePoint(int32_t Index, struct FName PropertyName); // Function Engine.SplineComponent.GetFloatPropertyAtSplinePoint
	float GetFloatPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // Function Engine.SplineComponent.GetFloatPropertyAtSplineInputKey
	float GetDistanceAlongSplineAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetDistanceAlongSplineAtSplinePoint
	float GetDistanceAlongSplineAtSplineInputKey(float InKey); // Function Engine.SplineComponent.GetDistanceAlongSplineAtSplineInputKey
	struct FVector GetDirectionAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetDirectionAtTime
	struct FVector GetDirectionAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtSplinePoint
	struct FVector GetDirectionAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtSplineInputKey
	struct FVector GetDirectionAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtDistanceAlongSpline
	struct FVector GetDefaultUpVector(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDefaultUpVector
	struct FVector GetArriveTangentAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetArriveTangentAtSplinePoint
	struct FVector FindUpVectorClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindUpVectorClosestToWorldLocation
	struct FTransform FindTransformClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.FindTransformClosestToWorldLocation
	struct FVector FindTangentClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindTangentClosestToWorldLocation
	struct FVector FindScaleClosestToWorldLocation(struct FVector& WorldLocation); // Function Engine.SplineComponent.FindScaleClosestToWorldLocation
	struct FRotator FindRotationClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRotationClosestToWorldLocation
	float FindRollClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRollClosestToWorldLocation
	struct FVector FindRightVectorClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRightVectorClosestToWorldLocation
	struct FVector FindLocationClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindLocationClosestToWorldLocation
	float FindInputKeyClosestToWorldLocation(struct FVector& WorldLocation); // Function Engine.SplineComponent.FindInputKeyClosestToWorldLocation
	struct FVector FindDirectionClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindDirectionClosestToWorldLocation
	bool DivideSplineIntoPolylineRecursiveWithDistances(float StartDistanceAlongSpline, float EndDistanceAlongSpline, enum class ESplineCoordinateSpace CoordinateSpace, float MaxSquareDistanceFromSpline, struct TArray<struct FVector>& OutPoints, struct TArray<double>& OutDistancesAlongSpline); // Function Engine.SplineComponent.DivideSplineIntoPolylineRecursiveWithDistances
	bool DivideSplineIntoPolylineRecursive(float StartDistanceAlongSpline, float EndDistanceAlongSpline, enum class ESplineCoordinateSpace CoordinateSpace, float MaxSquareDistanceFromSpline, struct TArray<struct FVector>& OutPoints); // Function Engine.SplineComponent.DivideSplineIntoPolylineRecursive
	bool ConvertSplineToPolyLine(enum class ESplineCoordinateSpace CoordinateSpace, float MaxSquareDistanceFromSpline, struct TArray<struct FVector>& OutPoints); // Function Engine.SplineComponent.ConvertSplineToPolyLine
	bool ConvertSplineSegmentToPolyLine(int32_t SplinePointStartIndex, enum class ESplineCoordinateSpace CoordinateSpace, float MaxSquareDistanceFromSpline, struct TArray<struct FVector>& OutPoints); // Function Engine.SplineComponent.ConvertSplineSegmentToPolyLine
	void ClearSplinePoints(bool bUpdateSpline); // Function Engine.SplineComponent.ClearSplinePoints
	void AddSplineWorldPoint(struct FVector& Position); // Function Engine.SplineComponent.AddSplineWorldPoint
	void AddSplinePointAtIndex(struct FVector& Position, int32_t Index, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.AddSplinePointAtIndex
	void AddSplinePoint(struct FVector& Position, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.AddSplinePoint
	void AddSplineLocalPoint(struct FVector& Position); // Function Engine.SplineComponent.AddSplineLocalPoint
	void AddPoints(struct TArray<struct FSplinePoint>& Points, bool bUpdateSpline); // Function Engine.SplineComponent.AddPoints
	void AddPoint(struct FSplinePoint& Point, bool bUpdateSpline); // Function Engine.SplineComponent.AddPoint
}; 
 
 


// Class Engine.AssetExportTask
// Size: 0x78(Inherited: 0x28)
struct UAssetExportTask : UObject
{
	struct UObject* Object;  // 0x28 (0x28)
	struct UExporter* Exporter;  // 0x30 (0x30)
	struct FString Filename;  // 0x38 (0x38)
	char pad_72_1 : 7;  // 0x48 (0x48)
	bool bSelected : 1;  // 0x48 (0x48)
	char pad_73_1 : 7;  // 0x49 (0x49)
	bool bReplaceIdentical : 1;  // 0x49 (0x49)
	char pad_74_1 : 7;  // 0x4A (0x4A)
	bool bPrompt : 1;  // 0x4A (0x4A)
	char pad_75_1 : 7;  // 0x4B (0x4B)
	bool bAutomated : 1;  // 0x4B (0x4B)
	char pad_76_1 : 7;  // 0x4C (0x4C)
	bool bUseFileArchive : 1;  // 0x4C (0x4C)
	char pad_77_1 : 7;  // 0x4D (0x4D)
	bool bWriteEmptyFiles : 1;  // 0x4D (0x4D)
	char pad_78[2];  // 0x4E (0x4E)
	struct TArray<struct UObject*> IgnoreObjectList;  // 0x50 (0x50)
	struct UObject* Options;  // 0x60 (0x60)
	struct TArray<struct FString> Errors;  // 0x68 (0x68)


}; 
 
 


// Class Engine.BoxComponent
// Size: 0x580(Inherited: 0x560)
struct UBoxComponent : UShapeComponent
{
	struct FVector BoxExtent;  // 0x558 (0x558)
	float LineThickness;  // 0x570 (0x570)
	char pad_1404[4];  // 0x57C (0x57C)


	void SetLineThickness(float Thickness); // Function Engine.BoxComponent.SetLineThickness
	void SetBoxExtent(struct FVector InBoxExtent, bool bUpdateOverlaps); // Function Engine.BoxComponent.SetBoxExtent
	struct FVector GetUnscaledBoxExtent(); // Function Engine.BoxComponent.GetUnscaledBoxExtent
	struct FVector GetScaledBoxExtent(); // Function Engine.BoxComponent.GetScaledBoxExtent
}; 
 
 


// Class Engine.GameModeBase
// Size: 0x330(Inherited: 0x290)
struct AGameModeBase : AInfo
{
	struct FString OptionsString;  // 0x290 (0x290)
	AGameSession* GameSessionClass;  // 0x2A0 (0x2A0)
	AGameStateBase* GameStateClass;  // 0x2A8 (0x2A8)
	APlayerController* PlayerControllerClass;  // 0x2B0 (0x2B0)
	APlayerState* PlayerStateClass;  // 0x2B8 (0x2B8)
	AHUD* HUDClass;  // 0x2C0 (0x2C0)
	APawn* DefaultPawnClass;  // 0x2C8 (0x2C8)
	ASpectatorPawn* SpectatorClass;  // 0x2D0 (0x2D0)
	APlayerController* ReplaySpectatorPlayerControllerClass;  // 0x2D8 (0x2D8)
	AServerStatReplicator* ServerStatReplicatorClass;  // 0x2E0 (0x2E0)
	struct AGameSession* GameSession;  // 0x2E8 (0x2E8)
	struct AGameStateBase* GameState;  // 0x2F0 (0x2F0)
	struct AServerStatReplicator* ServerStatReplicator;  // 0x2F8 (0x2F8)
	struct FText DefaultPlayerName;  // 0x300 (0x300)
	char bUseSeamlessTravel : 1;  // 0x318 (0x318)
	char bStartPlayersAsSpectators : 1;  // 0x318 (0x318)
	char bPauseable : 1;  // 0x318 (0x318)
	char pad_792_1 : 5;  // 0x318 (0x318)
	char pad_793[24];  // 0x319 (0x319)


	void StartPlay(); // Function Engine.GameModeBase.StartPlay
	struct APawn* SpawnDefaultPawnFor(struct AController* NewPlayer, struct AActor* StartSpot); // Function Engine.GameModeBase.SpawnDefaultPawnFor
	struct APawn* SpawnDefaultPawnAtTransform(struct AController* NewPlayer, struct FTransform& SpawnTransform); // Function Engine.GameModeBase.SpawnDefaultPawnAtTransform
	bool ShouldReset(struct AActor* ActorToReset); // Function Engine.GameModeBase.ShouldReset
	void ReturnToMainMenuHost(); // Function Engine.GameModeBase.ReturnToMainMenuHost
	void RestartPlayerAtTransform(struct AController* NewPlayer, struct FTransform& SpawnTransform); // Function Engine.GameModeBase.RestartPlayerAtTransform
	void RestartPlayerAtPlayerStart(struct AController* NewPlayer, struct AActor* StartSpot); // Function Engine.GameModeBase.RestartPlayerAtPlayerStart
	void RestartPlayer(struct AController* NewPlayer); // Function Engine.GameModeBase.RestartPlayer
	void ResetLevel(); // Function Engine.GameModeBase.ResetLevel
	bool PlayerCanRestart(struct APlayerController* Player); // Function Engine.GameModeBase.PlayerCanRestart
	bool MustSpectate(struct APlayerController* NewPlayerController); // Function Engine.GameModeBase.MustSpectate
	void K2_PostLogin(struct APlayerController* NewPlayer); // Function Engine.GameModeBase.K2_PostLogin
	void K2_OnSwapPlayerControllers(struct APlayerController* OldPC, struct APlayerController* NewPC); // Function Engine.GameModeBase.K2_OnSwapPlayerControllers
	void K2_OnRestartPlayer(struct AController* NewPlayer); // Function Engine.GameModeBase.K2_OnRestartPlayer
	void K2_OnLogout(struct AController* ExitingController); // Function Engine.GameModeBase.K2_OnLogout
	void K2_OnChangeName(struct AController* Other, struct FString NewName, bool bNameChange); // Function Engine.GameModeBase.K2_OnChangeName
	struct AActor* K2_FindPlayerStart(struct AController* Player, struct FString IncomingName); // Function Engine.GameModeBase.K2_FindPlayerStart
	void InitStartSpot(struct AActor* StartSpot, struct AController* NewPlayer); // Function Engine.GameModeBase.InitStartSpot
	void InitializeHUDForPlayer(struct APlayerController* NewPlayer); // Function Engine.GameModeBase.InitializeHUDForPlayer
	bool HasMatchStarted(); // Function Engine.GameModeBase.HasMatchStarted
	bool HasMatchEnded(); // Function Engine.GameModeBase.HasMatchEnded
	void HandleStartingNewPlayer(struct APlayerController* NewPlayer); // Function Engine.GameModeBase.HandleStartingNewPlayer
	int32_t GetNumSpectators(); // Function Engine.GameModeBase.GetNumSpectators
	int32_t GetNumPlayers(); // Function Engine.GameModeBase.GetNumPlayers
	UObject* GetDefaultPawnClassForController(struct AController* InController); // Function Engine.GameModeBase.GetDefaultPawnClassForController
	struct AActor* FindPlayerStart(struct AController* Player, struct FString IncomingName); // Function Engine.GameModeBase.FindPlayerStart
	struct AActor* ChoosePlayerStart(struct AController* Player); // Function Engine.GameModeBase.ChoosePlayerStart
	void ChangeName(struct AController* Controller, struct FString NewName, bool bNameChange); // Function Engine.GameModeBase.ChangeName
	bool CanSpectate(struct APlayerController* Viewer, struct APlayerState* ViewTarget); // Function Engine.GameModeBase.CanSpectate
}; 
 
 


// Class Engine.MaterialFunctionInterfaceEditorOnlyData
// Size: 0x28(Inherited: 0x28)
struct UMaterialFunctionInterfaceEditorOnlyData : UObject
{


}; 
 
 


// Class Engine.MaterialExpressionDeriveNormalZ
// Size: 0xD8(Inherited: 0xB0)
struct UMaterialExpressionDeriveNormalZ : UMaterialExpression
{
	struct FExpressionInput InXY;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.MaterialInstanceConstant
// Size: 0x200(Inherited: 0x1F8)
struct UMaterialInstanceConstant : UMaterialInstance
{
	struct UPhysicalMaterialMask* PhysMaterialMask;  // 0x1F8 (0x1F8)


	struct FLinearColor K2_GetVectorParameterValue(struct FName ParameterName); // Function Engine.MaterialInstanceConstant.K2_GetVectorParameterValue
	struct UTexture* K2_GetTextureParameterValue(struct FName ParameterName); // Function Engine.MaterialInstanceConstant.K2_GetTextureParameterValue
	float K2_GetScalarParameterValue(struct FName ParameterName); // Function Engine.MaterialInstanceConstant.K2_GetScalarParameterValue
}; 
 
 


// Class Engine.Volume
// Size: 0x2C8(Inherited: 0x2C8)
struct AVolume : ABrush
{


}; 
 
 


// Class Engine.LevelStreamingLevelInstance
// Size: 0x1D0(Inherited: 0x1B0)
struct ULevelStreamingLevelInstance : ULevelStreamingDynamic
{
	char pad_432[32];  // 0x1B0 (0x1B0)


}; 
 
 


// Class Engine.ParticleModuleTrailSource
// Size: 0x90(Inherited: 0x30)
struct UParticleModuleTrailSource : UParticleModuleTrailBase
{
	enum class ETrail2SourceMethod SourceMethod;  // 0x30 (0x30)
	char pad_49[3];  // 0x31 (0x31)
	struct FName SourceName;  // 0x34 (0x34)
	char pad_60[4];  // 0x3C (0x3C)
	struct FRawDistributionFloat SourceStrength;  // 0x40 (0x40)
	char bLockSourceStength : 1;  // 0x70 (0x70)
	char pad_112_1 : 7;  // 0x70 (0x70)
	char pad_113[4];  // 0x71 (0x71)
	int32_t SourceOffsetCount;  // 0x74 (0x74)
	struct TArray<struct FVector> SourceOffsetDefaults;  // 0x78 (0x78)
	enum class EParticleSourceSelectionMethod SelectionMethod;  // 0x88 (0x88)
	char pad_137[3];  // 0x89 (0x89)
	char bInheritRotation : 1;  // 0x8C (0x8C)
	char pad_140_1 : 7;  // 0x8C (0x8C)
	char pad_141[4];  // 0x8D (0x8D)


}; 
 
 


// Class Engine.MaterialExpressionCeil
// Size: 0xD8(Inherited: 0xB0)
struct UMaterialExpressionCeil : UMaterialExpression
{
	struct FExpressionInput Input;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.WorldPartitionMiniMapVolume
// Size: 0x2C8(Inherited: 0x2C8)
struct AWorldPartitionMiniMapVolume : AVolume
{


}; 
 
 


// Class Engine.MaterialExpressionTextureSample
// Size: 0x1B8(Inherited: 0xC0)
struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase
{
	struct FExpressionInput Coordinates;  // 0xC0 (0xC0)
	struct FExpressionInput TextureObject;  // 0xE8 (0xE8)
	struct FExpressionInput MipValue;  // 0x110 (0x110)
	struct FExpressionInput CoordinatesDX;  // 0x138 (0x138)
	struct FExpressionInput CoordinatesDY;  // 0x160 (0x160)
	struct FExpressionInput AutomaticViewMipBiasValue;  // 0x188 (0x188)
	enum class ETextureMipValueMode MipValueMode;  // 0x1B0 (0x1B0)
	enum class ESamplerSourceMode SamplerSource;  // 0x1B1 (0x1B1)
	char AutomaticViewMipBias : 1;  // 0x1B2 (0x1B2)
	char pad_434_1 : 7;  // 0x1B2 (0x1B2)
	char ConstCoordinate;  // 0x1B3 (0x1B3)
	int32_t ConstMipValue;  // 0x1B4 (0x1B4)


}; 
 
 


// Class Engine.MaterialExpressionStrataLightFunction
// Size: 0xD8(Inherited: 0xB0)
struct UMaterialExpressionStrataLightFunction : UMaterialExpressionStrataBSDF
{
	struct FExpressionInput Color;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.HLODBuilder
// Size: 0x28(Inherited: 0x28)
struct UHLODBuilder : UObject
{


}; 
 
 


// Class Engine.CompositeDataTable
// Size: 0xD8(Inherited: 0xB0)
struct UCompositeDataTable : UDataTable
{
	struct TArray<struct UDataTable*> ParentTables;  // 0xB0 (0xB0)
	struct TArray<struct UDataTable*> OldParentTables;  // 0xC0 (0xC0)
	char pad_208[8];  // 0xD0 (0xD0)


}; 
 
 


// Class Engine.MaterialExpressionShadingPathSwitch
// Size: 0x150(Inherited: 0xB0)
struct UMaterialExpressionShadingPathSwitch : UMaterialExpression
{
	struct FExpressionInput Default;  // 0xB0 (0xB0)
	struct FExpressionInput Inputs[3];  // 0xD8 (0xD8)


}; 
 
 


// Class Engine.World
// Size: 0x898(Inherited: 0x28)
struct UWorld : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	struct ULevel* PersistentLevel;  // 0x30 (0x30)
	struct UNetDriver* NetDriver;  // 0x38 (0x38)
	struct ULineBatchComponent* LineBatcher;  // 0x40 (0x40)
	struct ULineBatchComponent* PersistentLineBatcher;  // 0x48 (0x48)
	struct ULineBatchComponent* ForegroundLineBatcher;  // 0x50 (0x50)
	struct AGameNetworkManager* NetworkManager;  // 0x58 (0x58)
	struct UPhysicsCollisionHandler* PhysicsCollisionHandler;  // 0x60 (0x60)
	struct TArray<struct UObject*> ExtraReferencedObjects;  // 0x68 (0x68)
	struct TArray<struct UObject*> PerModuleDataObjects;  // 0x78 (0x78)
	struct TArray<struct ULevelStreaming*> StreamingLevels;  // 0x88 (0x88)
	struct FStreamingLevelsToConsider StreamingLevelsToConsider;  // 0x98 (0x98)
	struct AServerStreamingLevelsVisibility* ServerStreamingLevelsVisibility;  // 0xC0 (0xC0)
	struct FString StreamingLevelsPrefix;  // 0xC8 (0xC8)
	char pad_216[8];  // 0xD8 (0xD8)
	struct ULevel* CurrentLevelPendingVisibility;  // 0xE0 (0xE0)
	struct ULevel* CurrentLevelPendingInvisibility;  // 0xE8 (0xE8)
	struct UDemoNetDriver* DemoNetDriver;  // 0xF0 (0xF0)
	struct AParticleEventManager* MyParticleEventManager;  // 0xF8 (0xF8)
	struct APhysicsVolume* DefaultPhysicsVolume;  // 0x100 (0x100)
	char pad_264[54];  // 0x108 (0x108)
	char pad_318_1 : 2;  // 0x13E (0x13E)
	char bAreConstraintsDirty : 1;  // 0x13E (0x13E)
	char pad_318_2 : 5;  // 0x13E (0x13E)
	char pad_319[10];  // 0x13F (0x13F)
	struct UNavigationSystemBase* NavigationSystem;  // 0x148 (0x148)
	struct AGameModeBase* AuthorityGameMode;  // 0x150 (0x150)
	struct AGameStateBase* GameState;  // 0x158 (0x158)
	struct UAISystemBase* AISystem;  // 0x160 (0x160)
	struct UAvoidanceManager* AvoidanceManager;  // 0x168 (0x168)
	struct TArray<struct ULevel*> Levels;  // 0x170 (0x170)
	struct TArray<struct FLevelCollection> LevelCollections;  // 0x180 (0x180)
	char pad_400[40];  // 0x190 (0x190)
	struct UGameInstance* OwningGameInstance;  // 0x1B8 (0x1B8)
	struct TArray<struct UMaterialParameterCollectionInstance*> ParameterCollectionInstances;  // 0x1C0 (0x1C0)
	struct UCanvas* CanvasForRenderingToTarget;  // 0x1D0 (0x1D0)
	struct UCanvas* CanvasForDrawMaterialToRenderTarget;  // 0x1D8 (0x1D8)
	char pad_480[112];  // 0x1E0 (0x1E0)
	struct UPhysicsFieldComponent* PhysicsField;  // 0x250 (0x250)
	uint32_t LWILastAssignedUID;  // 0x258 (0x258)
	char pad_604[4];  // 0x25C (0x25C)
	struct TSet<struct UActorComponent*> ComponentsThatNeedPreEndOfFrameSync;  // 0x260 (0x260)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate;  // 0x2B0 (0x2B0)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate_OnGameThread;  // 0x2C0 (0x2C0)
	char pad_720[1016];  // 0x2D0 (0x2D0)
	struct UWorldComposition* WorldComposition;  // 0x6C8 (0x6C8)
	struct UContentBundleManager* ContentBundleManager;  // 0x6D0 (0x6D0)
	char pad_1752[168];  // 0x6D8 (0x6D8)
	struct FWorldPSCPool PSCPool;  // 0x780 (0x780)
	char pad_2008[192];  // 0x7D8 (0x7D8)


	struct AWorldSettings* K2_GetWorldSettings(); // Function Engine.World.K2_GetWorldSettings
	void HandleTimelineScrubbed(); // Function Engine.World.HandleTimelineScrubbed
}; 
 
 


// Class Engine.ComponentElementSelectionInterface
// Size: 0x30(Inherited: 0x28)
struct UComponentElementSelectionInterface : UObject
{
	char pad_40[8];  // 0x28 (0x28)


}; 
 
 


// Class Engine.MaterialExpressionCrossProduct
// Size: 0x100(Inherited: 0xB0)
struct UMaterialExpressionCrossProduct : UMaterialExpression
{
	struct FExpressionInput A;  // 0xB0 (0xB0)
	struct FExpressionInput B;  // 0xD8 (0xD8)


}; 
 
 


// Class Engine.ReplicationConnectionDriver
// Size: 0x28(Inherited: 0x28)
struct UReplicationConnectionDriver : UObject
{


}; 
 
 


// Class Engine.AsyncActionLoadPrimaryAssetList
// Size: 0x88(Inherited: 0x78)
struct UAsyncActionLoadPrimaryAssetList : UAsyncActionLoadPrimaryAssetBase
{
	struct FMulticastInlineDelegate Completed;  // 0x78 (0x78)


	struct UAsyncActionLoadPrimaryAssetList* AsyncLoadPrimaryAssetList(struct UObject* WorldContextObject, struct TArray<struct FPrimaryAssetId>& PrimaryAssetList, struct TArray<struct FName>& LoadBundles); // Function Engine.AsyncActionLoadPrimaryAssetList.AsyncLoadPrimaryAssetList
}; 
 
 


// Class Engine.MaterialExpressionAppendVector
// Size: 0x100(Inherited: 0xB0)
struct UMaterialExpressionAppendVector : UMaterialExpression
{
	struct FExpressionInput A;  // 0xB0 (0xB0)
	struct FExpressionInput B;  // 0xD8 (0xD8)


}; 
 
 


// Class Engine.MaterialExpressionTextureObjectParameter
// Size: 0x240(Inherited: 0x240)
struct UMaterialExpressionTextureObjectParameter : UMaterialExpressionTextureSampleParameter
{


}; 
 
 


// Class Engine.BookMark2D
// Size: 0x38(Inherited: 0x28)
struct UBookMark2D : UBookmarkBase
{
	float Zoom2D;  // 0x28 (0x28)
	struct FIntPoint Location;  // 0x2C (0x2C)
	char pad_52[4];  // 0x34 (0x34)


}; 
 
 


// Class Engine.AnimCompress_PerTrackCompression
// Size: 0xD8(Inherited: 0x60)
struct UAnimCompress_PerTrackCompression : UAnimCompress_RemoveLinearKeys
{
	float MaxZeroingThreshold;  // 0x60 (0x60)
	float MaxPosDiffBitwise;  // 0x64 (0x64)
	float MaxAngleDiffBitwise;  // 0x68 (0x68)
	float MaxScaleDiffBitwise;  // 0x6C (0x6C)
	struct TArray<enum class AnimationCompressionFormat> AllowedRotationFormats;  // 0x70 (0x70)
	struct TArray<enum class AnimationCompressionFormat> AllowedTranslationFormats;  // 0x80 (0x80)
	struct TArray<enum class AnimationCompressionFormat> AllowedScaleFormats;  // 0x90 (0x90)
	char bResampleAnimation : 1;  // 0xA0 (0xA0)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	char pad_161[4];  // 0xA1 (0xA1)
	float ResampledFramerate;  // 0xA4 (0xA4)
	int32_t MinKeysForResampling;  // 0xA8 (0xA8)
	char bUseAdaptiveError : 1;  // 0xAC (0xAC)
	char bUseOverrideForEndEffectors : 1;  // 0xAC (0xAC)
	char pad_172_1 : 6;  // 0xAC (0xAC)
	char pad_173[4];  // 0xAD (0xAD)
	int32_t TrackHeightBias;  // 0xB0 (0xB0)
	float ParentingDivisor;  // 0xB4 (0xB4)
	float ParentingDivisorExponent;  // 0xB8 (0xB8)
	char bUseAdaptiveError2 : 1;  // 0xBC (0xBC)
	char pad_188_1 : 7;  // 0xBC (0xBC)
	char pad_189[4];  // 0xBD (0xBD)
	float RotationErrorSourceRatio;  // 0xC0 (0xC0)
	float TranslationErrorSourceRatio;  // 0xC4 (0xC4)
	float ScaleErrorSourceRatio;  // 0xC8 (0xC8)
	float MaxErrorPerTrackRatio;  // 0xCC (0xCC)
	float PerturbationProbeSize;  // 0xD0 (0xD0)
	char pad_212[4];  // 0xD4 (0xD4)


}; 
 
 


// Class Engine.SplineMetadata
// Size: 0x28(Inherited: 0x28)
struct USplineMetadata : UObject
{


}; 
 
 


// Class Engine.BlendProfile
// Size: 0x50(Inherited: 0x28)
struct UBlendProfile : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	struct USkeleton* OwningSkeleton;  // 0x30 (0x30)
	struct TArray<struct FBlendProfileBoneEntry> ProfileEntries;  // 0x38 (0x38)
	uint8_t Mode;  // 0x48 (0x48)
	char pad_73[7];  // 0x49 (0x49)


}; 
 
 


// Class Engine.Texture
// Size: 0x1F0(Inherited: 0xD0)
struct UTexture : UStreamableRenderAsset
{
	char pad_208[16];  // 0xD0 (0xD0)
	struct FGuid LightingGuid;  // 0xE0 (0xE0)
	int32_t LevelIndex;  // 0xF0 (0xF0)
	int32_t LODBias;  // 0xF4 (0xF4)
	enum class TextureCompressionSettings CompressionSettings;  // 0xF8 (0xF8)
	enum class TextureFilter Filter;  // 0xF9 (0xF9)
	uint8_t MipLoadOptions;  // 0xFA (0xFA)
	enum class TextureGroup LODGroup;  // 0xFB (0xFB)
	struct FPerPlatformFloat Downscale;  // 0xFC (0xFC)
	uint8_t DownscaleOptions;  // 0x100 (0x100)
	char SRGB : 1;  // 0x101 (0x101)
	char bNoTiling : 1;  // 0x101 (0x101)
	char VirtualTextureStreaming : 1;  // 0x101 (0x101)
	char CompressionYCoCg : 1;  // 0x101 (0x101)
	char bNotOfflineProcessed : 1;  // 0x101 (0x101)
	char bAsyncResourceReleaseHasBeenStarted : 1;  // 0x101 (0x101)
	char pad_257_1 : 2;  // 0x101 (0x101)
	char pad_258[7];  // 0x102 (0x102)
	struct TArray<struct UAssetUserData*> AssetUserData;  // 0x108 (0x108)
	char pad_280[216];  // 0x118 (0x118)


	int64_t Blueprint_GetMemorySize(); // Function Engine.Texture.Blueprint_GetMemorySize
}; 
 
 


// Class Engine.RuntimeHashExternalStreamingObjectBase
// Size: 0x90(Inherited: 0x28)
struct URuntimeHashExternalStreamingObjectBase : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	struct TSoftObjectPtr<UWorld> OwningWorld;  // 0x30 (0x30)
	struct TSoftObjectPtr<UWorld> OuterWorld;  // 0x60 (0x60)


}; 
 
 


// Class Engine.MaterialExpressionLogarithm10
// Size: 0xD8(Inherited: 0xB0)
struct UMaterialExpressionLogarithm10 : UMaterialExpression
{
	struct FExpressionInput X;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.AssetManager
// Size: 0x4E8(Inherited: 0x28)
struct UAssetManager : UObject
{
	char pad_40[776];  // 0x28 (0x28)
	struct TArray<struct UObject*> ObjectReferenceList;  // 0x330 (0x330)
	char pad_832_1 : 7;  // 0x340 (0x340)
	bool bIsGlobalAsyncScanEnvironment : 1;  // 0x340 (0x340)
	char pad_833_1 : 7;  // 0x341 (0x341)
	bool bShouldGuessTypeAndName : 1;  // 0x341 (0x341)
	char pad_834_1 : 7;  // 0x342 (0x342)
	bool bShouldUseSynchronousLoad : 1;  // 0x342 (0x342)
	char pad_835_1 : 7;  // 0x343 (0x343)
	bool bIsLoadingFromPakFiles : 1;  // 0x343 (0x343)
	char pad_836_1 : 7;  // 0x344 (0x344)
	bool bShouldAcquireMissingChunksOnLoad : 1;  // 0x344 (0x344)
	char pad_837_1 : 7;  // 0x345 (0x345)
	bool bOnlyCookProductionAssets : 1;  // 0x345 (0x345)
	char pad_838[2];  // 0x346 (0x346)
	int32_t NumBulkScanRequests;  // 0x348 (0x348)
	char pad_844_1 : 7;  // 0x34C (0x34C)
	bool bIsPrimaryAssetDirectoryCurrent : 1;  // 0x34C (0x34C)
	char pad_845_1 : 7;  // 0x34D (0x34D)
	bool bIsManagementDatabaseCurrent : 1;  // 0x34D (0x34D)
	char pad_846_1 : 7;  // 0x34E (0x34E)
	bool bUpdateManagementDatabaseAfterScan : 1;  // 0x34E (0x34E)
	char pad_847_1 : 7;  // 0x34F (0x34F)
	bool bIncludeOnlyOnDiskAssets : 1;  // 0x34F (0x34F)
	char pad_848_1 : 7;  // 0x350 (0x350)
	bool bHasCompletedInitialScan : 1;  // 0x350 (0x350)
	char pad_849[3];  // 0x351 (0x351)
	int32_t NumberOfSpawnedNotifications;  // 0x354 (0x354)
	char pad_856[400];  // 0x358 (0x358)


}; 
 
 


// Class Engine.WorldSubsystem
// Size: 0x30(Inherited: 0x30)
struct UWorldSubsystem : USubsystem
{


}; 
 
 


// Class Engine.ParticleModuleMeshRotation
// Size: 0x98(Inherited: 0x30)
struct UParticleModuleMeshRotation : UParticleModuleRotationBase
{
	struct FRawDistributionVector StartRotation;  // 0x30 (0x30)
	char bInheritParent : 1;  // 0x90 (0x90)
	char pad_144_1 : 7;  // 0x90 (0x90)
	char pad_145[8];  // 0x91 (0x91)


}; 
 
 


// Class Engine.ReplicationDriver
// Size: 0x28(Inherited: 0x28)
struct UReplicationDriver : UObject
{


}; 
 
 


// Class Engine.MaterialExpressionParticleRelativeTime
// Size: 0xB0(Inherited: 0xB0)
struct UMaterialExpressionParticleRelativeTime : UMaterialExpression
{


}; 
 
 


// Class Engine.DemoPendingNetGame
// Size: 0xC0(Inherited: 0xC0)
struct UDemoPendingNetGame : UPendingNetGame
{


}; 
 
 


// Class Engine.SkeletalBodySetup
// Size: 0x308(Inherited: 0x2F0)
struct USkeletalBodySetup : UBodySetup
{
	char pad_752_1 : 7;  // 0x2F0 (0x2F0)
	bool bSkipScaleFromAnimation : 1;  // 0x2F0 (0x2F0)
	char pad_753[7];  // 0x2F1 (0x2F1)
	struct TArray<struct FPhysicalAnimationProfile> PhysicalAnimationData;  // 0x2F8 (0x2F8)


}; 
 
 


// Class Engine.InputSettings
// Size: 0x140(Inherited: 0x28)
struct UInputSettings : UObject
{
	struct TArray<struct FInputAxisConfigEntry> AxisConfig;  // 0x28 (0x28)
	char bAltEnterTogglesFullscreen : 1;  // 0x38 (0x38)
	char bF11TogglesFullscreen : 1;  // 0x38 (0x38)
	char bUseMouseForTouch : 1;  // 0x38 (0x38)
	char bEnableMouseSmoothing : 1;  // 0x38 (0x38)
	char bEnableFOVScaling : 1;  // 0x38 (0x38)
	char bCaptureMouseOnLaunch : 1;  // 0x38 (0x38)
	char bEnableLegacyInputScales : 1;  // 0x38 (0x38)
	char bEnableMotionControls : 1;  // 0x38 (0x38)
	char bFilterInputByPlatformUser : 1;  // 0x39 (0x39)
	char bShouldFlushPressedKeysOnViewportFocusLost : 1;  // 0x39 (0x39)
	char bEnableDynamicComponentInputBinding : 1;  // 0x39 (0x39)
	char bAlwaysShowTouchInterface : 1;  // 0x39 (0x39)
	char bShowConsoleOnFourFingerTap : 1;  // 0x39 (0x39)
	char bEnableGestureRecognizer : 1;  // 0x39 (0x39)
	char bUseAutocorrect : 1;  // 0x39 (0x39)
	char pad_57_1 : 1;  // 0x39 (0x39)
	char pad_58[7];  // 0x3A (0x3A)
	struct TArray<struct FString> ExcludedAutocorrectOS;  // 0x40 (0x40)
	struct TArray<struct FString> ExcludedAutocorrectCultures;  // 0x50 (0x50)
	struct TArray<struct FString> ExcludedAutocorrectDeviceModels;  // 0x60 (0x60)
	uint8_t DefaultViewportMouseCaptureMode;  // 0x70 (0x70)
	uint8_t DefaultViewportMouseLockMode;  // 0x71 (0x71)
	char pad_114[2];  // 0x72 (0x72)
	float FOVScale;  // 0x74 (0x74)
	float DoubleClickTime;  // 0x78 (0x78)
	char pad_124[4];  // 0x7C (0x7C)
	struct TArray<struct FInputActionKeyMapping> ActionMappings;  // 0x80 (0x80)
	struct TArray<struct FInputAxisKeyMapping> AxisMappings;  // 0x90 (0x90)
	struct TArray<struct FInputActionSpeechMapping> SpeechMappings;  // 0xA0 (0xA0)
	struct TSoftClassPtr<UObject> DefaultPlayerInputClass;  // 0xB0 (0xB0)
	struct TSoftClassPtr<UObject> DefaultInputComponentClass;  // 0xE0 (0xE0)
	struct FSoftObjectPath DefaultTouchInterface;  // 0x110 (0x110)
	struct TArray<struct FKey> ConsoleKeys;  // 0x130 (0x130)


	void SaveKeyMappings(); // Function Engine.InputSettings.SaveKeyMappings
	void RemoveAxisMapping(struct FInputAxisKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.RemoveAxisMapping
	void RemoveActionMapping(struct FInputActionKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.RemoveActionMapping
	struct UInputSettings* GetInputSettings(); // Function Engine.InputSettings.GetInputSettings
	void GetAxisNames(struct TArray<struct FName>& AxisNames); // Function Engine.InputSettings.GetAxisNames
	void GetAxisMappingByName(struct FName InAxisName, struct TArray<struct FInputAxisKeyMapping>& OutMappings); // Function Engine.InputSettings.GetAxisMappingByName
	void GetActionNames(struct TArray<struct FName>& ActionNames); // Function Engine.InputSettings.GetActionNames
	void GetActionMappingByName(struct FName InActionName, struct TArray<struct FInputActionKeyMapping>& OutMappings); // Function Engine.InputSettings.GetActionMappingByName
	void ForceRebuildKeymaps(); // Function Engine.InputSettings.ForceRebuildKeymaps
	void AddAxisMapping(struct FInputAxisKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.AddAxisMapping
	void AddActionMapping(struct FInputActionKeyMapping& KeyMapping, bool bForceRebuildKeymaps); // Function Engine.InputSettings.AddActionMapping
}; 
 
 


// Class Engine.NetDriver
// Size: 0x790(Inherited: 0x28)
struct UNetDriver : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	struct FString NetConnectionClassName;  // 0x30 (0x30)
	struct FString ReplicationDriverClassName;  // 0x40 (0x40)
	struct FString ReplicationBridgeClassName;  // 0x50 (0x50)
	int32_t MaxDownloadSize;  // 0x60 (0x60)
	char bClampListenServerTickRate : 1;  // 0x64 (0x64)
	char pad_100_1 : 7;  // 0x64 (0x64)
	char pad_101[4];  // 0x65 (0x65)
	int32_t NetServerMaxTickRate;  // 0x68 (0x68)
	int32_t MaxNetTickRate;  // 0x6C (0x6C)
	int32_t MaxInternetClientRate;  // 0x70 (0x70)
	int32_t MaxClientRate;  // 0x74 (0x74)
	float ServerTravelPause;  // 0x78 (0x78)
	float SpawnPrioritySeconds;  // 0x7C (0x7C)
	float RelevantTimeout;  // 0x80 (0x80)
	float KeepAliveTime;  // 0x84 (0x84)
	float InitialConnectTimeout;  // 0x88 (0x88)
	float ConnectionTimeout;  // 0x8C (0x8C)
	float TimeoutMultiplierForUnoptimizedBuilds;  // 0x90 (0x90)
	char pad_148[4];  // 0x94 (0x94)
	struct UNetConnection* ServerConnection;  // 0x98 (0x98)
	struct TArray<struct UNetConnection*> ClientConnections;  // 0xA0 (0xA0)
	char pad_176[96];  // 0xB0 (0xB0)
	int32_t RecentlyDisconnectedTrackingTime;  // 0x110 (0x110)
	char pad_276[60];  // 0x114 (0x114)
	struct UWorld* World;  // 0x150 (0x150)
	struct UPackage* WorldPackage;  // 0x158 (0x158)
	char pad_352[32];  // 0x160 (0x160)
	 NetConnectionClass;  // 0x180 (0x180)
	 ReplicationDriverClass;  // 0x188 (0x188)
	 ReplicationBridgeClass;  // 0x190 (0x190)
	char pad_408[16];  // 0x198 (0x198)
	struct FName NetDriverName;  // 0x1A8 (0x1A8)
	struct TArray<struct FChannelDefinition> ChannelDefinitions;  // 0x1B0 (0x1B0)
	struct TMap<struct FName, struct FChannelDefinition> ChannelDefinitionMap;  // 0x1C0 (0x1C0)
	struct TArray<struct UChannel*> ActorChannelPool;  // 0x210 (0x210)
	char pad_544[33];  // 0x220 (0x220)
	char pad_577_1 : 6;  // 0x241 (0x241)
	char bNoTimeouts : 1;  // 0x241 (0x241)
	char bNeverApplyNetworkEmulationSettings : 1;  // 0x241 (0x241)
	char pad_578[1246];  // 0x242 (0x242)
	struct UReplicationDriver* ReplicationDriver;  // 0x720 (0x720)
	char pad_1832[104];  // 0x728 (0x728)


}; 
 
 


// Class Engine.MaterialExpressionTextureSampleParameter2DArray
// Size: 0x240(Inherited: 0x240)
struct UMaterialExpressionTextureSampleParameter2DArray : UMaterialExpressionTextureSampleParameter
{


}; 
 
 


// Class Engine.Engine
// Size: 0x1050(Inherited: 0x28)
struct UEngine : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	struct UFont* TinyFont;  // 0x30 (0x30)
	struct FSoftObjectPath TinyFontName;  // 0x38 (0x38)
	struct UFont* SmallFont;  // 0x58 (0x58)
	struct FSoftObjectPath SmallFontName;  // 0x60 (0x60)
	struct UFont* MediumFont;  // 0x80 (0x80)
	struct FSoftObjectPath MediumFontName;  // 0x88 (0x88)
	struct UFont* LargeFont;  // 0xA8 (0xA8)
	struct FSoftObjectPath LargeFontName;  // 0xB0 (0xB0)
	struct UFont* SubtitleFont;  // 0xD0 (0xD0)
	struct FSoftObjectPath SubtitleFontName;  // 0xD8 (0xD8)
	struct TArray<struct UFont*> AdditionalFonts;  // 0xF8 (0xF8)
	struct TArray<struct FString> AdditionalFontNames;  // 0x108 (0x108)
	UConsole* ConsoleClass;  // 0x118 (0x118)
	struct FSoftClassPath ConsoleClassName;  // 0x120 (0x120)
	UGameViewportClient* GameViewportClientClass;  // 0x140 (0x140)
	struct FSoftClassPath GameViewportClientClassName;  // 0x148 (0x148)
	ULocalPlayer* LocalPlayerClass;  // 0x168 (0x168)
	struct FSoftClassPath LocalPlayerClassName;  // 0x170 (0x170)
	AWorldSettings* WorldSettingsClass;  // 0x190 (0x190)
	struct FSoftClassPath WorldSettingsClassName;  // 0x198 (0x198)
	struct FSoftClassPath NavigationSystemClassName;  // 0x1B8 (0x1B8)
	UNavigationSystemBase* NavigationSystemClass;  // 0x1D8 (0x1D8)
	struct FSoftClassPath NavigationSystemConfigClassName;  // 0x1E0 (0x1E0)
	UNavigationSystemConfig* NavigationSystemConfigClass;  // 0x200 (0x200)
	struct FSoftClassPath AvoidanceManagerClassName;  // 0x208 (0x208)
	UAvoidanceManager* AvoidanceManagerClass;  // 0x228 (0x228)
	struct FSoftClassPath AIControllerClassName;  // 0x230 (0x230)
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass;  // 0x250 (0x250)
	struct FSoftClassPath PhysicsCollisionHandlerClassName;  // 0x258 (0x258)
	struct FSoftClassPath GameUserSettingsClassName;  // 0x278 (0x278)
	UGameUserSettings* GameUserSettingsClass;  // 0x298 (0x298)
	struct UGameUserSettings* GameUserSettings;  // 0x2A0 (0x2A0)
	ALevelScriptActor* LevelScriptActorClass;  // 0x2A8 (0x2A8)
	struct FSoftClassPath LevelScriptActorClassName;  // 0x2B0 (0x2B0)
	struct FSoftClassPath DefaultBlueprintBaseClassName;  // 0x2D0 (0x2D0)
	struct FSoftClassPath GameSingletonClassName;  // 0x2F0 (0x2F0)
	struct UObject* GameSingleton;  // 0x310 (0x310)
	struct FSoftClassPath AssetManagerClassName;  // 0x318 (0x318)
	struct UAssetManager* AssetManager;  // 0x338 (0x338)
	struct UTexture2D* DefaultTexture;  // 0x340 (0x340)
	struct FSoftObjectPath DefaultTextureName;  // 0x348 (0x348)
	struct UTexture* DefaultDiffuseTexture;  // 0x368 (0x368)
	struct FSoftObjectPath DefaultDiffuseTextureName;  // 0x370 (0x370)
	struct UTexture2D* DefaultBSPVertexTexture;  // 0x390 (0x390)
	struct FSoftObjectPath DefaultBSPVertexTextureName;  // 0x398 (0x398)
	struct UTexture2D* HighFrequencyNoiseTexture;  // 0x3B8 (0x3B8)
	struct FSoftObjectPath HighFrequencyNoiseTextureName;  // 0x3C0 (0x3C0)
	struct UTexture2D* DefaultBokehTexture;  // 0x3E0 (0x3E0)
	struct FSoftObjectPath DefaultBokehTextureName;  // 0x3E8 (0x3E8)
	struct UTexture2D* DefaultBloomKernelTexture;  // 0x408 (0x408)
	struct FSoftObjectPath DefaultBloomKernelTextureName;  // 0x410 (0x410)
	struct UTexture2D* DefaultFilmGrainTexture;  // 0x430 (0x430)
	struct FSoftObjectPath DefaultFilmGrainTextureName;  // 0x438 (0x438)
	struct UMaterial* WireframeMaterial;  // 0x458 (0x458)
	struct FString WireframeMaterialName;  // 0x460 (0x460)
	struct UMaterial* DebugMeshMaterial;  // 0x470 (0x470)
	struct FSoftObjectPath DebugMeshMaterialName;  // 0x478 (0x478)
	struct UMaterial* EmissiveMeshMaterial;  // 0x498 (0x498)
	struct FSoftObjectPath EmissiveMeshMaterialName;  // 0x4A0 (0x4A0)
	struct UMaterial* LevelColorationLitMaterial;  // 0x4C0 (0x4C0)
	struct FString LevelColorationLitMaterialName;  // 0x4C8 (0x4C8)
	struct UMaterial* LevelColorationUnlitMaterial;  // 0x4D8 (0x4D8)
	struct FString LevelColorationUnlitMaterialName;  // 0x4E0 (0x4E0)
	struct UMaterial* LightingTexelDensityMaterial;  // 0x4F0 (0x4F0)
	struct FString LightingTexelDensityName;  // 0x4F8 (0x4F8)
	struct UMaterial* ShadedLevelColorationLitMaterial;  // 0x508 (0x508)
	struct FString ShadedLevelColorationLitMaterialName;  // 0x510 (0x510)
	struct UMaterial* ShadedLevelColorationUnlitMaterial;  // 0x520 (0x520)
	struct FString ShadedLevelColorationUnlitMaterialName;  // 0x528 (0x528)
	struct UMaterial* RemoveSurfaceMaterial;  // 0x538 (0x538)
	struct FSoftObjectPath RemoveSurfaceMaterialName;  // 0x540 (0x540)
	struct UMaterial* VertexColorMaterial;  // 0x560 (0x560)
	struct FString VertexColorMaterialName;  // 0x568 (0x568)
	struct UMaterial* VertexColorViewModeMaterial_ColorOnly;  // 0x578 (0x578)
	struct FString VertexColorViewModeMaterialName_ColorOnly;  // 0x580 (0x580)
	struct UMaterial* VertexColorViewModeMaterial_AlphaAsColor;  // 0x590 (0x590)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor;  // 0x598 (0x598)
	struct UMaterial* VertexColorViewModeMaterial_RedOnly;  // 0x5A8 (0x5A8)
	struct FString VertexColorViewModeMaterialName_RedOnly;  // 0x5B0 (0x5B0)
	struct UMaterial* VertexColorViewModeMaterial_GreenOnly;  // 0x5C0 (0x5C0)
	struct FString VertexColorViewModeMaterialName_GreenOnly;  // 0x5C8 (0x5C8)
	struct UMaterial* VertexColorViewModeMaterial_BlueOnly;  // 0x5D8 (0x5D8)
	struct FString VertexColorViewModeMaterialName_BlueOnly;  // 0x5E0 (0x5E0)
	struct FSoftObjectPath DebugEditorMaterialName;  // 0x5F0 (0x5F0)
	struct UMaterial* ConstraintLimitMaterial;  // 0x610 (0x610)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialX;  // 0x618 (0x618)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis;  // 0x620 (0x620)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialY;  // 0x628 (0x628)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis;  // 0x630 (0x630)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZ;  // 0x638 (0x638)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis;  // 0x640 (0x640)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic;  // 0x648 (0x648)
	struct UMaterial* InvalidLightmapSettingsMaterial;  // 0x650 (0x650)
	struct FSoftObjectPath InvalidLightmapSettingsMaterialName;  // 0x658 (0x658)
	struct UMaterial* PreviewShadowsIndicatorMaterial;  // 0x678 (0x678)
	struct FSoftObjectPath PreviewShadowsIndicatorMaterialName;  // 0x680 (0x680)
	struct UMaterial* ArrowMaterial;  // 0x6A0 (0x6A0)
	struct UMaterialInstanceDynamic* ArrowMaterialYellow;  // 0x6A8 (0x6A8)
	struct FSoftObjectPath ArrowMaterialName;  // 0x6B0 (0x6B0)
	struct FLinearColor LightingOnlyBrightness;  // 0x6D0 (0x6D0)
	struct TArray<struct FLinearColor> ShaderComplexityColors;  // 0x6E0 (0x6E0)
	struct TArray<struct FLinearColor> QuadComplexityColors;  // 0x6F0 (0x6F0)
	struct TArray<struct FLinearColor> LightComplexityColors;  // 0x700 (0x700)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors;  // 0x710 (0x710)
	struct TArray<struct FLinearColor> LODColorationColors;  // 0x720 (0x720)
	struct TArray<struct FLinearColor> HLODColorationColors;  // 0x730 (0x730)
	struct TArray<struct FLinearColor> StreamingAccuracyColors;  // 0x740 (0x740)
	struct FLinearColor GPUSkinCacheVisualizationExcludedColor;  // 0x750 (0x750)
	struct FLinearColor GPUSkinCacheVisualizationIncludedColor;  // 0x760 (0x760)
	struct FLinearColor GPUSkinCacheVisualizationRecomputeTangentsColor;  // 0x770 (0x770)
	float GPUSkinCacheVisualizationLowMemoryThresholdInMB;  // 0x780 (0x780)
	float GPUSkinCacheVisualizationHighMemoryThresholdInMB;  // 0x784 (0x784)
	struct FLinearColor GPUSkinCacheVisualizationLowMemoryColor;  // 0x788 (0x788)
	struct FLinearColor GPUSkinCacheVisualizationMidMemoryColor;  // 0x798 (0x798)
	struct FLinearColor GPUSkinCacheVisualizationHighMemoryColor;  // 0x7A8 (0x7A8)
	struct TArray<struct FLinearColor> GPUSkinCacheVisualizationRayTracingLODOffsetColors;  // 0x7B8 (0x7B8)
	float MaxPixelShaderAdditiveComplexityCount;  // 0x7C8 (0x7C8)
	float MaxES3PixelShaderAdditiveComplexityCount;  // 0x7CC (0x7CC)
	float MinLightMapDensity;  // 0x7D0 (0x7D0)
	float IdealLightMapDensity;  // 0x7D4 (0x7D4)
	float MaxLightMapDensity;  // 0x7D8 (0x7D8)
	char bRenderLightMapDensityGrayscale : 1;  // 0x7DC (0x7DC)
	char pad_2012_1 : 7;  // 0x7DC (0x7DC)
	char pad_2013[4];  // 0x7DD (0x7DD)
	float RenderLightMapDensityGrayscaleScale;  // 0x7E0 (0x7E0)
	float RenderLightMapDensityColorScale;  // 0x7E4 (0x7E4)
	struct FLinearColor LightMapDensityVertexMappedColor;  // 0x7E8 (0x7E8)
	struct FLinearColor LightMapDensitySelectedColor;  // 0x7F8 (0x7F8)
	struct TArray<struct FStatColorMapping> StatColorMappings;  // 0x808 (0x808)
	struct UPhysicalMaterial* DefaultPhysMaterial;  // 0x818 (0x818)
	struct FSoftObjectPath DefaultPhysMaterialName;  // 0x820 (0x820)
	struct UPhysicalMaterial* DefaultDestructiblePhysMaterial;  // 0x840 (0x840)
	struct FSoftObjectPath DefaultDestructiblePhysMaterialName;  // 0x848 (0x848)
	struct TArray<struct FGameNameRedirect> ActiveGameNameRedirects;  // 0x868 (0x868)
	struct TArray<struct FClassRedirect> ActiveClassRedirects;  // 0x878 (0x878)
	struct TArray<struct FPluginRedirect> ActivePluginRedirects;  // 0x888 (0x888)
	struct TArray<struct FStructRedirect> ActiveStructRedirects;  // 0x898 (0x898)
	struct UTexture2D* PreIntegratedSkinBRDFTexture;  // 0x8A8 (0x8A8)
	struct FSoftObjectPath PreIntegratedSkinBRDFTextureName;  // 0x8B0 (0x8B0)
	struct UTexture2D* BlueNoiseScalarTexture;  // 0x8D0 (0x8D0)
	struct UTexture2D* BlueNoiseVec2Texture;  // 0x8D8 (0x8D8)
	struct FSoftObjectPath BlueNoiseScalarTextureName;  // 0x8E0 (0x8E0)
	struct FSoftObjectPath BlueNoiseVec2TextureName;  // 0x900 (0x900)
	struct UTexture2D* MiniFontTexture;  // 0x920 (0x920)
	struct FSoftObjectPath MiniFontTextureName;  // 0x928 (0x928)
	struct UTexture* WeightMapPlaceholderTexture;  // 0x948 (0x948)
	struct FSoftObjectPath WeightMapPlaceholderTextureName;  // 0x950 (0x950)
	struct UTexture2D* LightMapDensityTexture;  // 0x970 (0x970)
	struct FSoftObjectPath LightMapDensityTextureName;  // 0x978 (0x978)
	char pad_2456[8];  // 0x998 (0x998)
	struct UGameViewportClient* GameViewport;  // 0x9A0 (0x9A0)
	struct TArray<struct FString> DeferredCommands;  // 0x9A8 (0x9A8)
	float NearClipPlane;  // 0x9B8 (0x9B8)
	char bSubtitlesEnabled : 1;  // 0x9BC (0x9BC)
	char bSubtitlesForcedOff : 1;  // 0x9BC (0x9BC)
	char pad_2492_1 : 6;  // 0x9BC (0x9BC)
	char pad_2493[4];  // 0x9BD (0x9BD)
	int32_t MaximumLoopIterationCount;  // 0x9C0 (0x9C0)
	char bCanBlueprintsTickByDefault : 1;  // 0x9C4 (0x9C4)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1;  // 0x9C4 (0x9C4)
	char bAllowMultiThreadedAnimationUpdate : 1;  // 0x9C4 (0x9C4)
	char bEnableEditorPSysRealtimeLOD : 1;  // 0x9C4 (0x9C4)
	char pad_2500_1 : 1;  // 0x9C4 (0x9C4)
	char bSmoothFrameRate : 1;  // 0x9C4 (0x9C4)
	char bUseFixedFrameRate : 1;  // 0x9C4 (0x9C4)
	char pad_2500_2 : 1;  // 0x9C4 (0x9C4)
	char pad_2501[4];  // 0x9C5 (0x9C5)
	float FixedFrameRate;  // 0x9C8 (0x9C8)
	struct FFloatRange SmoothedFrameRateRange;  // 0x9CC (0x9CC)
	char pad_2524[4];  // 0x9DC (0x9DC)
	struct UEngineCustomTimeStep* CustomTimeStep;  // 0x9E0 (0x9E0)
	char pad_2536[32];  // 0x9E8 (0x9E8)
	struct FSoftClassPath CustomTimeStepClassName;  // 0xA08 (0xA08)
	struct UTimecodeProvider* TimecodeProvider;  // 0xA28 (0xA28)
	char pad_2608[32];  // 0xA30 (0xA30)
	struct FSoftClassPath TimecodeProviderClassName;  // 0xA50 (0xA50)
	char pad_2672_1 : 7;  // 0xA70 (0xA70)
	bool bGenerateDefaultTimecode : 1;  // 0xA70 (0xA70)
	char pad_2673[3];  // 0xA71 (0xA71)
	struct FFrameRate GenerateDefaultTimecodeFrameRate;  // 0xA74 (0xA74)
	float GenerateDefaultTimecodeFrameDelay;  // 0xA7C (0xA7C)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1;  // 0xA80 (0xA80)
	char pad_2688_1 : 7;  // 0xA80 (0xA80)
	char pad_2689[4];  // 0xA81 (0xA81)
	int32_t NumPawnsAllowedToBeSpawnedInAFrame;  // 0xA84 (0xA84)
	char bShouldGenerateLowQualityLightmaps : 1;  // 0xA88 (0xA88)
	char pad_2696_1 : 7;  // 0xA88 (0xA88)
	char pad_2697[4];  // 0xA89 (0xA89)
	struct FColor C_WorldBox;  // 0xA8C (0xA8C)
	struct FColor C_BrushWire;  // 0xA90 (0xA90)
	struct FColor C_AddWire;  // 0xA94 (0xA94)
	struct FColor C_SubtractWire;  // 0xA98 (0xA98)
	struct FColor C_SemiSolidWire;  // 0xA9C (0xA9C)
	struct FColor C_NonSolidWire;  // 0xAA0 (0xAA0)
	struct FColor C_WireBackground;  // 0xAA4 (0xAA4)
	struct FColor C_ScaleBoxHi;  // 0xAA8 (0xAA8)
	struct FColor C_VolumeCollision;  // 0xAAC (0xAAC)
	struct FColor C_BSPCollision;  // 0xAB0 (0xAB0)
	struct FColor C_OrthoBackground;  // 0xAB4 (0xAB4)
	struct FColor C_Volume;  // 0xAB8 (0xAB8)
	struct FColor C_BrushShape;  // 0xABC (0xABC)
	float StreamingDistanceFactor;  // 0xAC0 (0xAC0)
	char pad_2756[4];  // 0xAC4 (0xAC4)
	struct FDirectoryPath GameScreenshotSaveDirectory;  // 0xAC8 (0xAC8)
	char pad_2776_1 : 7;  // 0xAD8 (0xAD8)
	bool UseStaticMeshMinLODPerQualityLevels : 1;  // 0xAD8 (0xAD8)
	char pad_2777_1 : 7;  // 0xAD9 (0xAD9)
	bool UseSkeletalMeshMinLODPerQualityLevels : 1;  // 0xAD9 (0xAD9)
	uint8_t TransitionType;  // 0xADA (0xADA)
	char pad_2779[5];  // 0xADB (0xADB)
	struct FString TransitionDescription;  // 0xAE0 (0xAE0)
	struct FString TransitionGameMode;  // 0xAF0 (0xAF0)
	char bAllowMatureLanguage : 1;  // 0xB00 (0xB00)
	char pad_2816_1 : 7;  // 0xB00 (0xB00)
	char pad_2817[4];  // 0xB01 (0xB01)
	float CameraRotationThreshold;  // 0xB04 (0xB04)
	float CameraTranslationThreshold;  // 0xB08 (0xB08)
	float PrimitiveProbablyVisibleTime;  // 0xB0C (0xB0C)
	float MaxOcclusionPixelsFraction;  // 0xB10 (0xB10)
	char bPauseOnLossOfFocus : 1;  // 0xB14 (0xB14)
	char pad_2836_1 : 7;  // 0xB14 (0xB14)
	char pad_2837[4];  // 0xB15 (0xB15)
	int32_t MaxParticleResize;  // 0xB18 (0xB18)
	int32_t MaxParticleResizeWarn;  // 0xB1C (0xB1C)
	struct TArray<struct FDropNoteInfo> PendingDroppedNotes;  // 0xB20 (0xB20)
	float NetClientTicksPerSecond;  // 0xB30 (0xB30)
	float DisplayGamma;  // 0xB34 (0xB34)
	float MinDesiredFrameRate;  // 0xB38 (0xB38)
	struct FLinearColor DefaultSelectedMaterialColor;  // 0xB3C (0xB3C)
	struct FLinearColor SelectedMaterialColor;  // 0xB4C (0xB4C)
	struct FLinearColor SelectionOutlineColor;  // 0xB5C (0xB5C)
	struct FLinearColor SubduedSelectionOutlineColor;  // 0xB6C (0xB6C)
	struct FLinearColor SelectedMaterialColorOverride;  // 0xB7C (0xB7C)
	char pad_2956_1 : 7;  // 0xB8C (0xB8C)
	bool bIsOverridingSelectedColor : 1;  // 0xB8C (0xB8C)
	char pad_2957[3];  // 0xB8D (0xB8D)
	char bEnableOnScreenDebugMessages : 1;  // 0xB90 (0xB90)
	char bEnableOnScreenDebugMessagesDisplay : 1;  // 0xB90 (0xB90)
	char bSuppressMapWarnings : 1;  // 0xB90 (0xB90)
	char bDisableAILogging : 1;  // 0xB90 (0xB90)
	char pad_2960_1 : 4;  // 0xB90 (0xB90)
	char pad_2961[4];  // 0xB91 (0xB91)
	uint32_t bEnableVisualLogRecordingOnStart;  // 0xB94 (0xB94)
	int32_t ScreenSaverInhibitorSemaphore;  // 0xB98 (0xB98)
	char bLockReadOnlyLevels : 1;  // 0xB9C (0xB9C)
	char pad_2972_1 : 7;  // 0xB9C (0xB9C)
	char pad_2973[4];  // 0xB9D (0xB9D)
	struct FString ParticleEventManagerClassPath;  // 0xBA0 (0xBA0)
	float SelectionHighlightIntensity;  // 0xBB0 (0xBB0)
	float BSPSelectionHighlightIntensity;  // 0xBB4 (0xBB4)
	float SelectionHighlightIntensityBillboards;  // 0xBB8 (0xBB8)
	char pad_3004[660];  // 0xBBC (0xBBC)
	uint32_t GlobalNetTravelCount;  // 0xE50 (0xE50)
	char pad_3668[4];  // 0xE54 (0xE54)
	struct TArray<struct FNetDriverDefinition> NetDriverDefinitions;  // 0xE58 (0xE58)
	struct TArray<struct FIrisNetDriverConfig> IrisNetDriverConfigs;  // 0xE68 (0xE68)
	struct TArray<struct FString> ServerActors;  // 0xE78 (0xE78)
	struct TArray<struct FString> RuntimeServerActors;  // 0xE88 (0xE88)
	float NetErrorLogInterval;  // 0xE98 (0xE98)
	char bStartedLoadMapMovie : 1;  // 0xE9C (0xE9C)
	char pad_3740_1 : 7;  // 0xE9C (0xE9C)
	char pad_3741[28];  // 0xE9D (0xE9D)
	int32_t NextWorldContextHandle;  // 0xEB8 (0xEB8)
	char pad_3772[404];  // 0xEBC (0xEBC)


}; 
 
 


// Class Engine.ParticleModuleRotation_Seeded
// Size: 0x80(Inherited: 0x60)
struct UParticleModuleRotation_Seeded : UParticleModuleRotation
{
	struct FParticleRandomSeedInfo RandomSeedInfo;  // 0x60 (0x60)


}; 
 
 


// Class Engine.MaterialExpressionComponentMask
// Size: 0xE0(Inherited: 0xB0)
struct UMaterialExpressionComponentMask : UMaterialExpression
{
	struct FExpressionInput Input;  // 0xB0 (0xB0)
	char R : 1;  // 0xD8 (0xD8)
	char G : 1;  // 0xD8 (0xD8)
	char B : 1;  // 0xD8 (0xD8)
	char A : 1;  // 0xD8 (0xD8)
	char pad_216_1 : 4;  // 0xD8 (0xD8)
	char pad_217[8];  // 0xD9 (0xD9)


}; 
 
 


// Class Engine.ProjectileMovementComponent
// Size: 0x240(Inherited: 0x108)
struct UProjectileMovementComponent : UMovementComponent
{
	float InitialSpeed;  // 0x108 (0x108)
	float MaxSpeed;  // 0x10C (0x10C)
	char bRotationFollowsVelocity : 1;  // 0x110 (0x110)
	char bRotationRemainsVertical : 1;  // 0x110 (0x110)
	char bShouldBounce : 1;  // 0x110 (0x110)
	char bInitialVelocityInLocalSpace : 1;  // 0x110 (0x110)
	char bForceSubStepping : 1;  // 0x110 (0x110)
	char bSimulationEnabled : 1;  // 0x110 (0x110)
	char bSweepCollision : 1;  // 0x110 (0x110)
	char bIsHomingProjectile : 1;  // 0x110 (0x110)
	char bBounceAngleAffectsFriction : 1;  // 0x111 (0x111)
	char bIsSliding : 1;  // 0x111 (0x111)
	char bInterpMovement : 1;  // 0x111 (0x111)
	char bInterpRotation : 1;  // 0x111 (0x111)
	char pad_273_1 : 4;  // 0x111 (0x111)
	char pad_274[3];  // 0x112 (0x112)
	float PreviousHitTime;  // 0x114 (0x114)
	struct FVector PreviousHitNormal;  // 0x118 (0x118)
	float ProjectileGravityScale;  // 0x130 (0x130)
	float Buoyancy;  // 0x134 (0x134)
	float Bounciness;  // 0x138 (0x138)
	float Friction;  // 0x13C (0x13C)
	float BounceVelocityStopSimulatingThreshold;  // 0x140 (0x140)
	float MinFrictionFraction;  // 0x144 (0x144)
	struct FMulticastInlineDelegate OnProjectileBounce;  // 0x148 (0x148)
	struct FMulticastInlineDelegate OnProjectileStop;  // 0x158 (0x158)
	float HomingAccelerationMagnitude;  // 0x168 (0x168)
	struct TWeakObjectPtr<USceneComponent> HomingTargetComponent;  // 0x16C (0x16C)
	float MaxSimulationTimeStep;  // 0x174 (0x174)
	int32_t MaxSimulationIterations;  // 0x178 (0x178)
	int32_t BounceAdditionalIterations;  // 0x17C (0x17C)
	float InterpLocationTime;  // 0x180 (0x180)
	float InterpRotationTime;  // 0x184 (0x184)
	float InterpLocationMaxLagDistance;  // 0x188 (0x188)
	float InterpLocationSnapToTargetDistance;  // 0x18C (0x18C)
	char pad_400[176];  // 0x190 (0x190)


	void StopSimulating(struct FHitResult& HitResult); // Function Engine.ProjectileMovementComponent.StopSimulating
	void SetVelocityInLocalSpace(struct FVector NewVelocity); // Function Engine.ProjectileMovementComponent.SetVelocityInLocalSpace
	void SetInterpolatedComponent(struct USceneComponent* Component); // Function Engine.ProjectileMovementComponent.SetInterpolatedComponent
	void ResetInterpolation(); // Function Engine.ProjectileMovementComponent.ResetInterpolation
	void OnProjectileStopDelegate__DelegateSignature(struct FHitResult& ImpactResult); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileStopDelegate__DelegateSignature
	void OnProjectileBounceDelegate__DelegateSignature(struct FHitResult& ImpactResult, struct FVector& ImpactVelocity); // DelegateFunction Engine.ProjectileMovementComponent.OnProjectileBounceDelegate__DelegateSignature
	void MoveInterpolationTarget(struct FVector& NewLocation, struct FRotator& NewRotation); // Function Engine.ProjectileMovementComponent.MoveInterpolationTarget
	struct FVector LimitVelocity(struct FVector NewVelocity); // Function Engine.ProjectileMovementComponent.LimitVelocity
	bool IsVelocityUnderSimulationThreshold(); // Function Engine.ProjectileMovementComponent.IsVelocityUnderSimulationThreshold
	bool IsInterpolationComplete(); // Function Engine.ProjectileMovementComponent.IsInterpolationComplete
}; 
 
 


// Class Engine.SoundBase
// Size: 0x168(Inherited: 0x28)
struct USoundBase : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	struct USoundClass* SoundClassObject;  // 0x30 (0x30)
	char bDebug : 1;  // 0x38 (0x38)
	char bOverrideConcurrency : 1;  // 0x38 (0x38)
	char bEnableBusSends : 1;  // 0x38 (0x38)
	char bEnableBaseSubmix : 1;  // 0x38 (0x38)
	char bEnableSubmixSends : 1;  // 0x38 (0x38)
	char bHasDelayNode : 1;  // 0x38 (0x38)
	char bHasConcatenatorNode : 1;  // 0x38 (0x38)
	char bBypassVolumeScaleForPriority : 1;  // 0x38 (0x38)
	uint8_t VirtualizationMode;  // 0x39 (0x39)
	char pad_58[86];  // 0x3A (0x3A)
	struct TSet<struct USoundConcurrency*> ConcurrencySet;  // 0x90 (0x90)
	struct FSoundConcurrencySettings ConcurrencyOverrides;  // 0xE0 (0xE0)
	float Duration;  // 0x100 (0x100)
	float MaxDistance;  // 0x104 (0x104)
	float TotalSamples;  // 0x108 (0x108)
	float Priority;  // 0x10C (0x10C)
	struct USoundAttenuation* AttenuationSettings;  // 0x110 (0x110)
	struct USoundSubmixBase* SoundSubmixObject;  // 0x118 (0x118)
	struct TArray<struct FSoundSubmixSendInfo> SoundSubmixSends;  // 0x120 (0x120)
	struct USoundEffectSourcePresetChain* SourceEffectChain;  // 0x130 (0x130)
	struct TArray<struct FSoundSourceBusSendInfo> BusSends;  // 0x138 (0x138)
	struct TArray<struct FSoundSourceBusSendInfo> PreEffectBusSends;  // 0x148 (0x148)
	struct TArray<struct UAssetUserData*> AssetUserData;  // 0x158 (0x158)


}; 
 
 


// Class Engine.OnlineBlueprintCallProxyBase
// Size: 0x30(Inherited: 0x30)
struct UOnlineBlueprintCallProxyBase : UBlueprintAsyncActionBase
{


}; 
 
 


// Class Engine.AsyncPhysicsData
// Size: 0x30(Inherited: 0x28)
struct UAsyncPhysicsData : UObject
{
	int32_t ServerFrame;  // 0x28 (0x28)
	int32_t ReplicationRedundancy;  // 0x2C (0x2C)


}; 
 
 


// Class Engine.SkinnedMeshComponent
// Size: 0x8A0(Inherited: 0x570)
struct USkinnedMeshComponent : UMeshComponent
{
	char pad_1392[8];  // 0x570 (0x570)
	struct USkeletalMesh* SkeletalMesh;  // 0x578 (0x578)
	struct USkinnedAsset* SkinnedAsset;  // 0x580 (0x580)
	struct TWeakObjectPtr<USkinnedMeshComponent> LeaderPoseComponent;  // 0x588 (0x588)
	struct TArray<uint8_t> SkinCacheUsage;  // 0x590 (0x590)
	char pad_1440_1 : 7;  // 0x5A0 (0x5A0)
	bool bSetMeshDeformer : 1;  // 0x5A0 (0x5A0)
	char pad_1441[7];  // 0x5A1 (0x5A1)
	struct UMeshDeformer* MeshDeformer;  // 0x5A8 (0x5A8)
	struct UMeshDeformerInstanceSettings* MeshDeformerInstanceSettings;  // 0x5B0 (0x5B0)
	struct UMeshDeformerInstance* MeshDeformerInstance;  // 0x5B8 (0x5B8)
	char pad_1472[360];  // 0x5C0 (0x5C0)
	struct UPhysicsAsset* PhysicsAssetOverride;  // 0x728 (0x728)
	int32_t ForcedLodModel;  // 0x730 (0x730)
	int32_t MinLodModel;  // 0x734 (0x734)
	char pad_1848[8];  // 0x738 (0x738)
	float StreamingDistanceMultiplier;  // 0x740 (0x740)
	char pad_1860[12];  // 0x744 (0x744)
	struct TArray<struct FSkelMeshComponentLODInfo> LODInfo;  // 0x750 (0x750)
	char pad_1888[36];  // 0x760 (0x760)
	uint8_t VisibilityBasedAnimTickOption;  // 0x784 (0x784)
	char pad_1925[1];  // 0x785 (0x785)
	char pad_1926_1 : 3;  // 0x786 (0x786)
	char bOverrideMinLod : 1;  // 0x786 (0x786)
	char bUseBoundsFromLeaderPoseComponent : 1;  // 0x786 (0x786)
	char bForceWireframe : 1;  // 0x786 (0x786)
	char bDisplayBones : 1;  // 0x786 (0x786)
	char bDisableMorphTarget : 1;  // 0x786 (0x786)
	char bHideSkin : 1;  // 0x787 (0x787)
	char bPerBoneMotionBlur : 1;  // 0x787 (0x787)
	char bComponentUseFixedSkelBounds : 1;  // 0x787 (0x787)
	char bConsiderAllBodiesForBounds : 1;  // 0x787 (0x787)
	char bSyncAttachParentLOD : 1;  // 0x787 (0x787)
	char bCanHighlightSelectedSections : 1;  // 0x787 (0x787)
	char bRecentlyRendered : 1;  // 0x787 (0x787)
	char bCastCapsuleDirectShadow : 1;  // 0x787 (0x787)
	char bCastCapsuleIndirectShadow : 1;  // 0x788 (0x788)
	char bCPUSkinning : 1;  // 0x788 (0x788)
	char bEnableUpdateRateOptimizations : 1;  // 0x788 (0x788)
	char bDisplayDebugUpdateRateOptimizations : 1;  // 0x788 (0x788)
	char bRenderStatic : 1;  // 0x788 (0x788)
	char bIgnoreLeaderPoseComponentLOD : 1;  // 0x788 (0x788)
	char pad_1928_1 : 2;  // 0x788 (0x788)
	char bCachedLocalBoundsUpToDate : 1;  // 0x789 (0x789)
	char bCachedWorldSpaceBoundsUpToDate : 1;  // 0x789 (0x789)
	char pad_1929_1 : 2;  // 0x789 (0x789)
	char bForceMeshObjectUpdate : 1;  // 0x789 (0x789)
	char pad_1929_2 : 3;  // 0x789 (0x789)
	char pad_1930_1 : 2;  // 0x78A (0x78A)
	char bFollowerShouldTickPose : 1;  // 0x78A (0x78A)
	char pad_1930_2 : 5;  // 0x78A (0x78A)
	char pad_1931[2];  // 0x78B (0x78B)
	float CapsuleIndirectShadowMinVisibility;  // 0x78C (0x78C)
	char pad_1936[56];  // 0x790 (0x790)
	struct FBoxSphereBounds CachedWorldOrLocalSpaceBounds;  // 0x7C8 (0x7C8)
	struct FMatrix CachedWorldToLocalTransform;  // 0x800 (0x800)
	char pad_2176[32];  // 0x880 (0x880)


	void UnloadSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.UnloadSkinWeightProfile
	void UnHideBoneByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.UnHideBoneByName
	void TransformToBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation); // Function Engine.SkinnedMeshComponent.TransformToBoneSpace
	void TransformFromBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation); // Function Engine.SkinnedMeshComponent.TransformFromBoneSpace
	void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, bool bShow, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowMaterialSection
	void ShowAllMaterialSections(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowAllMaterialSections
	void SetVertexOffsetUsage(int32_t LODIndex, int32_t Usage); // Function Engine.SkinnedMeshComponent.SetVertexOffsetUsage
	void SetVertexColorOverride_LinearColor(int32_t LODIndex, struct TArray<struct FLinearColor>& VertexColors); // Function Engine.SkinnedMeshComponent.SetVertexColorOverride_LinearColor
	bool SetSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.SetSkinWeightProfile
	void SetSkinWeightOverride(int32_t LODIndex, struct TArray<struct FSkelMeshSkinWeightInfo>& SkinWeights); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride
	void SetSkinnedAssetAndUpdate(struct USkinnedAsset* NewMesh, bool bReinitPose); // Function Engine.SkinnedMeshComponent.SetSkinnedAssetAndUpdate
	void SetRenderStatic(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetRenderStatic
	void SetPreSkinningOffsets(int32_t LODIndex, struct TArray<struct FVector> Offsets); // Function Engine.SkinnedMeshComponent.SetPreSkinningOffsets
	void SetPostSkinningOffsets(int32_t LODIndex, struct TArray<struct FVector> Offsets); // Function Engine.SkinnedMeshComponent.SetPostSkinningOffsets
	void SetPhysicsAsset(struct UPhysicsAsset* NewPhysicsAsset, bool bForceReInit); // Function Engine.SkinnedMeshComponent.SetPhysicsAsset
	void SetMinLOD(int32_t InNewMinLOD); // Function Engine.SkinnedMeshComponent.SetMinLOD
	void SetMeshDeformer(struct UMeshDeformer* InMeshDeformer); // Function Engine.SkinnedMeshComponent.SetMeshDeformer
	void SetLeaderPoseComponent(struct USkinnedMeshComponent* NewLeaderBoneComponent, bool bForceUpdate, bool bInFollowerShouldTickPose); // Function Engine.SkinnedMeshComponent.SetLeaderPoseComponent
	void SetForcedLOD(int32_t InNewForcedLOD); // Function Engine.SkinnedMeshComponent.SetForcedLOD
	void SetCastCapsuleIndirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleIndirectShadow
	void SetCastCapsuleDirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleDirectShadow
	void SetCapsuleIndirectShadowMinVisibility(float NewValue); // Function Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility
	bool IsUsingSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.IsUsingSkinWeightProfile
	bool IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.IsMaterialSectionShown
	bool IsBoneHiddenByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.IsBoneHiddenByName
	void HideBoneByName(struct FName BoneName, enum class EPhysBodyOp PhysBodyOption); // Function Engine.SkinnedMeshComponent.HideBoneByName
	int32_t GetVertexOffsetUsage(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.GetVertexOffsetUsage
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(struct FName BoneName, float& OutTwistAngle, float& OutSwingAngle); // Function Engine.SkinnedMeshComponent.GetTwistAndSwingAngleOfDeltaRotationFromRefPose
	struct FName GetSocketBoneName(struct FName InSocketName); // Function Engine.SkinnedMeshComponent.GetSocketBoneName
	struct USkinnedAsset* GetSkinnedAsset(); // Function Engine.SkinnedMeshComponent.GetSkinnedAsset
	struct USkeletalMesh* GetSkeletalMesh_DEPRECATED(); // Function Engine.SkinnedMeshComponent.GetSkeletalMesh_DEPRECATED
	struct FTransform GetRefPoseTransform(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetRefPoseTransform
	struct FVector GetRefPosePosition(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetRefPosePosition
	int32_t GetPredictedLODLevel(); // Function Engine.SkinnedMeshComponent.GetPredictedLODLevel
	struct FName GetParentBone(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetParentBone
	int32_t GetNumLODs(); // Function Engine.SkinnedMeshComponent.GetNumLODs
	int32_t GetNumBones(); // Function Engine.SkinnedMeshComponent.GetNumBones
	int32_t GetForcedLOD(); // Function Engine.SkinnedMeshComponent.GetForcedLOD
	struct FTransform GetDeltaTransformFromRefPose(struct FName BoneName, struct FName BaseName); // Function Engine.SkinnedMeshComponent.GetDeltaTransformFromRefPose
	struct FName GetCurrentSkinWeightProfileName(); // Function Engine.SkinnedMeshComponent.GetCurrentSkinWeightProfileName
	struct FName GetBoneName(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetBoneName
	int32_t GetBoneIndex(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetBoneIndex
	struct FName FindClosestBone_K2(struct FVector TestLocation, struct FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset); // Function Engine.SkinnedMeshComponent.FindClosestBone_K2
	void ClearVertexColorOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearVertexColorOverride
	void ClearSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.ClearSkinWeightProfile
	void ClearSkinWeightOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearSkinWeightOverride
	bool BoneIsChildOf(struct FName BoneName, struct FName ParentBoneName); // Function Engine.SkinnedMeshComponent.BoneIsChildOf
}; 
 
 


// Class Engine.MaterialExpressionBinaryOp
// Size: 0x108(Inherited: 0xB0)
struct UMaterialExpressionBinaryOp : UMaterialExpression
{
	struct FExpressionInput A;  // 0xB0 (0xB0)
	struct FExpressionInput B;  // 0xD8 (0xD8)
	float ConstA;  // 0x100 (0x100)
	float ConstB;  // 0x104 (0x104)


}; 
 
 


// Class Engine.OnlineSession
// Size: 0x28(Inherited: 0x28)
struct UOnlineSession : UObject
{


}; 
 
 


// Class Engine.MaterialExpressionVolumetricCloudEmptySpaceSkippingOutput
// Size: 0xD8(Inherited: 0xB0)
struct UMaterialExpressionVolumetricCloudEmptySpaceSkippingOutput : UMaterialExpressionCustomOutput
{
	struct FExpressionInput ContainsMatter;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.BlueprintGeneratedClass
// Size: 0x380(Inherited: 0x230)
struct UBlueprintGeneratedClass : UClass
{
	char pad_560[8];  // 0x230 (0x230)
	int32_t NumReplicatedProperties;  // 0x238 (0x238)
	char bHasNativizedParent : 1;  // 0x23C (0x23C)
	char bHasCookedComponentInstancingData : 1;  // 0x23C (0x23C)
	char pad_572_1 : 6;  // 0x23C (0x23C)
	char pad_573[4];  // 0x23D (0x23D)
	struct TArray<struct UDynamicBlueprintBinding*> DynamicBindingObjects;  // 0x240 (0x240)
	struct TArray<struct UActorComponent*> ComponentTemplates;  // 0x250 (0x250)
	struct TArray<struct UTimelineTemplate*> Timelines;  // 0x260 (0x260)
	struct TArray<struct FBPComponentClassOverride> ComponentClassOverrides;  // 0x270 (0x270)
	struct USimpleConstructionScript* SimpleConstructionScript;  // 0x280 (0x280)
	struct UInheritableComponentHandler* InheritableComponentHandler;  // 0x288 (0x288)
	struct UStructProperty* UberGraphFramePointerProperty;  // 0x290 (0x290)
	char pad_664[8];  // 0x298 (0x298)
	struct UFunction* UberGraphFunction;  // 0x2A0 (0x2A0)
	struct TMap<struct FName, struct FGuid> CookedPropertyGuids;  // 0x2A8 (0x2A8)
	struct TMap<struct FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData;  // 0x2F8 (0x2F8)
	char pad_840[56];  // 0x348 (0x348)


}; 
 
 


// Class Engine.AvoidanceManager
// Size: 0xE0(Inherited: 0x28)
struct UAvoidanceManager : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	float DefaultTimeToLive;  // 0x30 (0x30)
	float LockTimeAfterAvoid;  // 0x34 (0x34)
	float LockTimeAfterClean;  // 0x38 (0x38)
	float DeltaTimeToPredict;  // 0x3C (0x3C)
	float ArtificialRadiusExpansion;  // 0x40 (0x40)
	float TestHeightDifference;  // 0x44 (0x44)
	float HeightCheckMargin;  // 0x48 (0x48)
	char pad_76[148];  // 0x4C (0x4C)


	bool RegisterMovementComponent(struct UMovementComponent* MovementComp, float AvoidanceWeight); // Function Engine.AvoidanceManager.RegisterMovementComponent
	int32_t GetObjectCount(); // Function Engine.AvoidanceManager.GetObjectCount
	int32_t GetNewAvoidanceUID(); // Function Engine.AvoidanceManager.GetNewAvoidanceUID
	struct FVector GetAvoidanceVelocityForComponent(struct UMovementComponent* MovementComp); // Function Engine.AvoidanceManager.GetAvoidanceVelocityForComponent
}; 
 
 


// Class Engine.RuntimeVirtualTextureComponent
// Size: 0x330(Inherited: 0x2A0)
struct URuntimeVirtualTextureComponent : USceneComponent
{
	struct TSoftObjectPtr<AActor> BoundsAlignActor;  // 0x2A0 (0x2A0)
	char pad_720_1 : 7;  // 0x2D0 (0x2D0)
	bool bSetBoundsButton : 1;  // 0x2D0 (0x2D0)
	char pad_721_1 : 7;  // 0x2D1 (0x2D1)
	bool bSnapBoundsToLandscape : 1;  // 0x2D1 (0x2D1)
	char pad_722[6];  // 0x2D2 (0x2D2)
	struct URuntimeVirtualTexture* VirtualTexture;  // 0x2D8 (0x2D8)
	char pad_736_1 : 7;  // 0x2E0 (0x2E0)
	bool bEnableScalability : 1;  // 0x2E0 (0x2E0)
	char pad_737[3];  // 0x2E1 (0x2E1)
	uint32_t ScalabilityGroup;  // 0x2E4 (0x2E4)
	char pad_744_1 : 7;  // 0x2E8 (0x2E8)
	bool bHidePrimitives : 1;  // 0x2E8 (0x2E8)
	char pad_745[7];  // 0x2E9 (0x2E9)
	struct UVirtualTextureBuilder* StreamingTexture;  // 0x2F0 (0x2F0)
	int32_t StreamLowMips;  // 0x2F8 (0x2F8)
	char pad_764_1 : 7;  // 0x2FC (0x2FC)
	bool bBuildStreamingMipsButton : 1;  // 0x2FC (0x2FC)
	enum class ETextureLossyCompressionAmount LossyCompressionAmount;  // 0x2FD (0x2FD)
	char pad_766_1 : 7;  // 0x2FE (0x2FE)
	bool bUseStreamingLowMipsInEditor : 1;  // 0x2FE (0x2FE)
	char pad_767_1 : 7;  // 0x2FF (0x2FF)
	bool bBuildDebugStreamingMips : 1;  // 0x2FF (0x2FF)
	char pad_768[48];  // 0x300 (0x300)


	void Invalidate(struct FBoxSphereBounds& WorldBounds); // Function Engine.RuntimeVirtualTextureComponent.Invalidate
}; 
 
 


// Class Engine.MaterialExpressionThinTranslucentMaterialOutput
// Size: 0xD8(Inherited: 0xB0)
struct UMaterialExpressionThinTranslucentMaterialOutput : UMaterialExpressionCustomOutput
{
	struct FExpressionInput TransmittanceColor;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.DynamicBlueprintBinding
// Size: 0x28(Inherited: 0x28)
struct UDynamicBlueprintBinding : UObject
{


}; 
 
 


// Class Engine.InputDelegateBinding
// Size: 0x28(Inherited: 0x28)
struct UInputDelegateBinding : UDynamicBlueprintBinding
{


}; 
 
 


// Class Engine.InputComponent
// Size: 0x128(Inherited: 0xA0)
struct UInputComponent : UActorComponent
{
	char pad_160[112];  // 0xA0 (0xA0)
	struct TArray<struct FCachedKeyToActionInfo> CachedKeyToActionInfo;  // 0x110 (0x110)
	char pad_288[8];  // 0x120 (0x120)


	bool WasControllerKeyJustReleased(struct FKey Key); // Function Engine.InputComponent.WasControllerKeyJustReleased
	bool WasControllerKeyJustPressed(struct FKey Key); // Function Engine.InputComponent.WasControllerKeyJustPressed
	void OnInputOwnerEndPlayed(struct AActor* InOwner, enum class EEndPlayReason EndPlayReason); // Function Engine.InputComponent.OnInputOwnerEndPlayed
	bool IsControllerKeyDown(struct FKey Key); // Function Engine.InputComponent.IsControllerKeyDown
	void GetTouchState(int32_t FingerIndex, float& LocationX, float& LocationY, bool& bIsCurrentlyPressed); // Function Engine.InputComponent.GetTouchState
	struct FVector GetControllerVectorKeyState(struct FKey Key); // Function Engine.InputComponent.GetControllerVectorKeyState
	void GetControllerMouseDelta(float& DeltaX, float& DeltaY); // Function Engine.InputComponent.GetControllerMouseDelta
	float GetControllerKeyTimeDown(struct FKey Key); // Function Engine.InputComponent.GetControllerKeyTimeDown
	void GetControllerAnalogStickState(enum class EControllerAnalogStick WhichStick, float& StickX, float& StickY); // Function Engine.InputComponent.GetControllerAnalogStickState
	float GetControllerAnalogKeyState(struct FKey Key); // Function Engine.InputComponent.GetControllerAnalogKeyState
}; 
 
 


// Class Engine.ParticleModuleOrientationBase
// Size: 0x30(Inherited: 0x30)
struct UParticleModuleOrientationBase : UParticleModule
{


}; 
 
 


// Class Engine.ActorElementWorldInterface
// Size: 0x30(Inherited: 0x28)
struct UActorElementWorldInterface : UObject
{
	char pad_40[8];  // 0x28 (0x28)


}; 
 
 


// Class Engine.EdGraphSchema
// Size: 0x28(Inherited: 0x28)
struct UEdGraphSchema : UObject
{


}; 
 
 


// Class Engine.MaterialInterface
// Size: 0x98(Inherited: 0x28)
struct UMaterialInterface : UObject
{
	char pad_40[16];  // 0x28 (0x28)
	struct USubsurfaceProfile* SubsurfaceProfile;  // 0x38 (0x38)
	char pad_64[16];  // 0x40 (0x40)
	struct FLightmassMaterialInterfaceSettings LightmassSettings;  // 0x50 (0x50)
	struct TArray<struct FMaterialTextureInfo> TextureStreamingData;  // 0x60 (0x60)
	struct TArray<struct UAssetUserData*> AssetUserData;  // 0x70 (0x70)
	char pad_128[24];  // 0x80 (0x80)


	void SetForceMipLevelsToBeResident(bool OverrideForceMiplevelsToBeResident, bool bForceMiplevelsToBeResidentValue, float ForceDuration, int32_t CinematicTextureGroups, bool bFastResponse); // Function Engine.MaterialInterface.SetForceMipLevelsToBeResident
	struct UPhysicalMaterialMask* GetPhysicalMaterialMask(); // Function Engine.MaterialInterface.GetPhysicalMaterialMask
	struct UPhysicalMaterial* GetPhysicalMaterialFromMap(int32_t Index); // Function Engine.MaterialInterface.GetPhysicalMaterialFromMap
	struct UPhysicalMaterial* GetPhysicalMaterial(); // Function Engine.MaterialInterface.GetPhysicalMaterial
	struct FMaterialParameterInfo GetParameterInfo(enum class EMaterialParameterAssociation Association, struct FName ParameterName, struct UMaterialFunctionInterface* LayerFunction); // Function Engine.MaterialInterface.GetParameterInfo
	enum class EBlendMode GetBlendMode(); // Function Engine.MaterialInterface.GetBlendMode
	struct UMaterial* GetBaseMaterial(); // Function Engine.MaterialInterface.GetBaseMaterial
}; 
 
 


// Class Engine.MaterialExpressionSamplePhysicsIntegerField
// Size: 0xE0(Inherited: 0xB0)
struct UMaterialExpressionSamplePhysicsIntegerField : UMaterialExpression
{
	struct FExpressionInput WorldPosition;  // 0xB0 (0xB0)
	enum class EFieldIntegerType FieldTarget;  // 0xD8 (0xD8)
	char pad_217[7];  // 0xD9 (0xD9)


}; 
 
 


// Class Engine.LocalPlayer
// Size: 0x298(Inherited: 0x48)
struct ULocalPlayer : UPlayer
{
	char pad_72[48];  // 0x48 (0x48)
	struct UGameViewportClient* ViewportClient;  // 0x78 (0x78)
	char pad_128[56];  // 0x80 (0x80)
	enum class EAspectRatioAxisConstraint AspectRatioAxisConstraint;  // 0xB8 (0xB8)
	char pad_185[7];  // 0xB9 (0xB9)
	APlayerController* PendingLevelPlayerControllerClass;  // 0xC0 (0xC0)
	char bSentSplitJoin : 1;  // 0xC8 (0xC8)
	char pad_200_1 : 7;  // 0xC8 (0xC8)
	char pad_201[24];  // 0xC9 (0xC9)
	int32_t ControllerId;  // 0xE0 (0xE0)
	char pad_228[436];  // 0xE4 (0xE4)


}; 
 
 


// Class Engine.TimecodeProvider
// Size: 0x30(Inherited: 0x28)
struct UTimecodeProvider : UObject
{
	float FrameDelay;  // 0x28 (0x28)
	char pad_44[4];  // 0x2C (0x2C)


	struct FTimecode GetTimecode(); // Function Engine.TimecodeProvider.GetTimecode
	uint8_t GetSynchronizationState(); // Function Engine.TimecodeProvider.GetSynchronizationState
	struct FQualifiedFrameTime GetQualifiedFrameTime(); // Function Engine.TimecodeProvider.GetQualifiedFrameTime
	struct FFrameRate GetFrameRate(); // Function Engine.TimecodeProvider.GetFrameRate
	struct FTimecode GetDelayedTimecode(); // Function Engine.TimecodeProvider.GetDelayedTimecode
	struct FQualifiedFrameTime GetDelayedQualifiedFrameTime(); // Function Engine.TimecodeProvider.GetDelayedQualifiedFrameTime
	bool FetchTimecode(struct FQualifiedFrameTime& OutFrameTime); // Function Engine.TimecodeProvider.FetchTimecode
	void FetchAndUpdate(); // Function Engine.TimecodeProvider.FetchAndUpdate
}; 
 
 


// Class Engine.Font
// Size: 0x1D0(Inherited: 0x28)
struct UFont : UObject
{
	char pad_40[8];  // 0x28 (0x28)
	uint8_t FontCacheType;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)
	struct TArray<struct FFontCharacter> Characters;  // 0x38 (0x38)
	struct TArray<struct UTexture2D*> Textures;  // 0x48 (0x48)
	int32_t IsRemapped;  // 0x58 (0x58)
	float EmScale;  // 0x5C (0x5C)
	float Ascent;  // 0x60 (0x60)
	float Descent;  // 0x64 (0x64)
	float Leading;  // 0x68 (0x68)
	int32_t Kerning;  // 0x6C (0x6C)
	struct FFontImportOptionsData ImportOptions;  // 0x70 (0x70)
	int32_t NumCharacters;  // 0x120 (0x120)
	char pad_292[4];  // 0x124 (0x124)
	struct TArray<int32_t> MaxCharHeight;  // 0x128 (0x128)
	float ScalingFactor;  // 0x138 (0x138)
	int32_t LegacyFontSize;  // 0x13C (0x13C)
	struct FName LegacyFontName;  // 0x140 (0x140)
	struct FCompositeFont CompositeFont;  // 0x148 (0x148)
	char pad_384[80];  // 0x180 (0x180)


}; 
 
 


// Class Engine.LocalPlayerSubsystem
// Size: 0x30(Inherited: 0x30)
struct ULocalPlayerSubsystem : USubsystem
{


}; 
 
 


// Class Engine.MaterialFunction
// Size: 0x58(Inherited: 0x40)
struct UMaterialFunction : UMaterialFunctionInterface
{
	struct FString Description;  // 0x40 (0x40)
	char bExposeToLibrary : 1;  // 0x50 (0x50)
	char bPrefixParameterNames : 1;  // 0x50 (0x50)
	char bEnableExecWire : 1;  // 0x50 (0x50)
	char bEnableNewHLSLGenerator : 1;  // 0x50 (0x50)
	char pad_80_1 : 4;  // 0x50 (0x50)
	char pad_81[8];  // 0x51 (0x51)


}; 
 
 


// Class Engine.WorldSettings
// Size: 0x4B8(Inherited: 0x290)
struct AWorldSettings : AInfo
{
	char pad_656[8];  // 0x290 (0x290)
	int32_t VisibilityCellSize;  // 0x298 (0x298)
	enum class EVisibilityAggressiveness VisibilityAggressiveness;  // 0x29C (0x29C)
	char bPrecomputeVisibility : 1;  // 0x29D (0x29D)
	char bPlaceCellsOnlyAlongCameraTracks : 1;  // 0x29D (0x29D)
	char bEnableWorldBoundsChecks : 1;  // 0x29D (0x29D)
	char bEnableNavigationSystem : 1;  // 0x29D (0x29D)
	char bEnableAISystem : 1;  // 0x29D (0x29D)
	char bEnableWorldComposition : 1;  // 0x29D (0x29D)
	char bUseClientSideLevelStreamingVolumes : 1;  // 0x29D (0x29D)
	char bEnableWorldOriginRebasing : 1;  // 0x29D (0x29D)
	char bWorldGravitySet : 1;  // 0x29E (0x29E)
	char bGlobalGravitySet : 1;  // 0x29E (0x29E)
	char bMinimizeBSPSections : 1;  // 0x29E (0x29E)
	char bForceNoPrecomputedLighting : 1;  // 0x29E (0x29E)
	char bHighPriorityLoading : 1;  // 0x29E (0x29E)
	char bHighPriorityLoadingLocal : 1;  // 0x29E (0x29E)
	char bOverrideDefaultBroadphaseSettings : 1;  // 0x29E (0x29E)
	char bGenerateSingleClusterForLevel : 1;  // 0x29E (0x29E)
	char pad_671[1];  // 0x29F (0x29F)
	struct TSoftClassPtr<UObject> AISystemClass;  // 0x2A0 (0x2A0)
	struct FVector LevelInstancePivotOffset;  // 0x2D0 (0x2D0)
	struct UNavigationSystemConfig* NavigationSystemConfig;  // 0x2E8 (0x2E8)
	struct UNavigationSystemConfig* NavigationSystemConfigOverride;  // 0x2F0 (0x2F0)
	struct UWorldPartition* WorldPartition;  // 0x2F8 (0x2F8)
	struct TArray<struct UDataLayerAsset*> BaseNavmeshDataLayers;  // 0x300 (0x300)
	float WorldToMeters;  // 0x310 (0x310)
	float KillZ;  // 0x314 (0x314)
	UDamageType* KillZDamageType;  // 0x318 (0x318)
	float WorldGravityZ;  // 0x320 (0x320)
	float GlobalGravityZ;  // 0x324 (0x324)
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass;  // 0x328 (0x328)
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass;  // 0x330 (0x330)
	AGameModeBase* DefaultGameMode;  // 0x338 (0x338)
	AGameNetworkManager* GameNetworkManagerClass;  // 0x340 (0x340)
	int32_t PackedLightAndShadowMapTextureSize;  // 0x348 (0x348)
	char pad_844[4];  // 0x34C (0x34C)
	struct FVector DefaultColorScale;  // 0x350 (0x350)
	float DefaultMaxDistanceFieldOcclusionDistance;  // 0x368 (0x368)
	float GlobalDistanceFieldViewDistance;  // 0x36C (0x36C)
	float DynamicIndirectShadowsSelfShadowingIntensity;  // 0x370 (0x370)
	char pad_884[4];  // 0x374 (0x374)
	struct FReverbSettings DefaultReverbSettings;  // 0x378 (0x378)
	struct FInteriorSettings DefaultAmbientZoneSettings;  // 0x398 (0x398)
	char pad_956[4];  // 0x3BC (0x3BC)
	struct USoundMix* DefaultBaseSoundMix;  // 0x3C0 (0x3C0)
	float TimeDilation;  // 0x3C8 (0x3C8)
	float CinematicTimeDilation;  // 0x3CC (0x3CC)
	float DemoPlayTimeDilation;  // 0x3D0 (0x3D0)
	float MinGlobalTimeDilation;  // 0x3D4 (0x3D4)
	float MaxGlobalTimeDilation;  // 0x3D8 (0x3D8)
	float MinUndilatedFrameTime;  // 0x3DC (0x3DC)
	float MaxUndilatedFrameTime;  // 0x3E0 (0x3E0)
	char pad_996[4];  // 0x3E4 (0x3E4)
	struct FBroadphaseSettings BroadphaseSettings;  // 0x3E8 (0x3E8)
	struct TArray<struct FNetViewer> ReplicationViewers;  // 0x468 (0x468)
	struct TArray<struct UAssetUserData*> AssetUserData;  // 0x478 (0x478)
	struct APlayerState* PauserPlayerState;  // 0x488 (0x488)
	int32_t MaxNumberOfBookmarks;  // 0x490 (0x490)
	char pad_1172[4];  // 0x494 (0x494)
	UBookmarkBase* DefaultBookmarkClass;  // 0x498 (0x498)
	struct TArray<struct UBookmarkBase*> BookmarkArray;  // 0x4A0 (0x4A0)
	UBookmarkBase* LastBookmarkClass;  // 0x4B0 (0x4B0)


	void OnRep_WorldGravityZ(); // Function Engine.WorldSettings.OnRep_WorldGravityZ
}; 
 
 


// Class Engine.ScriptViewportClient
// Size: 0x38(Inherited: 0x28)
struct UScriptViewportClient : UObject
{
	char pad_40[16];  // 0x28 (0x28)


}; 
 
 


// Class Engine.LevelScriptBlueprint
// Size: 0xA8(Inherited: 0xA8)
struct ULevelScriptBlueprint : UBlueprint
{


}; 
 
 


// Class Engine.Material
// Size: 0x1F0(Inherited: 0x98)
struct UMaterial : UMaterialInterface
{
	struct UPhysicalMaterial* PhysMaterial;  // 0x98 (0x98)
	struct UPhysicalMaterialMask* PhysMaterialMask;  // 0xA0 (0xA0)
	struct UPhysicalMaterial* PhysicalMaterialMap[8];  // 0xA8 (0xA8)
	struct TArray<struct UPhysicalMaterial*> RenderTracePhysicalMaterialOutputs;  // 0xE8 (0xE8)
	enum class EMaterialDomain MaterialDomain;  // 0xF8 (0xF8)
	enum class EBlendMode BlendMode;  // 0xF9 (0xF9)
	enum class EStrataBlendMode StrataBlendMode;  // 0xFA (0xFA)
	enum class EDecalBlendMode DecalBlendMode;  // 0xFB (0xFB)
	enum class EMaterialDecalResponse MaterialDecalResponse;  // 0xFC (0xFC)
	char pad_253[3];  // 0xFD (0xFD)
	struct FMaterialOverrideNanite NaniteOverrideMaterial;  // 0x100 (0x100)
	uint32_t CachedConnectedInputs;  // 0x140 (0x140)
	enum class EMaterialShadingModel ShadingModel;  // 0x144 (0x144)
	char bCastDynamicShadowAsMasked : 1;  // 0x145 (0x145)
	char pad_325_1 : 7;  // 0x145 (0x145)
	struct FMaterialShadingModelField ShadingModels;  // 0x146 (0x146)
	float OpacityMaskClipValue;  // 0x148 (0x148)
	char bEnableSeparateTranslucency : 1;  // 0x14C (0x14C)
	char bEnableResponsiveAA : 1;  // 0x14C (0x14C)
	char bScreenSpaceReflections : 1;  // 0x14C (0x14C)
	char bContactShadows : 1;  // 0x14C (0x14C)
	char TwoSided : 1;  // 0x14C (0x14C)
	char DitheredLODTransition : 1;  // 0x14C (0x14C)
	char DitherOpacityMask : 1;  // 0x14C (0x14C)
	char bAllowNegativeEmissiveColor : 1;  // 0x14C (0x14C)
	enum class EMaterialTranslucencyPass TranslucencyPass;  // 0x14D (0x14D)
	enum class ETranslucencyLightingMode TranslucencyLightingMode;  // 0x14E (0x14E)
	char bEnableMobileSeparateTranslucency : 1;  // 0x14F (0x14F)
	char pad_335_1 : 7;  // 0x14F (0x14F)
	int32_t NumCustomizedUVs;  // 0x150 (0x150)
	float TranslucencyDirectionalLightingIntensity;  // 0x154 (0x154)
	float TranslucentShadowDensityScale;  // 0x158 (0x158)
	float TranslucentSelfShadowDensityScale;  // 0x15C (0x15C)
	float TranslucentSelfShadowSecondDensityScale;  // 0x160 (0x160)
	float TranslucentSelfShadowSecondOpacity;  // 0x164 (0x164)
	float TranslucentBackscatteringExponent;  // 0x168 (0x168)
	struct FLinearColor TranslucentMultipleScatteringExtinction;  // 0x16C (0x16C)
	float TranslucentShadowStartOffset;  // 0x17C (0x17C)
	char bDisableDepthTest : 1;  // 0x180 (0x180)
	char bWriteOnlyAlpha : 1;  // 0x180 (0x180)
	char bGenerateSphericalParticleNormals : 1;  // 0x180 (0x180)
	char bTangentSpaceNormal : 1;  // 0x180 (0x180)
	char bUseEmissiveForDynamicAreaLighting : 1;  // 0x180 (0x180)
	char bUsedAsSpecialEngineMaterial : 1;  // 0x180 (0x180)
	char bUsedWithSkeletalMesh : 1;  // 0x180 (0x180)
	char bUsedWithEditorCompositing : 1;  // 0x180 (0x180)
	char bUsedWithParticleSprites : 1;  // 0x181 (0x181)
	char bUsedWithBeamTrails : 1;  // 0x181 (0x181)
	char bUsedWithMeshParticles : 1;  // 0x181 (0x181)
	char bUsedWithNiagaraSprites : 1;  // 0x181 (0x181)
	char bUsedWithNiagaraRibbons : 1;  // 0x181 (0x181)
	char bUsedWithNiagaraMeshParticles : 1;  // 0x181 (0x181)
	char bUsedWithGeometryCache : 1;  // 0x181 (0x181)
	char bUsedWithStaticLighting : 1;  // 0x181 (0x181)
	char bUsedWithMorphTargets : 1;  // 0x182 (0x182)
	char bUsedWithSplineMeshes : 1;  // 0x182 (0x182)
	char bUsedWithInstancedStaticMeshes : 1;  // 0x182 (0x182)
	char bUsedWithGeometryCollections : 1;  // 0x182 (0x182)
	char bUsesDistortion : 1;  // 0x182 (0x182)
	char bUsedWithClothing : 1;  // 0x182 (0x182)
	char pad_386_1 : 2;  // 0x182 (0x182)
	char pad_387[2];  // 0x183 (0x183)
	char bUsedWithWater : 1;  // 0x184 (0x184)
	char bUsedWithHairStrands : 1;  // 0x184 (0x184)
	char bUsedWithLidarPointCloud : 1;  // 0x184 (0x184)
	char bUsedWithVirtualHeightfieldMesh : 1;  // 0x184 (0x184)
	char bUsedWithNanite : 1;  // 0x184 (0x184)
	char pad_388_1 : 3;  // 0x184 (0x184)
	char pad_389[4];  // 0x185 (0x185)
	char bUsedWithUI : 1;  // 0x188 (0x188)
	char bAutomaticallySetUsageInEditor : 1;  // 0x188 (0x188)
	char bFullyRough : 1;  // 0x188 (0x188)
	char bUseFullPrecision : 1;  // 0x188 (0x188)
	char pad_392_1 : 4;  // 0x188 (0x188)
	enum class EMaterialFloatPrecisionMode FloatPrecisionMode;  // 0x189 (0x189)
	char bUseLightmapDirectionality : 1;  // 0x18A (0x18A)
	char bMobileEnableHighQualityBRDF : 1;  // 0x18A (0x18A)
	char bUseAlphaToCoverage : 1;  // 0x18A (0x18A)
	char pad_394_1 : 5;  // 0x18A (0x18A)
	char pad_395[2];  // 0x18B (0x18B)
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1;  // 0x18C (0x18C)
	char pad_396_1 : 7;  // 0x18C (0x18C)
	char pad_397[4];  // 0x18D (0x18D)
	char bUseHQForwardReflections : 1;  // 0x190 (0x190)
	char bForwardBlendsSkyLightCubemaps : 1;  // 0x190 (0x190)
	char bUsePlanarForwardReflections : 1;  // 0x190 (0x190)
	char bNormalCurvatureToRoughness : 1;  // 0x190 (0x190)
	char AllowTranslucentCustomDepthWrites : 1;  // 0x190 (0x190)
	char Wireframe : 1;  // 0x190 (0x190)
	char pad_400_1 : 2;  // 0x190 (0x190)
	enum class EMaterialShadingRate ShadingRate;  // 0x191 (0x191)
	char bCanMaskedBeAssumedOpaque : 1;  // 0x192 (0x192)
	char bIsMasked : 1;  // 0x192 (0x192)
	char bIsPreviewMaterial : 1;  // 0x192 (0x192)
	char bIsFunctionPreviewMaterial : 1;  // 0x192 (0x192)
	char bUseMaterialAttributes : 1;  // 0x192 (0x192)
	char bEnableExecWire : 1;  // 0x192 (0x192)
	char bEnableNewHLSLGenerator : 1;  // 0x192 (0x192)
	char bCastRayTracedShadows : 1;  // 0x192 (0x192)
	char bUseTranslucencyVertexFog : 1;  // 0x193 (0x193)
	char bApplyCloudFogging : 1;  // 0x193 (0x193)
	char bIsSky : 1;  // 0x193 (0x193)
	char bComputeFogPerPixel : 1;  // 0x193 (0x193)
	char bOutputTranslucentVelocity : 1;  // 0x193 (0x193)
	char bAllowDevelopmentShaderCompile : 1;  // 0x193 (0x193)
	char bIsMaterialEditorStatsMaterial : 1;  // 0x193 (0x193)
	char pad_403_1 : 1;  // 0x193 (0x193)
	enum class EBlendableLocation BlendableLocation;  // 0x194 (0x194)
	char BlendableOutputAlpha : 1;  // 0x195 (0x195)
	char bEnableStencilTest : 1;  // 0x195 (0x195)
	char pad_405_1 : 6;  // 0x195 (0x195)
	enum class EMaterialStencilCompare StencilCompare;  // 0x196 (0x196)
	char StencilRefValue;  // 0x197 (0x197)
	enum class ERefractionMode RefractionMode;  // 0x198 (0x198)
	char pad_409[3];  // 0x199 (0x199)
	int32_t BlendablePriority;  // 0x19C (0x19C)
	char bIsBlendable : 1;  // 0x1A0 (0x1A0)
	char pad_416_1 : 7;  // 0x1A0 (0x1A0)
	char pad_417[4];  // 0x1A1 (0x1A1)
	uint32_t UsageFlagWarnings;  // 0x1A4 (0x1A4)
	float RefractionDepthBias;  // 0x1A8 (0x1A8)
	struct FGuid StateId;  // 0x1AC (0x1AC)
	char pad_444[52];  // 0x1BC (0x1BC)


}; 
 
 


// Class Engine.LightmappedSurfaceCollection
// Size: 0x40(Inherited: 0x28)
struct ULightmappedSurfaceCollection : UObject
{
	struct UModel* SourceModel;  // 0x28 (0x28)
	struct TArray<int32_t> Surfaces;  // 0x30 (0x30)


}; 
 
 


// Class Engine.GameViewportClient
// Size: 0x3A0(Inherited: 0x38)
struct UGameViewportClient : UScriptViewportClient
{
	char pad_56[8];  // 0x38 (0x38)
	struct UConsole* ViewportConsole;  // 0x40 (0x40)
	struct TArray<struct FDebugDisplayProperty> DebugProperties;  // 0x48 (0x48)
	char pad_88[16];  // 0x58 (0x58)
	int32_t MaxSplitscreenPlayers;  // 0x68 (0x68)
	char pad_108[12];  // 0x6C (0x6C)
	struct UWorld* World;  // 0x78 (0x78)
	struct UGameInstance* GameInstance;  // 0x80 (0x80)
	char pad_136[792];  // 0x88 (0x88)


	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea
	void SetConsoleTarget(int32_t PlayerIndex); // Function Engine.GameViewportClient.SetConsoleTarget
}; 
 
 


// Class Engine.LevelActorContainer
// Size: 0x38(Inherited: 0x28)
struct ULevelActorContainer : UObject
{
	struct TArray<struct AActor*> Actors;  // 0x28 (0x28)


}; 
 
 


// Class Engine.GameInstance
// Size: 0x1C0(Inherited: 0x28)
struct UGameInstance : UObject
{
	char pad_40[16];  // 0x28 (0x28)
	struct TArray<struct ULocalPlayer*> LocalPlayers;  // 0x38 (0x38)
	struct UOnlineSession* OnlineSession;  // 0x48 (0x48)
	struct TArray<struct UObject*> ReferencedObjects;  // 0x50 (0x50)
	char pad_96[24];  // 0x60 (0x60)
	struct FMulticastInlineDelegate OnPawnControllerChangedDelegates;  // 0x78 (0x78)
	char pad_136[24];  // 0x88 (0x88)
	struct FMulticastInlineDelegate OnInputDeviceConnectionChange;  // 0xA0 (0xA0)
	struct FMulticastInlineDelegate OnUserInputDevicePairingChange;  // 0xB0 (0xB0)
	char pad_192[256];  // 0xC0 (0xC0)


	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit
	void HandleTravelError(enum class ETravelFailure FailureType); // Function Engine.GameInstance.HandleTravelError
	void HandleNetworkError(enum class ENetworkFailure FailureType, bool bIsServer); // Function Engine.GameInstance.HandleNetworkError
	void DebugRemovePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugRemovePlayer
	void DebugCreatePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugCreatePlayer
}; 
 
 


// Class Engine.CurveTable
// Size: 0xA0(Inherited: 0x28)
struct UCurveTable : UObject
{
	char pad_40[120];  // 0x28 (0x28)


}; 
 
 


// Class Engine.TextureCube
// Size: 0x290(Inherited: 0x1F0)
struct UTextureCube : UTexture
{
	char pad_496[160];  // 0x1F0 (0x1F0)


}; 
 
 


// Class Engine.LODActor
// Size: 0x318(Inherited: 0x290)
struct ALODActor : AActor
{
	struct UStaticMeshComponent* StaticMeshComponent;  // 0x290 (0x290)
	struct TMap<struct FHLODInstancingKey, struct UInstancedStaticMeshComponent*> InstancedStaticMeshComponents;  // 0x298 (0x298)
	struct UHLODProxy* Proxy;  // 0x2E8 (0x2E8)
	struct FName Key;  // 0x2F0 (0x2F0)
	float LODDrawDistance;  // 0x2F8 (0x2F8)
	int32_t LODLevel;  // 0x2FC (0x2FC)
	struct TArray<struct AActor*> SubActors;  // 0x300 (0x300)
	char CachedNumHLODLevels;  // 0x310 (0x310)
	char pad_785[7];  // 0x311 (0x311)


	void OnSubActorEndPlay(struct AActor* Actor, enum class EEndPlayReason Reason); // Function Engine.LODActor.OnSubActorEndPlay
}; 
 
 


// Class Engine.EndpointSubmix
// Size: 0x58(Inherited: 0x40)
struct UEndpointSubmix : USoundSubmixBase
{
	struct FName EndpointType;  // 0x40 (0x40)
	UAudioEndpointSettingsBase* EndpointSettingsClass;  // 0x48 (0x48)
	struct UAudioEndpointSettingsBase* EndpointSettings;  // 0x50 (0x50)


}; 
 
 


// Class Engine.DataTable
// Size: 0xB0(Inherited: 0x28)
struct UDataTable : UObject
{
	struct UScriptStruct* RowStruct;  // 0x28 (0x28)
	char pad_48[80];  // 0x30 (0x30)
	char bStripFromClientBuilds : 1;  // 0x80 (0x80)
	char bIgnoreExtraFields : 1;  // 0x80 (0x80)
	char bIgnoreMissingFields : 1;  // 0x80 (0x80)
	char pad_128_1 : 5;  // 0x80 (0x80)
	char pad_129[8];  // 0x81 (0x81)
	struct FString ImportKeyField;  // 0x88 (0x88)
	char pad_152[24];  // 0x98 (0x98)


}; 
 
 


// Class Engine.AnimNotifyState_DisableRootMotion
// Size: 0x30(Inherited: 0x30)
struct UAnimNotifyState_DisableRootMotion : UAnimNotifyState
{


}; 
 
 


// Class Engine.MaterialInterfaceEditorOnlyData
// Size: 0x40(Inherited: 0x28)
struct UMaterialInterfaceEditorOnlyData : UObject
{
	char pad_40[24];  // 0x28 (0x28)


}; 
 
 


// Class Engine.RuntimeOptionsBase
// Size: 0x38(Inherited: 0x28)
struct URuntimeOptionsBase : UObject
{
	char pad_40[16];  // 0x28 (0x28)


}; 
 
 


// Class Engine.SaveGame
// Size: 0x28(Inherited: 0x28)
struct USaveGame : UObject
{


}; 
 
 


// Class Engine.MaterialExpressionTangentOutput
// Size: 0xD8(Inherited: 0xB0)
struct UMaterialExpressionTangentOutput : UMaterialExpressionCustomOutput
{
	struct FExpressionInput Input;  // 0xB0 (0xB0)


}; 
 
 


// Class Engine.MaterialExpression
// Size: 0xB0(Inherited: 0x28)
struct UMaterialExpression : UObject
{
	int32_t MaterialExpressionEditorX;  // 0x28 (0x28)
	int32_t MaterialExpressionEditorY;  // 0x2C (0x2C)
	struct UEdGraphNode* GraphNode;  // 0x30 (0x30)
	struct UMaterialExpression* SubgraphExpression;  // 0x38 (0x38)
	char pad_64[16];  // 0x40 (0x40)
	struct FGuid MaterialExpressionGuid;  // 0x50 (0x50)
	struct UMaterial* Material;  // 0x60 (0x60)
	struct UMaterialFunction* Function;  // 0x68 (0x68)
	struct FString Desc;  // 0x70 (0x70)
	char pad_128[4];  // 0x80 (0x80)
	char bRealtimePreview : 1;  // 0x84 (0x84)
	char bNeedToUpdatePreview : 1;  // 0x84 (0x84)
	char pad_132_1 : 6;  // 0x84 (0x84)
	char pad_133[4];  // 0x85 (0x85)
	char bIsParameterExpression : 1;  // 0x88 (0x88)
	char pad_136_1 : 7;  // 0x88 (0x88)
	char pad_137[4];  // 0x89 (0x89)
	char bCommentBubbleVisible : 1;  // 0x8C (0x8C)
	char bShowOutputNameOnPin : 1;  // 0x8C (0x8C)
	char bShowMaskColorsOnPin : 1;  // 0x8C (0x8C)
	char bHidePreviewWindow : 1;  // 0x8C (0x8C)
	char bCollapsed : 1;  // 0x8C (0x8C)
	char bShaderInputData : 1;  // 0x8C (0x8C)
	char bShowInputs : 1;  // 0x8C (0x8C)
	char bShowOutputs : 1;  // 0x8C (0x8C)
	char pad_141[3];  // 0x8D (0x8D)
	struct TArray<struct FText> MenuCategories;  // 0x90 (0x90)
	struct TArray<struct FExpressionOutput> Outputs;  // 0xA0 (0xA0)


}; 
 
 


// Class Engine.MaterialExpressionTextureBase
// Size: 0xC0(Inherited: 0xB0)
struct UMaterialExpressionTextureBase : UMaterialExpression
{
	struct UTexture* Texture;  // 0xB0 (0xB0)
	enum class EMaterialSamplerType SamplerType;  // 0xB8 (0xB8)
	char IsDefaultMeshpaintTexture : 1;  // 0xB9 (0xB9)
	char pad_185_1 : 7;  // 0xB9 (0xB9)
	char pad_186[7];  // 0xBA (0xBA)


}; 
 
 


// Class Engine.MaterialExpressionTextureSampleParameter
// Size: 0x240(Inherited: 0x1B8)
struct UMaterialExpressionTextureSampleParameter : UMaterialExpressionTextureSample
{
	struct FName ParameterName;  // 0x1B8 (0x1B8)
	struct FGuid ExpressionGUID;  // 0x1C0 (0x1C0)
	struct FName Group;  // 0x1D0 (0x1D0)
	int32_t SortPriority;  // 0x1D8 (0x1D8)
	char pad_476[4];  // 0x1DC (0x1DC)
	struct FParameterChannelNames ChannelNames;  // 0x1E0 (0x1E0)


}; 
 
 


// Class Engine.DialogueVoice
// Size: 0x40(Inherited: 0x28)
struct UDialogueVoice : UObject
{
	enum class EGrammaticalGender Gender;  // 0x28 (0x28)
	enum class EGrammaticalNumber Plurality;  // 0x29 (0x29)
	char pad_42[2];  // 0x2A (0x2A)
	struct FGuid LocalizationGUID;  // 0x2C (0x2C)
	char pad_60[4];  // 0x3C (0x3C)


}; 
 
 


// Class Engine.FontImportOptions
// Size: 0xD8(Inherited: 0x28)
struct UFontImportOptions : UObject
{
	struct FFontImportOptionsData Data;  // 0x28 (0x28)


}; 
 
 


// Class Engine.BlueprintPlatformLibrary
// Size: 0x28(Inherited: 0x28)
struct UBlueprintPlatformLibrary : UBlueprintFunctionLibrary
{


	void SetAllowedDeviceOrientation(enum class EScreenOrientation NewAllowedDeviceOrientation); // Function Engine.BlueprintPlatformLibrary.SetAllowedDeviceOrientation
	int32_t ScheduleLocalNotificationFromNow(int32_t inSecondsFromNow, struct FText& Title, struct FText& Body, struct FText& Action, struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationFromNow
	void ScheduleLocalNotificationBadgeFromNow(int32_t inSecondsFromNow, struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationBadgeFromNow
	int32_t ScheduleLocalNotificationBadgeAtTime(struct FDateTime& FireDateTime, bool LocalTime, struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationBadgeAtTime
	int32_t ScheduleLocalNotificationAtTime(struct FDateTime& FireDateTime, bool LocalTime, struct FText& Title, struct FText& Body, struct FText& Action, struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.ScheduleLocalNotificationAtTime
	void GetLaunchNotification(bool& NotificationLaunchedApp, struct FString& ActivationEvent, int32_t& FireDate); // Function Engine.BlueprintPlatformLibrary.GetLaunchNotification
	enum class EScreenOrientation GetDeviceOrientation(); // Function Engine.BlueprintPlatformLibrary.GetDeviceOrientation
	enum class EScreenOrientation GetAllowedDeviceOrientation(); // Function Engine.BlueprintPlatformLibrary.GetAllowedDeviceOrientation
	void ClearAllLocalNotifications(); // Function Engine.BlueprintPlatformLibrary.ClearAllLocalNotifications
	void CancelLocalNotificationById(int32_t NotificationId); // Function Engine.BlueprintPlatformLibrary.CancelLocalNotificationById
	void CancelLocalNotification(struct FString ActivationEvent); // Function Engine.BlueprintPlatformLibrary.CancelLocalNotification
}; 
 
 


// Class Engine.AssetMappingTable
// Size: 0x38(Inherited: 0x28)
struct UAssetMappingTable : UObject
{
	struct TArray<struct FAssetMapping> MappedAssets;  // 0x28 (0x28)


}; 
 
 


// Class Engine.AnimInstance
// Size: 0x350(Inherited: 0x28)
struct UAnimInstance : UObject
{
	struct USkeleton* CurrentSkeleton;  // 0x28 (0x28)
	enum class ERootMotionMode RootMotionMode;  // 0x30 (0x30)
	char bUseMultiThreadedAnimationUpdate : 1;  // 0x31 (0x31)
	char bUsingCopyPoseFromMesh : 1;  // 0x31 (0x31)
	char pad_49_1 : 2;  // 0x31 (0x31)
	char bReceiveNotifiesFromLinkedInstances : 1;  // 0x31 (0x31)
	char bPropagateNotifiesToLinkedInstances : 1;  // 0x31 (0x31)
	char bUseMainInstanceMontageEvaluationData : 1;  // 0x31 (0x31)
	char bQueueMontageEvents : 1;  // 0x31 (0x31)
	char pad_50[6];  // 0x32 (0x32)
	struct FMulticastInlineDelegate OnMontageBlendingOut;  // 0x38 (0x38)
	struct FMulticastInlineDelegate OnMontageStarted;  // 0x48 (0x48)
	struct FMulticastInlineDelegate OnMontageEnded;  // 0x58 (0x58)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded;  // 0x68 (0x68)
	char pad_120[216];  // 0x78 (0x78)
	struct FAnimNotifyQueue NotifyQueue;  // 0x150 (0x150)
	struct TArray<struct FAnimNotifyEvent> ActiveAnimNotifyState;  // 0x1C0 (0x1C0)
	struct TArray<struct FAnimNotifyEventReference> ActiveAnimNotifyEventReference;  // 0x1D0 (0x1D0)
	char pad_480[368];  // 0x1E0 (0x1E0)


	bool WasAnimNotifyTriggeredInStateMachine(int32_t MachineIndex, UAnimNotify* AnimNotifyType); // Function Engine.AnimInstance.WasAnimNotifyTriggeredInStateMachine
	bool WasAnimNotifyTriggeredInSourceState(int32_t MachineIndex, int32_t StateIndex, UAnimNotify* AnimNotifyType); // Function Engine.AnimInstance.WasAnimNotifyTriggeredInSourceState
	bool WasAnimNotifyTriggeredInAnyState(UAnimNotify* AnimNotifyType); // Function Engine.AnimInstance.WasAnimNotifyTriggeredInAnyState
	bool WasAnimNotifyStateActiveInStateMachine(int32_t MachineIndex, UAnimNotifyState* AnimNotifyStateType); // Function Engine.AnimInstance.WasAnimNotifyStateActiveInStateMachine
	bool WasAnimNotifyStateActiveInSourceState(int32_t MachineIndex, int32_t StateIndex, UAnimNotifyState* AnimNotifyStateType); // Function Engine.AnimInstance.WasAnimNotifyStateActiveInSourceState
	bool WasAnimNotifyStateActiveInAnyState(UAnimNotifyState* AnimNotifyStateType); // Function Engine.AnimInstance.WasAnimNotifyStateActiveInAnyState
	bool WasAnimNotifyNameTriggeredInStateMachine(int32_t MachineIndex, struct FName NotifyName); // Function Engine.AnimInstance.WasAnimNotifyNameTriggeredInStateMachine
	bool WasAnimNotifyNameTriggeredInSourceState(int32_t MachineIndex, int32_t StateIndex, struct FName NotifyName); // Function Engine.AnimInstance.WasAnimNotifyNameTriggeredInSourceState
	bool WasAnimNotifyNameTriggeredInAnyState(struct FName NotifyName); // Function Engine.AnimInstance.WasAnimNotifyNameTriggeredInAnyState
	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic); // Function Engine.AnimInstance.UnlockAIResources
	void UnlinkAnimClassLayers(UAnimInstance* InClass); // Function Engine.AnimInstance.UnlinkAnimClassLayers
	struct APawn* TryGetPawnOwner(); // Function Engine.AnimInstance.TryGetPawnOwner
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName); // Function Engine.AnimInstance.StopSlotAnimation
	void SnapshotPose(struct FPoseSnapshot& Snapshot); // Function Engine.AnimInstance.SnapshotPose
	void SetUseMainInstanceMontageEvaluationData(bool bSet); // Function Engine.AnimInstance.SetUseMainInstanceMontageEvaluationData
	void SetRootMotionMode(enum class ERootMotionMode Value); // Function Engine.AnimInstance.SetRootMotionMode
	void SetReceiveNotifiesFromLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetReceiveNotifiesFromLinkedInstances
	void SetPropagateNotifiesToLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetPropagateNotifiesToLinkedInstances
	void SetMorphTarget(struct FName MorphTargetName, float Value); // Function Engine.AnimInstance.SetMorphTarget
	void SavePoseSnapshot(struct FName SnapshotName); // Function Engine.AnimInstance.SavePoseSnapshot
	void ResetDynamics(uint8_t InTeleportType); // Function Engine.AnimInstance.ResetDynamics
	bool RequestTransitionEvent(struct FName EventName, double RequestTimeout, uint8_t QueueMode, uint8_t OverwriteMode); // Function Engine.AnimInstance.RequestTransitionEvent
	void RequestSlotGroupInertialization(struct FName InSlotGroupName, float Duration, struct UBlendProfile* BlendProfile); // Function Engine.AnimInstance.RequestSlotGroupInertialization
	void RemovePoseSnapshot(struct FName SnapshotName); // Function Engine.AnimInstance.RemovePoseSnapshot
	bool QueryTransitionEvent(int32_t MachineIndex, int32_t TransitionIndex, struct FName EventName); // Function Engine.AnimInstance.QueryTransitionEvent
	bool QueryAndMarkTransitionEvent(int32_t MachineIndex, int32_t TransitionIndex, struct FName EventName); // Function Engine.AnimInstance.QueryAndMarkTransitionEvent
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage_WithBlendSettings(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, struct FMontageBlendSettings& BlendInSettings, struct FMontageBlendSettings& BlendOutSettings, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage_WithBlendSettings
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage_WithBlendArgs(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, struct FAlphaBlendArgs& BlendIn, struct FAlphaBlendArgs& BlendOut, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage_WithBlendArgs
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage
	void MontageSync_StopFollowing(struct UAnimMontage* MontageFollower); // Function Engine.AnimInstance.MontageSync_StopFollowing
	void MontageSync_Follow(struct UAnimMontage* MontageFollower, struct UAnimInstance* OtherAnimInstance, struct UAnimMontage* MontageLeader); // Function Engine.AnimInstance.MontageSync_Follow
	void Montage_StopWithBlendSettings(struct FMontageBlendSettings& BlendOutSettings, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_StopWithBlendSettings
	void Montage_StopWithBlendOut(struct FAlphaBlendArgs& BlendOut, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_StopWithBlendOut
	void Montage_StopGroupByName(float InBlendOutTime, struct FName GroupName); // Function Engine.AnimInstance.Montage_StopGroupByName
	void Montage_Stop(float InBlendOutTime, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Stop
	void Montage_SetPosition(struct UAnimMontage* Montage, float NewPosition); // Function Engine.AnimInstance.Montage_SetPosition
	void Montage_SetPlayRate(struct UAnimMontage* Montage, float NewPlayRate); // Function Engine.AnimInstance.Montage_SetPlayRate
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_SetNextSection
	void Montage_Resume(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Resume
	float Montage_PlayWithBlendSettings(struct UAnimMontage* MontageToPlay, struct FMontageBlendSettings& BlendInSettings, float InPlayRate, uint8_t ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_PlayWithBlendSettings
	float Montage_PlayWithBlendIn(struct UAnimMontage* MontageToPlay, struct FAlphaBlendArgs& BlendIn, float InPlayRate, uint8_t ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_PlayWithBlendIn
	float Montage_Play(struct UAnimMontage* MontageToPlay, float InPlayRate, uint8_t ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_Play
	void Montage_Pause(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Pause
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSectionsEnd
	void Montage_JumpToSection(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSection
	bool Montage_IsPlaying(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsPlaying
	bool Montage_IsActive(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsActive
	float Montage_GetPosition(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPosition
	float Montage_GetPlayRate(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPlayRate
	bool Montage_GetIsStopped(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetIsStopped
	struct FName Montage_GetCurrentSection(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetCurrentSection
	float Montage_GetBlendTime(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetBlendTime
	void LockAIResources(bool bLockMovement, bool LockAILogic); // Function Engine.AnimInstance.LockAIResources
	void LinkAnimGraphByTag(struct FName InTag, UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimGraphByTag
	void LinkAnimClassLayers(UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimClassLayers
	bool IsUsingMainInstanceMontageEvaluationData(); // Function Engine.AnimInstance.IsUsingMainInstanceMontageEvaluationData
	bool IsSyncGroupBetweenMarkers(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, bool bRespectMarkerOrder); // Function Engine.AnimInstance.IsSyncGroupBetweenMarkers
	bool IsPlayingSlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName); // Function Engine.AnimInstance.IsPlayingSlotAnimation
	bool IsAnyMontagePlaying(); // Function Engine.AnimInstance.IsAnyMontagePlaying
	bool HasMarkerBeenHitThisFrame(struct FName SyncGroup, struct FName MarkerName); // Function Engine.AnimInstance.HasMarkerBeenHitThisFrame
	bool GetTimeToClosestMarker(struct FName SyncGroup, struct FName MarkerName, float& OutMarkerTime); // Function Engine.AnimInstance.GetTimeToClosestMarker
	struct FMarkerSyncAnimPosition GetSyncGroupPosition(struct FName InSyncGroupName); // Function Engine.AnimInstance.GetSyncGroupPosition
	float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemainingFraction
	float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemaining
	float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeFraction
	float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTime
	float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimLength
	bool GetReceiveNotifiesFromLinkedInstances(); // Function Engine.AnimInstance.GetReceiveNotifiesFromLinkedInstances
	bool GetPropagateNotifiesToLinkedInstances(); // Function Engine.AnimInstance.GetPropagateNotifiesToLinkedInstances
	struct USkeletalMeshComponent* GetOwningComponent(); // Function Engine.AnimInstance.GetOwningComponent
	struct AActor* GetOwningActor(); // Function Engine.AnimInstance.GetOwningActor
	void GetLinkedAnimLayerInstancesByGroup(struct FName InGroup, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.AnimInstance.GetLinkedAnimLayerInstancesByGroup
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroupAndClass(struct FName InGroup, UAnimInstance* InClass); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroupAndClass
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroup
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(UAnimInstance* InClass); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByClass
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.AnimInstance.GetLinkedAnimGraphInstancesByTag
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.AnimInstance.GetLinkedAnimGraphInstanceByTag
	float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsedFraction
	float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsed
	float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration
	float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetInstanceStateWeight
	float GetInstanceMachineWeight(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceMachineWeight
	float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceCurrentStateElapsedTime
	float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEndFraction
	float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd
	float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFraction
	float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTime
	float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerLength
	float GetDeltaSeconds(); // Function Engine.AnimInstance.GetDeltaSeconds
	bool GetCurveValueWithDefault(struct FName CurveName, float DefaultValue, float& OutValue); // Function Engine.AnimInstance.GetCurveValueWithDefault
	float GetCurveValue(struct FName CurveName); // Function Engine.AnimInstance.GetCurveValue
	struct FName GetCurrentStateName(int32_t MachineIndex); // Function Engine.AnimInstance.GetCurrentStateName
	struct UAnimMontage* GetCurrentActiveMontage(); // Function Engine.AnimInstance.GetCurrentActiveMontage
	void GetAllCurveNames(struct TArray<struct FName>& OutNames); // Function Engine.AnimInstance.GetAllCurveNames
	void GetActiveCurveNames(uint8_t CurveType, struct TArray<struct FName>& OutNames); // Function Engine.AnimInstance.GetActiveCurveNames
	void ClearTransitionEvents(struct FName EventName); // Function Engine.AnimInstance.ClearTransitionEvents
	void ClearMorphTargets(); // Function Engine.AnimInstance.ClearMorphTargets
	void ClearAllTransitionEvents(); // Function Engine.AnimInstance.ClearAllTransitionEvents
	float CalculateDirection(struct FVector& Velocity, struct FRotator& BaseRotation); // Function Engine.AnimInstance.CalculateDirection
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Engine.AnimInstance.BlueprintUpdateAnimation
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function Engine.AnimInstance.BlueprintThreadSafeUpdateAnimation
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation
	void BlueprintLinkedAnimationLayersInitialized(); // Function Engine.AnimInstance.BlueprintLinkedAnimationLayersInitialized
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation
	void BlueprintBeginPlay(); // Function Engine.AnimInstance.BlueprintBeginPlay
}; 
 
 


// Class Engine.ParticleModuleAttractorPoint
// Size: 0xF8(Inherited: 0x30)
struct UParticleModuleAttractorPoint : UParticleModuleAttractorBase
{
	struct FRawDistributionVector Position;  // 0x30 (0x30)
	struct FRawDistributionFloat Range;  // 0x90 (0x90)
	struct FRawDistributionFloat Strength;  // 0xC0 (0xC0)
	char StrengthByDistance : 1;  // 0xF0 (0xF0)
	char bAffectBaseVelocity : 1;  // 0xF0 (0xF0)
	char bOverrideVelocity : 1;  // 0xF0 (0xF0)
	char bUseWorldSpacePosition : 1;  // 0xF0 (0xF0)
	char Positive_X : 1;  // 0xF0 (0xF0)
	char Positive_Y : 1;  // 0xF0 (0xF0)
	char Positive_Z : 1;  // 0xF0 (0xF0)
	char Negative_X : 1;  // 0xF0 (0xF0)
	char Negative_Y : 1;  // 0xF1 (0xF1)
	char Negative_Z : 1;  // 0xF1 (0xF1)
	char pad_241_1 : 6;  // 0xF1 (0xF1)
	char pad_242[7];  // 0xF2 (0xF2)


}; 
 
 


// Class Engine.CameraShakeBase
// Size: 0xF0(Inherited: 0x28)
struct UCameraShakeBase : UObject
{
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool bSingleInstance : 1;  // 0x28 (0x28)
	char pad_41[3];  // 0x29 (0x29)
	float ShakeScale;  // 0x2C (0x2C)
	struct UCameraShakePattern* RootShakePattern;  // 0x30 (0x30)
	struct APlayerCameraManager* CameraManager;  // 0x38 (0x38)
	char pad_64[176];  // 0x40 (0x40)


	void SetRootShakePattern(struct UCameraShakePattern* InPattern); // Function Engine.CameraShakeBase.SetRootShakePattern
	struct UCameraShakePattern* GetRootShakePattern(); // Function Engine.CameraShakeBase.GetRootShakePattern
}; 
 
 


// Class Engine.CameraShakePattern
// Size: 0x28(Inherited: 0x28)
struct UCameraShakePattern : UObject
{


}; 
 
 


// Class Engine.CameraModifier
// Size: 0x48(Inherited: 0x28)
struct UCameraModifier : UObject
{
	char bDebug : 1;  // 0x28 (0x28)
	char bExclusive : 1;  // 0x28 (0x28)
	char pad_40_1 : 6;  // 0x28 (0x28)
	char pad_41[4];  // 0x29 (0x29)
	char Priority;  // 0x2C (0x2C)
	char pad_45[3];  // 0x2D (0x2D)
	struct APlayerCameraManager* CameraOwner;  // 0x30 (0x30)
	float AlphaInTime;  // 0x38 (0x38)
	float AlphaOutTime;  // 0x3C (0x3C)
	float Alpha;  // 0x40 (0x40)
	char pad_68[4];  // 0x44 (0x44)


	void OnCameraOwnerDestroyed(struct AActor* InOwner); // Function Engine.CameraModifier.OnCameraOwnerDestroyed
	bool IsDisabled(); // Function Engine.CameraModifier.IsDisabled
	struct AActor* GetViewTarget(); // Function Engine.CameraModifier.GetViewTarget
	void EnableModifier(); // Function Engine.CameraModifier.EnableModifier
	void DisableModifier(bool bImmediate); // Function Engine.CameraModifier.DisableModifier
	void BlueprintModifyPostProcess(float DeltaTime, float& PostProcessBlendWeight, struct FPostProcessSettings& PostProcessSettings); // Function Engine.CameraModifier.BlueprintModifyPostProcess
	void BlueprintModifyCamera(float DeltaTime, struct FVector ViewLocation, struct FRotator ViewRotation, float FOV, struct FVector& NewViewLocation, struct FRotator& NewViewRotation, float& NewFOV); // Function Engine.CameraModifier.BlueprintModifyCamera
}; 
 
 


// Class Engine.Commandlet
// Size: 0x80(Inherited: 0x28)
struct UCommandlet : UObject
{
	struct FString HelpDescription;  // 0x28 (0x28)
	struct FString HelpUsage;  // 0x38 (0x38)
	struct FString HelpWebLink;  // 0x48 (0x48)
	struct TArray<struct FString> HelpParamNames;  // 0x58 (0x58)
	struct TArray<struct FString> HelpParamDescriptions;  // 0x68 (0x68)
	char IsServer : 1;  // 0x78 (0x78)
	char IsClient : 1;  // 0x78 (0x78)
	char IsEditor : 1;  // 0x78 (0x78)
	char LogToConsole : 1;  // 0x78 (0x78)
	char ShowErrorCount : 1;  // 0x78 (0x78)
	char ShowProgress : 1;  // 0x78 (0x78)
	char pad_120_1 : 2;  // 0x78 (0x78)
	char pad_121[8];  // 0x79 (0x79)


}; 
 
 


// Class Engine.AssetImportData
// Size: 0x28(Inherited: 0x28)
struct UAssetImportData : UObject
{


}; 
 
 


// Class Engine.AnimBlueprintClassSubsystem_PropertyAccess
// Size: 0x28(Inherited: 0x28)
struct UAnimBlueprintClassSubsystem_PropertyAccess : UObject
{


}; 
 
 


// Class Engine.LODSyncInterface
// Size: 0x28(Inherited: 0x28)
struct ULODSyncInterface : UInterface
{


}; 
 
 


// Class Engine.PhysicalAnimationComponent
// Size: 0xE0(Inherited: 0xA0)
struct UPhysicalAnimationComponent : UActorComponent
{
	float StrengthMultiplyer;  // 0xA0 (0xA0)
	char pad_164[4];  // 0xA4 (0xA4)
	struct USkeletalMeshComponent* SkeletalMeshComponent;  // 0xA8 (0xA8)
	char pad_176[48];  // 0xB0 (0xB0)


	void SetStrengthMultiplyer(float InStrengthMultiplyer); // Function Engine.PhysicalAnimationComponent.SetStrengthMultiplyer
	void SetSkeletalMeshComponent(struct USkeletalMeshComponent* InSkeletalMeshComponent); // Function Engine.PhysicalAnimationComponent.SetSkeletalMeshComponent
	struct FTransform GetBodyTargetTransform(struct FName BodyName); // Function Engine.PhysicalAnimationComponent.GetBodyTargetTransform
	void ApplyPhysicalAnimationSettingsBelow(struct FName BodyName, struct FPhysicalAnimationData& PhysicalAnimationData, bool bIncludeSelf); // Function Engine.PhysicalAnimationComponent.ApplyPhysicalAnimationSettingsBelow
	void ApplyPhysicalAnimationSettings(struct FName BodyName, struct FPhysicalAnimationData& PhysicalAnimationData); // Function Engine.PhysicalAnimationComponent.ApplyPhysicalAnimationSettings
	void ApplyPhysicalAnimationProfileBelow(struct FName BodyName, struct FName ProfileName, bool bIncludeSelf, bool bClearNotFound); // Function Engine.PhysicalAnimationComponent.ApplyPhysicalAnimationProfileBelow
}; 
 
 


// Class Engine.AssetUserData
// Size: 0x28(Inherited: 0x28)
struct UAssetUserData : UObject
{


}; 
 
 


// Class Engine.EdGraphNode
// Size: 0x98(Inherited: 0x28)
struct UEdGraphNode : UObject
{
	char pad_40[16];  // 0x28 (0x28)
	struct TArray<struct UEdGraphPin_Deprecated*> DeprecatedPins;  // 0x38 (0x38)
	int32_t NodePosX;  // 0x48 (0x48)
	int32_t NodePosY;  // 0x4C (0x4C)
	int32_t NodeWidth;  // 0x50 (0x50)
	int32_t NodeHeight;  // 0x54 (0x54)
	enum class ENodeAdvancedPins AdvancedPinDisplay;  // 0x58 (0x58)
	uint8_t EnabledState;  // 0x59 (0x59)
	char pad_90[1];  // 0x5A (0x5A)
	char pad_91_1 : 1;  // 0x5B (0x5B)
	char bDisplayAsDisabled : 1;  // 0x5B (0x5B)
	char bUserSetEnabledState : 1;  // 0x5B (0x5B)
	char bIsIntermediateNode : 1;  // 0x5B (0x5B)
	char bHasCompilerMessage : 1;  // 0x5B (0x5B)
	char pad_91_2 : 3;  // 0x5B (0x5B)
	char pad_92[5];  // 0x5C (0x5C)
	struct FString NodeComment;  // 0x60 (0x60)
	int32_t ErrorType;  // 0x70 (0x70)
	char pad_116[4];  // 0x74 (0x74)
	struct FString ErrorMsg;  // 0x78 (0x78)
	struct FGuid NodeGuid;  // 0x88 (0x88)


}; 
 
 


// Class Engine.PlayerStartPIE
// Size: 0x2C0(Inherited: 0x2C0)
struct APlayerStartPIE : APlayerStart
{


}; 
 
 


// Class Engine.MovementComponent
// Size: 0x108(Inherited: 0xA0)
struct UMovementComponent : UActorComponent
{
	struct USceneComponent* UpdatedComponent;  // 0xA0 (0xA0)
	struct UPrimitiveComponent* UpdatedPrimitive;  // 0xA8 (0xA8)
	char pad_176[8];  // 0xB0 (0xB0)
	struct FVector Velocity;  // 0xB8 (0xB8)
	struct FVector PlaneConstraintNormal;  // 0xD0 (0xD0)
	struct FVector PlaneConstraintOrigin;  // 0xE8 (0xE8)
	char bUpdateOnlyIfRendered : 1;  // 0x100 (0x100)
	char bAutoUpdateTickRegistration : 1;  // 0x100 (0x100)
	char bTickBeforeOwner : 1;  // 0x100 (0x100)
	char bAutoRegisterUpdatedComponent : 1;  // 0x100 (0x100)
	char bConstrainToPlane : 1;  // 0x100 (0x100)
	char bSnapToPlaneAtStart : 1;  // 0x100 (0x100)
	char bAutoRegisterPhysicsVolumeUpdates : 1;  // 0x100 (0x100)
	char bComponentShouldUpdatePhysicsVolume : 1;  // 0x100 (0x100)
	char pad_257[2];  // 0x101 (0x101)
	uint8_t PlaneConstraintAxisSetting;  // 0x103 (0x103)
	char pad_260[4];  // 0x104 (0x104)


	void StopMovementImmediately(); // Function Engine.MovementComponent.StopMovementImmediately
	void SnapUpdatedComponentToPlane(); // Function Engine.MovementComponent.SnapUpdatedComponentToPlane
	void SetUpdatedComponent(struct USceneComponent* NewUpdatedComponent); // Function Engine.MovementComponent.SetUpdatedComponent
	void SetPlaneConstraintOrigin(struct FVector PlaneOrigin); // Function Engine.MovementComponent.SetPlaneConstraintOrigin
	void SetPlaneConstraintNormal(struct FVector PlaneNormal); // Function Engine.MovementComponent.SetPlaneConstraintNormal
	void SetPlaneConstraintFromVectors(struct FVector Forward, struct FVector Up); // Function Engine.MovementComponent.SetPlaneConstraintFromVectors
	void SetPlaneConstraintEnabled(bool bEnabled); // Function Engine.MovementComponent.SetPlaneConstraintEnabled
	void SetPlaneConstraintAxisSetting(uint8_t NewAxisSetting); // Function Engine.MovementComponent.SetPlaneConstraintAxisSetting
	void PhysicsVolumeChanged(struct APhysicsVolume* NewVolume); // Function Engine.MovementComponent.PhysicsVolumeChanged
	bool K2_MoveUpdatedComponent(struct FVector Delta, struct FRotator NewRotation, struct FHitResult& OutHit, bool bSweep, bool bTeleport); // Function Engine.MovementComponent.K2_MoveUpdatedComponent
	bool IsExceedingMaxSpeed(float MaxSpeed); // Function Engine.MovementComponent.IsExceedingMaxSpeed
	struct FVector GetPlaneConstraintOrigin(); // Function Engine.MovementComponent.GetPlaneConstraintOrigin
	struct FVector GetPlaneConstraintNormal(); // Function Engine.MovementComponent.GetPlaneConstraintNormal
	uint8_t GetPlaneConstraintAxisSetting(); // Function Engine.MovementComponent.GetPlaneConstraintAxisSetting
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.MovementComponent.GetPhysicsVolume
	float GetMaxSpeed(); // Function Engine.MovementComponent.GetMaxSpeed
	float GetGravityZ(); // Function Engine.MovementComponent.GetGravityZ
	struct FVector ConstrainNormalToPlane(struct FVector Normal); // Function Engine.MovementComponent.ConstrainNormalToPlane
	struct FVector ConstrainLocationToPlane(struct FVector Location); // Function Engine.MovementComponent.ConstrainLocationToPlane
	struct FVector ConstrainDirectionToPlane(struct FVector Direction); // Function Engine.MovementComponent.ConstrainDirectionToPlane
}; 
 
 


// Class Engine.MaterialExpressionNaniteReplace
// Size: 0x100(Inherited: 0xB0)
struct UMaterialExpressionNaniteReplace : UMaterialExpression
{
	struct FExpressionInput Default;  // 0xB0 (0xB0)
	struct FExpressionInput Nanite;  // 0xD8 (0xD8)


}; 
 
 


// Class Engine.ReflectionCaptureComponent
// Size: 0x310(Inherited: 0x2A0)
struct UReflectionCaptureComponent : USceneComponent
{
	struct UBillboardComponent* CaptureOffsetComponent;  // 0x2A0 (0x2A0)
	uint8_t ReflectionSourceType;  // 0x2A8 (0x2A8)
	char pad_681[7];  // 0x2A9 (0x2A9)
	struct UTextureCube* Cubemap;  // 0x2B0 (0x2B0)
	float SourceCubemapAngle;  // 0x2B8 (0x2B8)
	float Brightness;  // 0x2BC (0x2BC)
	struct FVector CaptureOffset;  // 0x2C0 (0x2C0)
	struct FGuid MapBuildDataId;  // 0x2D8 (0x2D8)
	char pad_744[40];  // 0x2E8 (0x2E8)


}; 
 
 


// Class Engine.NavMovementComponent
// Size: 0x150(Inherited: 0x108)
struct UNavMovementComponent : UMovementComponent
{
	struct FNavAgentProperties NavAgentProps;  // 0x108 (0x108)
	float FixedPathBrakingDistance;  // 0x140 (0x140)
	char bUpdateNavAgentWithOwnersCollision : 1;  // 0x144 (0x144)
	char bUseAccelerationForPaths : 1;  // 0x144 (0x144)
	char bUseFixedBrakingDistanceForPaths : 1;  // 0x144 (0x144)
	char pad_324_1 : 5;  // 0x144 (0x144)
	struct FMovementProperties MovementState;  // 0x145 (0x145)
	char pad_326[2];  // 0x146 (0x146)
	struct UObject* PathFollowingComp;  // 0x148 (0x148)


	void StopMovementKeepPathing(); // Function Engine.NavMovementComponent.StopMovementKeepPathing
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement
	bool IsSwimming(); // Function Engine.NavMovementComponent.IsSwimming
	bool IsMovingOnGround(); // Function Engine.NavMovementComponent.IsMovingOnGround
	bool IsFlying(); // Function Engine.NavMovementComponent.IsFlying
	bool IsFalling(); // Function Engine.NavMovementComponent.IsFalling
	bool IsCrouching(); // Function Engine.NavMovementComponent.IsCrouching
}; 
 
 


// Class Engine.RPCDoSDetectionConfig
// Size: 0x88(Inherited: 0x28)
struct URPCDoSDetectionConfig : UObject
{
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool bRPCDoSDetection : 1;  // 0x28 (0x28)
	char pad_41_1 : 7;  // 0x29 (0x29)
	bool bRPCDoSAnalytics : 1;  // 0x29 (0x29)
	char pad_42[2];  // 0x2A (0x2A)
	int32_t HitchTimeQuotaMS;  // 0x2C (0x2C)
	int32_t HitchSuspendDetectionTimeMS;  // 0x30 (0x30)
	char pad_52[4];  // 0x34 (0x34)
	struct TArray<struct FString> DetectionSeverity;  // 0x38 (0x38)
	int32_t InitialConnectToleranceMS;  // 0x48 (0x48)
	char pad_76[4];  // 0x4C (0x4C)
	struct TArray<struct FName> RPCBlockWhitelist;  // 0x50 (0x50)
	struct TArray<struct FName> RPCBlockAllowlist;  // 0x60 (0x60)
	struct TArray<struct FRPCAnalyticsThreshold> RPCAnalyticsThresholds;  // 0x70 (0x70)
	double RPCAnalyticsOverrideChance;  // 0x80 (0x80)


}; 
 
 


// Class Engine.MaterialExpressionVectorNoise
// Size: 0xE8(Inherited: 0xB0)
struct UMaterialExpressionVectorNoise : UMaterialExpression
{
	struct FExpressionInput Position;  // 0xB0 (0xB0)
	enum class EVectorNoiseFunction NoiseFunction;  // 0xD8 (0xD8)
	char pad_217[3];  // 0xD9 (0xD9)
	int32_t Quality;  // 0xDC (0xDC)
	char bTiling : 1;  // 0xE0 (0xE0)
	char pad_224_1 : 7;  // 0xE0 (0xE0)
	char pad_225[4];  // 0xE1 (0xE1)
	uint32_t TileSize;  // 0xE4 (0xE4)


}; 
 
 


// Class Engine.PawnMovementComponent
// Size: 0x158(Inherited: 0x150)
struct UPawnMovementComponent : UNavMovementComponent
{
	struct APawn* PawnOwner;  // 0x150 (0x150)


	bool IsMoveInputIgnored(); // Function Engine.PawnMovementComponent.IsMoveInputIgnored
	struct FVector GetPendingInputVector(); // Function Engine.PawnMovementComponent.GetPendingInputVector
	struct APawn* GetPawnOwner(); // Function Engine.PawnMovementComponent.GetPawnOwner
	struct FVector GetLastInputVector(); // Function Engine.PawnMovementComponent.GetLastInputVector
	struct FVector ConsumeInputVector(); // Function Engine.PawnMovementComponent.ConsumeInputVector
	void AddInputVector(struct FVector WorldVector, bool bForce); // Function Engine.PawnMovementComponent.AddInputVector
}; 
 
 


// Class Engine.SplineMeshComponent
// Size: 0x6F0(Inherited: 0x5F0)
struct USplineMeshComponent : UStaticMeshComponent
{
	char pad_1520[8];  // 0x5F0 (0x5F0)
	struct FSplineMeshParams SplineParams;  // 0x5F8 (0x5F8)
	struct FVector SplineUpDir;  // 0x6A8 (0x6A8)
	float SplineBoundaryMin;  // 0x6C0 (0x6C0)
	struct FGuid CachedMeshBodySetupGuid;  // 0x6C4 (0x6C4)
	char pad_1748[4];  // 0x6D4 (0x6D4)
	struct UBodySetup* BodySetup;  // 0x6D8 (0x6D8)
	float SplineBoundaryMax;  // 0x6E0 (0x6E0)
	char bAllowSplineEditingPerInstance : 1;  // 0x6E4 (0x6E4)
	char bSmoothInterpRollScale : 1;  // 0x6E4 (0x6E4)
	char bMeshDirty : 1;  // 0x6E4 (0x6E4)
	char pad_1764_1 : 5;  // 0x6E4 (0x6E4)
	enum class ESplineMeshAxis ForwardAxis;  // 0x6E5 (0x6E5)
	char pad_1766[2];  // 0x6E6 (0x6E6)
	float VirtualTextureMainPassMaxDrawDistance;  // 0x6E8 (0x6E8)
	char pad_1772[4];  // 0x6EC (0x6EC)


	void UpdateMesh(); // Function Engine.SplineMeshComponent.UpdateMesh
	void SetStartTangent(struct FVector StartTangent, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartTangent
	void SetStartScale(struct FVector2D StartScale, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartScale
	void SetStartRoll(float StartRoll, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartRoll
	void SetStartPosition(struct FVector StartPos, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartPosition
	void SetStartOffset(struct FVector2D StartOffset, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartOffset
	void SetStartAndEnd(struct FVector StartPos, struct FVector StartTangent, struct FVector EndPos, struct FVector EndTangent, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetStartAndEnd
	void SetSplineUpDir(struct FVector& InSplineUpDir, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetSplineUpDir
	void SetForwardAxis(enum class ESplineMeshAxis InForwardAxis, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetForwardAxis
	void SetEndTangent(struct FVector EndTangent, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndTangent
	void SetEndScale(struct FVector2D EndScale, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndScale
	void SetEndRoll(float EndRoll, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndRoll
	void SetEndPosition(struct FVector EndPos, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndPosition
	void SetEndOffset(struct FVector2D EndOffset, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetEndOffset
	void SetBoundaryMin(float InBoundaryMin, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetBoundaryMin
	void SetBoundaryMax(float InBoundaryMax, bool bUpdateMesh); // Function Engine.SplineMeshComponent.SetBoundaryMax
	struct FVector GetStartTangent(); // Function Engine.SplineMeshComponent.GetStartTangent
	struct FVector2D GetStartScale(); // Function Engine.SplineMeshComponent.GetStartScale
	float GetStartRoll(); // Function Engine.SplineMeshComponent.GetStartRoll
	struct FVector GetStartPosition(); // Function Engine.SplineMeshComponent.GetStartPosition
	struct FVector2D GetStartOffset(); // Function Engine.SplineMeshComponent.GetStartOffset
	struct FVector GetSplineUpDir(); // Function Engine.SplineMeshComponent.GetSplineUpDir
	enum class ESplineMeshAxis GetForwardAxis(); // Function Engine.SplineMeshComponent.GetForwardAxis
	struct FVector GetEndTangent(); // Function Engine.SplineMeshComponent.GetEndTangent
	struct FVector2D GetEndScale(); // Function Engine.SplineMeshComponent.GetEndScale
	float GetEndRoll(); // Function Engine.SplineMeshComponent.GetEndRoll
	struct FVector GetEndPosition(); // Function Engine.SplineMeshComponent.GetEndPosition
	struct FVector2D GetEndOffset(); // Function Engine.SplineMeshComponent.GetEndOffset
	float GetBoundaryMin(); // Function Engine.SplineMeshComponent.GetBoundaryMin
	float GetBoundaryMax(); // Function Engine.SplineMeshComponent.GetBoundaryMax
}; 
 
 


// Class Engine.CharacterMovementComponent
// Size: 0xF00(Inherited: 0x158)
struct UCharacterMovementComponent : UPawnMovementComponent
{
	char pad_344[16];  // 0x158 (0x158)
	struct ACharacter* CharacterOwner;  // 0x168 (0x168)
	float GravityScale;  // 0x170 (0x170)
	float MaxStepHeight;  // 0x174 (0x174)
	float JumpZVelocity;  // 0x178 (0x178)
	float JumpOffJumpZFactor;  // 0x17C (0x17C)
	char pad_384[28];  // 0x180 (0x180)
	float WalkableFloorAngle;  // 0x19C (0x19C)
	float WalkableFloorZ;  // 0x1A0 (0x1A0)
	enum class EMovementMode MovementMode;  // 0x1A4 (0x1A4)
	char CustomMovementMode;  // 0x1A5 (0x1A5)
	uint8_t NetworkSmoothingMode;  // 0x1A6 (0x1A6)
	char pad_423[1];  // 0x1A7 (0x1A7)
	float GroundFriction;  // 0x1A8 (0x1A8)
	char pad_428[60];  // 0x1AC (0x1AC)
	float MaxWalkSpeed;  // 0x1E8 (0x1E8)
	float MaxWalkSpeedCrouched;  // 0x1EC (0x1EC)
	float MaxSwimSpeed;  // 0x1F0 (0x1F0)
	float MaxFlySpeed;  // 0x1F4 (0x1F4)
	float MaxCustomMovementSpeed;  // 0x1F8 (0x1F8)
	float MaxAcceleration;  // 0x1FC (0x1FC)
	float MinAnalogWalkSpeed;  // 0x200 (0x200)
	float BrakingFrictionFactor;  // 0x204 (0x204)
	float BrakingFriction;  // 0x208 (0x208)
	float BrakingSubStepTime;  // 0x20C (0x20C)
	float BrakingDecelerationWalking;  // 0x210 (0x210)
	float BrakingDecelerationFalling;  // 0x214 (0x214)
	float BrakingDecelerationSwimming;  // 0x218 (0x218)
	float BrakingDecelerationFlying;  // 0x21C (0x21C)
	float AirControl;  // 0x220 (0x220)
	float AirControlBoostMultiplier;  // 0x224 (0x224)
	float AirControlBoostVelocityThreshold;  // 0x228 (0x228)
	float FallingLateralFriction;  // 0x22C (0x22C)
	float CrouchedHalfHeight;  // 0x230 (0x230)
	float Buoyancy;  // 0x234 (0x234)
	float PerchRadiusThreshold;  // 0x238 (0x238)
	float PerchAdditionalHeight;  // 0x23C (0x23C)
	struct FRotator RotationRate;  // 0x240 (0x240)
	char bUseSeparateBrakingFriction : 1;  // 0x258 (0x258)
	char bApplyGravityWhileJumping : 1;  // 0x258 (0x258)
	char bUseControllerDesiredRotation : 1;  // 0x258 (0x258)
	char bOrientRotationToMovement : 1;  // 0x258 (0x258)
	char bSweepWhileNavWalking : 1;  // 0x258 (0x258)
	char pad_600_1 : 1;  // 0x258 (0x258)
	char bMovementInProgress : 1;  // 0x258 (0x258)
	char bEnableScopedMovementUpdates : 1;  // 0x258 (0x258)
	char bEnableServerDualMoveScopedMovementUpdates : 1;  // 0x259 (0x259)
	char bForceMaxAccel : 1;  // 0x259 (0x259)
	char bRunPhysicsWithNoController : 1;  // 0x259 (0x259)
	char bForceNextFloorCheck : 1;  // 0x259 (0x259)
	char bShrinkProxyCapsule : 1;  // 0x259 (0x259)
	char bCanWalkOffLedges : 1;  // 0x259 (0x259)
	char bCanWalkOffLedgesWhenCrouching : 1;  // 0x259 (0x259)
	char pad_601_1 : 1;  // 0x259 (0x259)
	char pad_602_1 : 1;  // 0x25A (0x25A)
	char bNetworkSkipProxyPredictionOnNetUpdate : 1;  // 0x25A (0x25A)
	char bNetworkAlwaysReplicateTransformUpdateTimestamp : 1;  // 0x25A (0x25A)
	char bDeferUpdateMoveComponent : 1;  // 0x25A (0x25A)
	char bEnablePhysicsInteraction : 1;  // 0x25A (0x25A)
	char bTouchForceScaledToMass : 1;  // 0x25A (0x25A)
	char bPushForceScaledToMass : 1;  // 0x25A (0x25A)
	char bPushForceUsingZOffset : 1;  // 0x25A (0x25A)
	char bScalePushForceToVelocity : 1;  // 0x25B (0x25B)
	char pad_603_1 : 7;  // 0x25B (0x25B)
	char pad_604[5];  // 0x25C (0x25C)
	struct USceneComponent* DeferredUpdatedMoveComponent;  // 0x260 (0x260)
	float MaxOutOfWaterStepHeight;  // 0x268 (0x268)
	float OutofWaterZ;  // 0x26C (0x26C)
	float Mass;  // 0x270 (0x270)
	float StandingDownwardForceScale;  // 0x274 (0x274)
	float InitialPushForceFactor;  // 0x278 (0x278)
	float PushForceFactor;  // 0x27C (0x27C)
	float PushForcePointZOffsetFactor;  // 0x280 (0x280)
	float TouchForceFactor;  // 0x284 (0x284)
	float MinTouchForce;  // 0x288 (0x288)
	float MaxTouchForce;  // 0x28C (0x28C)
	float RepulsionForce;  // 0x290 (0x290)
	char pad_660[4];  // 0x294 (0x294)
	struct FVector Acceleration;  // 0x298 (0x298)
	struct FQuat LastUpdateRotation;  // 0x2B0 (0x2B0)
	struct FVector LastUpdateLocation;  // 0x2D0 (0x2D0)
	struct FVector LastUpdateVelocity;  // 0x2E8 (0x2E8)
	float ServerLastTransformUpdateTimeStamp;  // 0x300 (0x300)
	float ServerLastClientGoodMoveAckTime;  // 0x304 (0x304)
	float ServerLastClientAdjustmentTime;  // 0x308 (0x308)
	char pad_780[4];  // 0x30C (0x30C)
	struct FVector PendingImpulseToApply;  // 0x310 (0x310)
	struct FVector PendingForceToApply;  // 0x328 (0x328)
	float AnalogInputModifier;  // 0x340 (0x340)
	char pad_836[12];  // 0x344 (0x344)
	float MaxSimulationTimeStep;  // 0x350 (0x350)
	int32_t MaxSimulationIterations;  // 0x354 (0x354)
	int32_t MaxJumpApexAttemptsPerSimulation;  // 0x358 (0x358)
	float MaxDepenetrationWithGeometry;  // 0x35C (0x35C)
	float MaxDepenetrationWithGeometryAsProxy;  // 0x360 (0x360)
	float MaxDepenetrationWithPawn;  // 0x364 (0x364)
	float MaxDepenetrationWithPawnAsProxy;  // 0x368 (0x368)
	float NetworkSimulatedSmoothLocationTime;  // 0x36C (0x36C)
	float NetworkSimulatedSmoothRotationTime;  // 0x370 (0x370)
	float ListenServerNetworkSimulatedSmoothLocationTime;  // 0x374 (0x374)
	float ListenServerNetworkSimulatedSmoothRotationTime;  // 0x378 (0x378)
	float NetProxyShrinkRadius;  // 0x37C (0x37C)
	float NetProxyShrinkHalfHeight;  // 0x380 (0x380)
	float NetworkMaxSmoothUpdateDistance;  // 0x384 (0x384)
	float NetworkNoSmoothUpdateDistance;  // 0x388 (0x388)
	float NetworkMinTimeBetweenClientAckGoodMoves;  // 0x38C (0x38C)
	float NetworkMinTimeBetweenClientAdjustments;  // 0x390 (0x390)
	float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection;  // 0x394 (0x394)
