#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_AoeCallerAtLocation.GA_AoeCallerAtLocation_C.ExecuteUbergraph_GA_AoeCallerAtLocation
struct FExecuteUbergraph_GA_AoeCallerAtLocation
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	struct FGameplayEventData Temp_struct_Variable;  // 0x10 (0x10)
	char pad_192_1 : 7;  // 0xC0 (0xC0)
	bool K2Node_Event_bWasCancelled : 1;  // 0xC0 (0xC0)
	char pad_193[7];  // 0xC1 (0xC1)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0xC8 (0xC8)
	struct ADCCharacterBase* K2Node_DynamicCast_AsDCCharacter_Base;  // 0xD0 (0xD0)
	char pad_216_1 : 7;  // 0xD8 (0xD8)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0xD8 (0xD8)
	char pad_217[3];  // 0xD9 (0xD9)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0xDC (0xDC)
	char pad_224_1 : 7;  // 0xE0 (0xE0)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0xE0 (0xE0)
	char pad_225_1 : 7;  // 0xE1 (0xE1)
	bool CallFunc_EqualEqual_DoubleDouble_ReturnValue : 1;  // 0xE1 (0xE1)
	char pad_226[2];  // 0xE2 (0xE2)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0xE4 (0xE4)
	char pad_244[4];  // 0xF4 (0xF4)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue;  // 0xF8 (0xF8)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x100 (0x100)
	char pad_260[4];  // 0x104 (0x104)
	struct FVector CallFunc_Array_Get_Item;  // 0x108 (0x108)
	char pad_288_1 : 7;  // 0x120 (0x120)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x120 (0x120)
	char pad_289[7];  // 0x121 (0x121)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3;  // 0x128 (0x128)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x130 (0x130)
	char pad_480_1 : 7;  // 0x1E0 (0x1E0)
	bool CallFunc_NotEqual_DoubleDouble_ReturnValue : 1;  // 0x1E0 (0x1E0)
	char pad_481_1 : 7;  // 0x1E1 (0x1E1)
	bool CallFunc_SpawnAoeFromTarget_Cast_Bool : 1;  // 0x1E1 (0x1E1)
	char pad_482[6];  // 0x1E2 (0x1E2)
	struct ADCAoeBase* CallFunc_SpawnAoeFromTarget_ReturnValue;  // 0x1E8 (0x1E8)
	struct ADCAoeBase* CallFunc_SpawnAoeFromSelf_Return_Value;  // 0x1F0 (0x1F0)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x1F8 (0x1F8)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue_2;  // 0x208 (0x208)
	float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;  // 0x210 (0x210)
	float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2;  // 0x214 (0x214)


}; 
 
 // Function GA_AoeCallerAtLocation.GA_AoeCallerAtLocation_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 