#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_ChoraleOfClarityGranted.GA_ChoraleOfClarityGranted_C.OnPerformAction_C8B6EBF246016F8671F1C59CA8233EB0
struct FOnPerformAction_C8B6EBF246016F8671F1C59CA8233EB0
{
	int32_t ActionNumber;  // 0x0 (0x0)


}; 
 
 // Function GA_ChoraleOfClarityGranted.GA_ChoraleOfClarityGranted_C.ExecuteUbergraph_GA_ChoraleOfClarityGranted
struct FExecuteUbergraph_GA_ChoraleOfClarityGranted
{
	int32_t EntryPoint;  // 0x0 (0x0)
	float CallFunc_GetConstantFloat_ReturnValue;  // 0x4 (0x4)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x8 (0x8)
	struct UAbilityTask_Repeat* CallFunc_RepeatAction_ReturnValue;  // 0x18 (0x18)
	int32_t K2Node_CustomEvent_ActionNumber_2;  // 0x20 (0x20)
	char pad_36_1 : 7;  // 0x24 (0x24)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x24 (0x24)
	char pad_37[3];  // 0x25 (0x25)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x28 (0x28)
	int32_t K2Node_CustomEvent_ActionNumber;  // 0x38 (0x38)
	int32_t Temp_int_Variable;  // 0x3C (0x3C)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x40 (0x40)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0xF0 (0xF0)
	struct TScriptInterface<IBaseInterface> K2Node_DynamicCast_AsBase_Interface;  // 0xF8 (0xF8)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x108 (0x108)
	char pad_265[3];  // 0x109 (0x109)
	int32_t CallFunc_GetConstantInt32_ReturnValue;  // 0x10C (0x10C)
	struct FMsgSpellRecharge K2Node_MakeStruct_MsgSpellRecharge;  // 0x110 (0x110)


}; 
 
 // Function GA_ChoraleOfClarityGranted.GA_ChoraleOfClarityGranted_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 // Function GA_ChoraleOfClarityGranted.GA_ChoraleOfClarityGranted_C.OnFinished_C8B6EBF246016F8671F1C59CA8233EB0
struct FOnFinished_C8B6EBF246016F8671F1C59CA8233EB0
{
	int32_t ActionNumber;  // 0x0 (0x0)


}; 
 
 