#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_Cockatrice_AttackPhase.GA_Cockatrice_AttackPhase_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 // Function GA_Cockatrice_AttackPhase.GA_Cockatrice_AttackPhase_C.EventReceived_3E8A8A9D4693B83B5F23F6BD4C5A0570
struct FEventReceived_3E8A8A9D4693B83B5F23F6BD4C5A0570
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_Cockatrice_AttackPhase.GA_Cockatrice_AttackPhase_C.ExecuteUbergraph_GA_Cockatrice_AttackPhase
struct FExecuteUbergraph_GA_Cockatrice_AttackPhase
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	double CallFunc_RandomFloatInRange_ReturnValue;  // 0x8 (0x8)
	struct FGameplayEventData Temp_struct_Variable;  // 0x10 (0x10)
	char pad_192_1 : 7;  // 0xC0 (0xC0)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue : 1;  // 0xC0 (0xC0)
	char pad_193[7];  // 0xC1 (0xC1)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0xC8 (0xC8)
	char pad_208_1 : 7;  // 0xD0 (0xD0)
	bool CallFunc_InRange_FloatFloat_ReturnValue : 1;  // 0xD0 (0xD0)
	char pad_209_1 : 7;  // 0xD1 (0xD1)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0xD1 (0xD1)
	char pad_210_1 : 7;  // 0xD2 (0xD2)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0xD2 (0xD2)
	char pad_211[5];  // 0xD3 (0xD3)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0xD8 (0xD8)
	double CallFunc_RandomFloatInRange_ReturnValue_2;  // 0x188 (0x188)
	char pad_400_1 : 7;  // 0x190 (0x190)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue_2 : 1;  // 0x190 (0x190)
	char pad_401_1 : 7;  // 0x191 (0x191)
	bool CallFunc_InRange_FloatFloat_ReturnValue_2 : 1;  // 0x191 (0x191)
	char pad_402_1 : 7;  // 0x192 (0x192)
	bool CallFunc_BooleanAND_ReturnValue_2 : 1;  // 0x192 (0x192)
	char pad_403[1];  // 0x193 (0x193)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x194 (0x194)
	char pad_420[4];  // 0x1A4 (0x1A4)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x1A8 (0x1A8)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x258 (0x258)
	char pad_608_1 : 7;  // 0x260 (0x260)
	bool CallFunc_Get_Enemies_In_Range_And_Angle_Result : 1;  // 0x260 (0x260)
	char pad_609[7];  // 0x261 (0x261)
	struct TArray<struct ADCCharacterBase*> CallFunc_Get_Enemies_In_Range_And_Angle_DCCharacterBase;  // 0x268 (0x268)


}; 
 
 