#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_ClarityPotionConsumeGranted.GA_ClarityPotionConsumeGranted_C.ExecuteUbergraph_GA_ClarityPotionConsumeGranted
struct FExecuteUbergraph_GA_ClarityPotionConsumeGranted
{
	int32_t EntryPoint;  // 0x0 (0x0)
	float CallFunc_GetConstantFloat_ReturnValue;  // 0x4 (0x4)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x8 (0x8)
	struct UAbilityTask_Repeat* CallFunc_RepeatAction_ReturnValue;  // 0x18 (0x18)
	int32_t K2Node_CustomEvent_ActionNumber_2;  // 0x20 (0x20)
	char pad_36_1 : 7;  // 0x24 (0x24)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x24 (0x24)
	char pad_37[3];  // 0x25 (0x25)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x28 (0x28)
	int32_t K2Node_CustomEvent_ActionNumber;  // 0x38 (0x38)
	int32_t Temp_int_Variable;  // 0x3C (0x3C)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x40 (0x40)
	struct TScriptInterface<IBaseInterface> K2Node_DynamicCast_AsBase_Interface;  // 0x48 (0x48)
	char pad_88_1 : 7;  // 0x58 (0x58)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x58 (0x58)
	char pad_89[3];  // 0x59 (0x59)
	int32_t CallFunc_GetConstantInt32_ReturnValue;  // 0x5C (0x5C)
	struct FMsgSpellRecharge K2Node_MakeStruct_MsgSpellRecharge;  // 0x60 (0x60)


}; 
 
 // Function GA_ClarityPotionConsumeGranted.GA_ClarityPotionConsumeGranted_C.OnFinished_58D70B5D48ED8FE1457C9690A8734640
struct FOnFinished_58D70B5D48ED8FE1457C9690A8734640
{
	int32_t ActionNumber;  // 0x0 (0x0)


}; 
 
 // Function GA_ClarityPotionConsumeGranted.GA_ClarityPotionConsumeGranted_C.OnPerformAction_58D70B5D48ED8FE1457C9690A8734640
struct FOnPerformAction_58D70B5D48ED8FE1457C9690A8734640
{
	int32_t ActionNumber;  // 0x0 (0x0)


}; 
 
 