#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_CentaurDemon_AttackPhase.GA_CentaurDemon_AttackPhase_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 // Function GA_CentaurDemon_AttackPhase.GA_CentaurDemon_AttackPhase_C.EventReceived_087B9FCC4E4BA99C75BE66A78906D184
struct FEventReceived_087B9FCC4E4BA99C75BE66A78906D184
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_CentaurDemon_AttackPhase.GA_CentaurDemon_AttackPhase_C.ExecuteUbergraph_GA_CentaurDemon_AttackPhase
struct FExecuteUbergraph_GA_CentaurDemon_AttackPhase
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	double CallFunc_RandomFloatInRange_ReturnValue;  // 0x8 (0x8)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0x10 (0x10)
	char pad_192_1 : 7;  // 0x7FF7D35967D0 (0x1705D6E0080) (0x7FF7D35967D0 (0x1705D6E0080))
	bool CallFunc_Greater_DoubleDouble_ReturnValue : 1;  // 0xC0 (0xC0)
	char pad_193[7];  // 0xC1 (0xC1)
	struct FGameplayEventData Temp_struct_Variable;  // 0xC8 (0xC8)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0x178 (0x178)
	char pad_384_1 : 7;  // 0x180 (0x180)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x180 (0x180)
	char pad_385[7];  // 0x181 (0x181)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x188 (0x188)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x238 (0x238)


}; 
 
 