#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_DireWolf_AttackPhase.GA_DireWolf_AttackPhase_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 // Function GA_DireWolf_AttackPhase.GA_DireWolf_AttackPhase_C.EventReceived_C02C1D3A4BD8CCC6936B0BA2AF3A53AA
struct FEventReceived_C02C1D3A4BD8CCC6936B0BA2AF3A53AA
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_DireWolf_AttackPhase.GA_DireWolf_AttackPhase_C.ExecuteUbergraph_GA_DireWolf_AttackPhase
struct FExecuteUbergraph_GA_DireWolf_AttackPhase
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FGameplayEventData Temp_struct_Variable;  // 0x8 (0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0xB8 (0xB8)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0xC8 (0xC8)
	double CallFunc_RandomFloatInRange_ReturnValue;  // 0xD0 (0xD0)
	char pad_216_1 : 7;  // 0xD8 (0xD8)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue : 1;  // 0xD8 (0xD8)
	char pad_217_1 : 7;  // 0xD9 (0xD9)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0xD9 (0xD9)
	char pad_218[6];  // 0xDA (0xDA)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0xE0 (0xE0)
	char pad_400_1 : 7;  // 0x190 (0x190)
	bool CallFunc_InRange_FloatFloat_ReturnValue : 1;  // 0x190 (0x190)
	char pad_401_1 : 7;  // 0x191 (0x191)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0x191 (0x191)
	char pad_402[6];  // 0x192 (0x192)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x198 (0x198)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x248 (0x248)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0x250 (0x250)
	char pad_600_1 : 7;  // 0x258 (0x258)
	bool CallFunc_Get_Enemies_In_Range_And_Angle_Result : 1;  // 0x258 (0x258)
	char pad_601[7];  // 0x259 (0x259)
	struct TArray<struct ADCCharacterBase*> CallFunc_Get_Enemies_In_Range_And_Angle_DCCharacterBase;  // 0x260 (0x260)
	char pad_624_1 : 7;  // 0x270 (0x270)
	bool CallFunc_Get_Enemies_In_Range_And_Angle_Result_2 : 1;  // 0x270 (0x270)
	char pad_625[7];  // 0x271 (0x271)
	struct TArray<struct ADCCharacterBase*> CallFunc_Get_Enemies_In_Range_And_Angle_DCCharacterBase_2;  // 0x278 (0x278)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3;  // 0x288 (0x288)
	char pad_656_1 : 7;  // 0x290 (0x290)
	bool CallFunc_Get_Enemies_In_Range_And_Angle_Result_3 : 1;  // 0x290 (0x290)
	char pad_657[7];  // 0x291 (0x291)
	struct TArray<struct ADCCharacterBase*> CallFunc_Get_Enemies_In_Range_And_Angle_DCCharacterBase_3;  // 0x298 (0x298)


}; 
 
 