#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_DemonBat_Attack.GA_DemonBat_Attack_C.ServerTargetDataReceived
// Size: 0xC0(Inherited: 0xC0)
struct FServerTargetDataReceived : FServerTargetDataReceived
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayTag InChannelTag;  // 0x8 (0x8)
	struct FGameplayEventData EventData;  // 0x10 (0x10)


}; 
 
 // Function GA_DemonBat_Attack.GA_DemonBat_Attack_C.ExecuteUbergraph_GA_DemonBat_Attack
struct FExecuteUbergraph_GA_DemonBat_Attack
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FGameplayTag K2Node_Event_EventTag;  // 0x4 (0x4)
	struct FGameplayTag K2Node_Event_InChannelTag;  // 0xC (0xC)
	char pad_20[4];  // 0x14 (0x14)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x18 (0x18)


}; 
 
 