#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_DrinkPotionActivateBase.GA_DrinkPotionActivateBase_C.ExecuteUbergraph_GA_DrinkPotionActivateBase
struct FExecuteUbergraph_GA_DrinkPotionActivateBase
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x4 (0x4)
	char pad_20[4];  // 0x14 (0x14)
	struct UAbilityTask_WaitDelay* CallFunc_WaitDelay_ReturnValue;  // 0x18 (0x18)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x20 (0x20)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)
	struct UAbilityTask_WaitGameplayTagRemoved* CallFunc_WaitGameplayTagRemove_ReturnValue;  // 0x38 (0x38)
	char pad_64_1 : 7;  // 0x40 (0x40)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x40 (0x40)


}; 
 
 