#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_DireWolf_Death.GA_DireWolf_Death_C.ExecuteUbergraph_GA_DireWolf_Death
struct FExecuteUbergraph_GA_DireWolf_Death
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_AddGameplayTag_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool CallFunc_AddGameplayTag_ReturnValue_2 : 1;  // 0x11 (0x11)
	char pad_18[6];  // 0x12 (0x12)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x18 (0x18)
	int32_t CallFunc_RandomInteger_ReturnValue;  // 0xC8 (0xC8)
	char pad_204_1 : 7;  // 0xCC (0xCC)
	bool K2Node_SwitchInteger_CmpSuccess : 1;  // 0xCC (0xCC)


}; 
 
 // Function GA_DireWolf_Death.GA_DireWolf_Death_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 