#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_DarkReflection.GA_DarkReflection_C.EventReceived_EAEF202049D40A73947FC29489290511
struct FEventReceived_EAEF202049D40A73947FC29489290511
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_DarkReflection.GA_DarkReflection_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 // Function GA_DarkReflection.GA_DarkReflection_C.ExecuteUbergraph_GA_DarkReflection
struct FExecuteUbergraph_GA_DarkReflection
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_K2_HasAuthority_ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct UAbilityTask_WaitGameplayTagRemoved* CallFunc_WaitGameplayTagRemove_ReturnValue;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[3];  // 0x11 (0x11)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x14 (0x14)
	char pad_36[4];  // 0x24 (0x24)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0x28 (0x28)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0xD8 (0xD8)
	struct FGameplayEventData Temp_struct_Variable;  // 0xE8 (0xE8)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0x198 (0x198)
	char pad_416_1 : 7;  // 0x1A0 (0x1A0)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x1A0 (0x1A0)
	char pad_417_1 : 7;  // 0x1A1 (0x1A1)
	bool CallFunc_HasTag_ReturnValue : 1;  // 0x1A1 (0x1A1)
	char pad_418[6];  // 0x1A2 (0x1A2)
	struct FGameplayEventData Temp_struct_Variable_2;  // 0x1A8 (0x1A8)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue;  // 0x258 (0x258)
	int32_t Temp_int_Array_Index_Variable;  // 0x268 (0x268)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x26C (0x26C)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x270 (0x270)
	char pad_628[4];  // 0x274 (0x274)
	struct FGameplayEventData Temp_struct_Variable_3;  // 0x278 (0x278)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x328 (0x328)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue_2;  // 0x3D8 (0x3D8)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x3E8 (0x3E8)
	struct FActiveGameplayEffectHandle CallFunc_Array_Get_Item;  // 0x3F0 (0x3F0)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x3F8 (0x3F8)
	float CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue;  // 0x4A8 (0x4A8)
	char pad_1196[4];  // 0x4AC (0x4AC)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue_3;  // 0x4B0 (0x4B0)
	struct UAbilityTask_WaitDelay* CallFunc_WaitDelay_ReturnValue;  // 0x4C0 (0x4C0)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x4C8 (0x4C8)
	char pad_1228_1 : 7;  // 0x4CC (0x4CC)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x4CC (0x4CC)
	char pad_1229_1 : 7;  // 0x4CD (0x4CD)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x4CD (0x4CD)
	char pad_1230[2];  // 0x4CE (0x4CE)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue;  // 0x4D0 (0x4D0)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue;  // 0x4D8 (0x4D8)
	char pad_1244[4];  // 0x4DC (0x4DC)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0x4E0 (0x4E0)
	char pad_1256_1 : 7;  // 0x4E8 (0x4E8)
	bool CallFunc_EqualEqual_ObjectObject_ReturnValue : 1;  // 0x4E8 (0x4E8)
	char pad_1257[3];  // 0x4E9 (0x4E9)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x4EC (0x4EC)
	char pad_1276_1 : 7;  // 0x4FC (0x4FC)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0x4FC (0x4FC)


}; 
 
 