#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_DemonDog_Death.GA_DemonDog_Death_C.ExecuteUbergraph_GA_DemonDog_Death
struct FExecuteUbergraph_GA_DemonDog_Death
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_AddGameplayTag_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17_1 : 7;  // 0x11 (0x11)
	bool K2Node_Event_bWasCancelled : 1;  // 0x11 (0x11)


}; 
 
 // Function GA_DemonDog_Death.GA_DemonDog_Death_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 