#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_FireballProjectileCollision.GA_FireballProjectileCollision_C.CalTargetHitLocation
struct FCalTargetHitLocation
{
	struct FVector HitLocation;  // 0x0 (0x0)
	double HitBoxSize;  // 0x18 (0x18)
	struct FVector TargetLocation;  // 0x20 (0x20)
	int32_t Temp_int_Array_Index_Variable;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)
	double CallFunc_BreakVector_X;  // 0x40 (0x40)
	double CallFunc_BreakVector_Y;  // 0x48 (0x48)
	double CallFunc_BreakVector_Z;  // 0x50 (0x50)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x58 (0x58)
	char pad_96_1 : 7;  // 0x60 (0x60)
	bool Temp_bool_True_if_break_was_hit_Variable : 1;  // 0x60 (0x60)
	char pad_97[7];  // 0x61 (0x61)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x68 (0x68)
	double CallFunc_BreakVector_X_2;  // 0x80 (0x80)
	double CallFunc_BreakVector_Y_2;  // 0x88 (0x88)
	double CallFunc_BreakVector_Z_2;  // 0x90 (0x90)
	char pad_152_1 : 7;  // 0x98 (0x98)
	bool CallFunc_Not_PreBool_ReturnValue : 1;  // 0x98 (0x98)
	char pad_153[7];  // 0x99 (0x99)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0xA0 (0xA0)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_2;  // 0xA8 (0xA8)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_3;  // 0xC0 (0xC0)
	struct FVector CallFunc_Subtract_VectorVector_ReturnValue;  // 0xD8 (0xD8)
	double CallFunc_VSize_ReturnValue;  // 0xF0 (0xF0)
	struct FVector CallFunc_Normal_ReturnValue;  // 0xF8 (0xF8)
	double CallFunc_Subtract_DoubleDouble_ReturnValue;  // 0x110 (0x110)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x118 (0x118)
	char pad_284[4];  // 0x11C (0x11C)
	double CallFunc_FClamp_ReturnValue;  // 0x120 (0x120)
	struct FVector CallFunc_Conv_DoubleToVector_ReturnValue;  // 0x128 (0x128)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x140 (0x140)
	char pad_324[4];  // 0x144 (0x144)
	struct FVector CallFunc_Multiply_VectorVector_ReturnValue;  // 0x148 (0x148)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x160 (0x160)
	struct TArray<struct UDCHitBoxComponent*> CallFunc_K2_GetComponentsByClass_ReturnValue;  // 0x178 (0x178)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x188 (0x188)
	char pad_396[4];  // 0x18C (0x18C)
	struct UDCHitBoxComponent* CallFunc_Array_Get_Item;  // 0x190 (0x190)
	char pad_408_1 : 7;  // 0x198 (0x198)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x198 (0x198)
	char pad_409[7];  // 0x199 (0x199)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue;  // 0x1A0 (0x1A0)
	char pad_440_1 : 7;  // 0x1B8 (0x1B8)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0x1B8 (0x1B8)
	char pad_441[7];  // 0x1B9 (0x1B9)
	double CallFunc_BreakVector_X_3;  // 0x1C0 (0x1C0)
	double CallFunc_BreakVector_Y_3;  // 0x1C8 (0x1C8)
	double CallFunc_BreakVector_Z_3;  // 0x1D0 (0x1D0)
	double CallFunc_FClamp_ReturnValue_2;  // 0x1D8 (0x1D8)
	struct FVector CallFunc_GetScaledBoxExtent_ReturnValue;  // 0x1E0 (0x1E0)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0x1F8 (0x1F8)
	double CallFunc_VSize_ReturnValue_2;  // 0x210 (0x210)
	char pad_536_1 : 7;  // 0x218 (0x218)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x218 (0x218)
	char pad_537_1 : 7;  // 0x219 (0x219)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue : 1;  // 0x219 (0x219)


}; 
 
 // Function GA_FireballProjectileCollision.GA_FireballProjectileCollision_C.ExecuteUbergraph_GA_FireballProjectileCollision
struct FExecuteUbergraph_GA_FireballProjectileCollision
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool K2Node_Event_bWasCancelled : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct FGameplayTagContainer CallFunc_GetOwnedGameplayTags_TagContainer;  // 0x18 (0x18)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool CallFunc_HasTag_ReturnValue : 1;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)
	struct TArray<enum class EObjectTypeQuery> K2Node_MakeArray_Array;  // 0x40 (0x40)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x50 (0x50)
	char pad_84[4];  // 0x54 (0x54)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0x58 (0x58)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x60 (0x60)
	char pad_100[4];  // 0x64 (0x64)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x68 (0x68)
	struct TArray<struct AActor*> Temp_object_Variable;  // 0x80 (0x80)
	int32_t Temp_int_Array_Index_Variable;  // 0x90 (0x90)
	char pad_148[4];  // 0x94 (0x94)
	struct ADCCharacterBase* K2Node_DynamicCast_AsDCCharacter_Base;  // 0x98 (0x98)
	char pad_160_1 : 7;  // 0xA0 (0xA0)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0xA0 (0xA0)
	char pad_161[7];  // 0xA1 (0xA1)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_2;  // 0xA8 (0xA8)
	struct FVector CallFunc_Subtract_VectorVector_ReturnValue;  // 0xC0 (0xC0)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3;  // 0xD8 (0xD8)
	struct FVector CallFunc_Normal_ReturnValue;  // 0xE0 (0xE0)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue;  // 0xF8 (0xF8)
	struct FVector CallFunc_Multiply_VectorFloat_ReturnValue;  // 0x100 (0x100)
	struct FGameplayEffectContextHandle CallFunc_MakeEffectContext_ReturnValue;  // 0x118 (0x118)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x130 (0x130)
	struct AProjectileActor* K2Node_DynamicCast_AsProjectile_Actor;  // 0x148 (0x148)
	char pad_336_1 : 7;  // 0x150 (0x150)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x150 (0x150)
	char pad_337[7];  // 0x151 (0x151)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4;  // 0x158 (0x158)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_3;  // 0x160 (0x160)
	struct FVector CallFunc_CalTargetHitLocation_HitLocation;  // 0x178 (0x178)
	struct TArray<struct AActor*> CallFunc_SphereOverlapActors_OutActors;  // 0x190 (0x190)
	char pad_416_1 : 7;  // 0x1A0 (0x1A0)
	bool CallFunc_SphereOverlapActors_ReturnValue : 1;  // 0x1A0 (0x1A0)
	char pad_417[7];  // 0x1A1 (0x1A1)
	struct FHitResult CallFunc_MakeHitResult_ReturnValue;  // 0x1A8 (0x1A8)
	struct AActor* CallFunc_Array_Get_Item;  // 0x290 (0x290)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x298 (0x298)
	char pad_668_1 : 7;  // 0x29C (0x29C)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x29C (0x29C)
	char pad_669[3];  // 0x29D (0x29D)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x2A0 (0x2A0)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x350 (0x350)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyPremadeSpecArray_ReturnValue;  // 0x358 (0x358)
	char pad_872_1 : 7;  // 0x368 (0x368)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x368 (0x368)
	char pad_873[7];  // 0x369 (0x369)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyPremadeSpecArray_ReturnValue_2;  // 0x370 (0x370)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyPremadeSpecArray_ReturnValue_3;  // 0x380 (0x380)


}; 
 
 // Function GA_FireballProjectileCollision.GA_FireballProjectileCollision_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 