#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_FluteBlockReaction.GA_FluteBlockReaction_C.ExecuteUbergraph_GA_FluteBlockReaction
struct FExecuteUbergraph_GA_FluteBlockReaction
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_IsLocallyControlled_ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x8 (0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x18 (0x18)
	struct UDCAT_WaitForInputAction* CallFunc_WaitForInputAction_ReturnValue;  // 0x28 (0x28)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x38 (0x38)


}; 
 
 // Function GA_FluteBlockReaction.GA_FluteBlockReaction_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 