#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_GoblinMage_Attack.GA_GoblinMage_Attack_C.CreateProjectiles
// Size: 0xD8(Inherited: 0xD8)
struct FCreateProjectiles : FCreateProjectiles
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)
	float FirePower;  // 0xB8 (0xB8)
	struct FVector StartLocation;  // 0xC0 (0xC0)


}; 
 
 // Function GA_GoblinMage_Attack.GA_GoblinMage_Attack_C.ExecuteUbergraph_GA_GoblinMage_Attack
struct FExecuteUbergraph_GA_GoblinMage_Attack
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x8 (0x8)
	double CallFunc_Subtract_DoubleDouble_ReturnValue;  // 0x10 (0x10)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_2;  // 0x18 (0x18)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_2;  // 0x20 (0x20)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x28 (0x28)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_3;  // 0x30 (0x30)
	double CallFunc_Add_DoubleDouble_ReturnValue_2;  // 0x38 (0x38)
	double CallFunc_Add_DoubleDouble_ReturnValue_3;  // 0x40 (0x40)
	double CallFunc_RandomFloatInRange_ReturnValue;  // 0x48 (0x48)
	double CallFunc_Add_DoubleDouble_ReturnValue_4;  // 0x50 (0x50)
	struct FRotator CallFunc_MakeRotator_ReturnValue;  // 0x58 (0x58)
	char pad_112_1 : 7;  // 0x70 (0x70)
	bool CallFunc_RandomBool_ReturnValue : 1;  // 0x70 (0x70)
	char pad_113[7];  // 0x71 (0x71)
	struct TArray<struct FRotator> K2Node_MakeArray_Array;  // 0x78 (0x78)
	double CallFunc_Add_DoubleDouble_ReturnValue_5;  // 0x88 (0x88)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_4;  // 0x90 (0x90)
	double CallFunc_RandomFloatInRange_ReturnValue_2;  // 0x98 (0x98)
	struct FRotator CallFunc_MakeRotator_ReturnValue_2;  // 0xA0 (0xA0)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_3;  // 0xB8 (0xB8)
	struct TArray<struct FRotator> K2Node_MakeArray_Array_2;  // 0xC0 (0xC0)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_5;  // 0xD0 (0xD0)
	double CallFunc_Add_DoubleDouble_ReturnValue_6;  // 0xD8 (0xD8)
	double CallFunc_Add_DoubleDouble_ReturnValue_7;  // 0xE0 (0xE0)
	char pad_232_1 : 7;  // 0xE8 (0xE8)
	bool CallFunc_RandomBool_ReturnValue_2 : 1;  // 0xE8 (0xE8)
	char pad_233[7];  // 0xE9 (0xE9)
	double CallFunc_RandomFloatInRange_ReturnValue_3;  // 0xF0 (0xF0)
	struct FRotator CallFunc_MakeRotator_ReturnValue_3;  // 0xF8 (0xF8)
	double CallFunc_Add_DoubleDouble_ReturnValue_8;  // 0x110 (0x110)
	struct TArray<struct FRotator> K2Node_MakeArray_Array_3;  // 0x118 (0x118)
	double CallFunc_RandomFloatInRange_ReturnValue_4;  // 0x128 (0x128)
	struct FRotator CallFunc_MakeRotator_ReturnValue_4;  // 0x130 (0x130)
	double CallFunc_Add_DoubleDouble_ReturnValue_9;  // 0x148 (0x148)
	struct TArray<struct FRotator> K2Node_MakeArray_Array_4;  // 0x150 (0x150)
	double CallFunc_Add_DoubleDouble_ReturnValue_10;  // 0x160 (0x160)
	double CallFunc_RandomFloatInRange_ReturnValue_5;  // 0x168 (0x168)
	struct FRotator CallFunc_MakeRotator_ReturnValue_5;  // 0x170 (0x170)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_6;  // 0x188 (0x188)
	struct TArray<struct FRotator> K2Node_MakeArray_Array_5;  // 0x190 (0x190)
	double CallFunc_Add_DoubleDouble_ReturnValue_11;  // 0x1A0 (0x1A0)
	double CallFunc_Add_DoubleDouble_ReturnValue_12;  // 0x1A8 (0x1A8)
	char pad_432_1 : 7;  // 0x1B0 (0x1B0)
	bool CallFunc_RandomBool_ReturnValue_3 : 1;  // 0x1B0 (0x1B0)
	char pad_433[7];  // 0x1B1 (0x1B1)
	double CallFunc_RandomFloatInRange_ReturnValue_6;  // 0x1B8 (0x1B8)
	double CallFunc_Multiply_DoubleDouble_ReturnValue_4;  // 0x1C0 (0x1C0)
	double CallFunc_Add_DoubleDouble_ReturnValue_13;  // 0x1C8 (0x1C8)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_7;  // 0x1D0 (0x1D0)
	double CallFunc_Add_DoubleDouble_ReturnValue_14;  // 0x1D8 (0x1D8)
	double CallFunc_Add_DoubleDouble_ReturnValue_15;  // 0x1E0 (0x1E0)
	double CallFunc_RandomFloatInRange_ReturnValue_7;  // 0x1E8 (0x1E8)
	double CallFunc_Add_DoubleDouble_ReturnValue_16;  // 0x1F0 (0x1F0)
	struct FRotator CallFunc_MakeRotator_ReturnValue_6;  // 0x1F8 (0x1F8)
	double CallFunc_RandomFloatInRange_ReturnValue_8;  // 0x210 (0x210)
	struct TArray<struct FRotator> K2Node_MakeArray_Array_6;  // 0x218 (0x218)
	struct FRotator CallFunc_MakeRotator_ReturnValue_7;  // 0x228 (0x228)
	struct TArray<struct FRotator> K2Node_MakeArray_Array_7;  // 0x240 (0x240)
	char pad_592_1 : 7;  // 0x250 (0x250)
	bool K2Node_Event_bWasCancelled : 1;  // 0x250 (0x250)
	char pad_593[7];  // 0x251 (0x251)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x258 (0x258)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x260 (0x260)
	char pad_616_1 : 7;  // 0x268 (0x268)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x268 (0x268)
	char pad_617[3];  // 0x269 (0x269)
	int32_t CallFunc_RandomIntegerInRange_ReturnValue;  // 0x26C (0x26C)
	int32_t CallFunc_Get_BB_Phase_Phase;  // 0x270 (0x270)
	char pad_628[4];  // 0x274 (0x274)
	struct TArray<struct FVector> K2Node_MakeArray_Array_8;  // 0x278 (0x278)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x288 (0x288)
	struct FGameplayTag K2Node_Event_EventTag;  // 0x28C (0x28C)
	char pad_660[4];  // 0x294 (0x294)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x298 (0x298)
	float K2Node_Event_FirePower;  // 0x348 (0x348)
	char pad_844[4];  // 0x34C (0x34C)
	struct FVector K2Node_Event_StartLocation;  // 0x350 (0x350)
	char pad_872_1 : 7;  // 0x368 (0x368)
	bool CallFunc_GetBBTargetActorToCharacterBase_Result : 1;  // 0x368 (0x368)
	char pad_873[7];  // 0x369 (0x369)
	struct ADCCharacterBase* CallFunc_GetBBTargetActorToCharacterBase_As_DCCharacter_Base;  // 0x370 (0x370)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0x378 (0x378)
	float CallFunc_GetDistanceTo_ReturnValue;  // 0x380 (0x380)
	char pad_900_1 : 7;  // 0x384 (0x384)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x384 (0x384)
	char pad_901[3];  // 0x385 (0x385)
	int32_t CallFunc_FTrunc_ReturnValue;  // 0x388 (0x388)
	char pad_908[4];  // 0x38C (0x38C)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_8;  // 0x390 (0x390)
	char pad_920_1 : 7;  // 0x398 (0x398)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x398 (0x398)
	char pad_921[7];  // 0x399 (0x399)
	struct FRotator CallFunc_MakeRotator_ReturnValue_8;  // 0x3A0 (0x3A0)
	struct TArray<struct FRotator> K2Node_MakeArray_Array_9;  // 0x3B8 (0x3B8)
	char pad_968_1 : 7;  // 0x3C8 (0x3C8)
	bool CallFunc_RandomBool_ReturnValue_4 : 1;  // 0x3C8 (0x3C8)
	char pad_969_1 : 7;  // 0x3C9 (0x3C9)
	bool CallFunc_Less_IntInt_ReturnValue_3 : 1;  // 0x3C9 (0x3C9)
	char pad_970[2];  // 0x3CA (0x3CA)
	float CallFunc_MakeRotator_Yaw_ImplicitCast;  // 0x3CC (0x3CC)
	float CallFunc_MakeRotator_Yaw_ImplicitCast_2;  // 0x3D0 (0x3D0)
	float CallFunc_MakeRotator_Yaw_ImplicitCast_3;  // 0x3D4 (0x3D4)
	float CallFunc_MakeRotator_Pitch_ImplicitCast;  // 0x3D8 (0x3D8)
	float CallFunc_MakeRotator_Yaw_ImplicitCast_4;  // 0x3DC (0x3DC)
	float CallFunc_MakeRotator_Pitch_ImplicitCast_2;  // 0x3E0 (0x3E0)
	float CallFunc_MakeRotator_Yaw_ImplicitCast_5;  // 0x3E4 (0x3E4)
	float CallFunc_MakeRotator_Pitch_ImplicitCast_3;  // 0x3E8 (0x3E8)
	float CallFunc_MakeRotator_Pitch_ImplicitCast_4;  // 0x3EC (0x3EC)
	float CallFunc_MakeRotator_Pitch_ImplicitCast_5;  // 0x3F0 (0x3F0)
	float CallFunc_MakeRotator_Yaw_ImplicitCast_6;  // 0x3F4 (0x3F4)
	float CallFunc_MakeRotator_Pitch_ImplicitCast_6;  // 0x3F8 (0x3F8)
	float CallFunc_MakeRotator_Yaw_ImplicitCast_7;  // 0x3FC (0x3FC)
	float CallFunc_MakeRotator_Pitch_ImplicitCast_7;  // 0x400 (0x400)
	float CallFunc_MakeRotator_Pitch_ImplicitCast_8;  // 0x404 (0x404)
	double CallFunc_FTrunc_A_ImplicitCast;  // 0x408 (0x408)
	float CallFunc_MakeRotator_Yaw_ImplicitCast_8;  // 0x410 (0x410)


}; 
 
 // Function GA_GoblinMage_Attack.GA_GoblinMage_Attack_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 