#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_GiantCentipede_RunPhase.GA_GiantCentipede_RunPhase_C.ExecuteUbergraph_GA_GiantCentipede_RunPhase
struct FExecuteUbergraph_GA_GiantCentipede_RunPhase
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x10 (0x10)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0x28 (0x28)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_2;  // 0x30 (0x30)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_3;  // 0x48 (0x48)
	double CallFunc_Vector_Distance_ReturnValue;  // 0x60 (0x60)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3;  // 0x68 (0x68)
	struct FTransform CallFunc_GetTransform_ReturnValue;  // 0x70 (0x70)
	struct FVector CallFunc_BreakTransform_Location;  // 0xD0 (0xD0)
	struct FRotator CallFunc_BreakTransform_Rotation;  // 0xE8 (0xE8)
	struct FVector CallFunc_BreakTransform_Scale;  // 0x100 (0x100)
	char pad_280_1 : 7;  // 0x118 (0x118)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x118 (0x118)
	char pad_281[7];  // 0x119 (0x119)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_4;  // 0x120 (0x120)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4;  // 0x138 (0x138)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_5;  // 0x140 (0x140)
	char pad_328[8];  // 0x148 (0x148)
	struct FTransform CallFunc_GetTransform_ReturnValue_2;  // 0x150 (0x150)
	struct FTransform CallFunc_GetTransform_ReturnValue_3;  // 0x1B0 (0x1B0)
	struct FVector CallFunc_BreakTransform_Location_2;  // 0x210 (0x210)
	struct FRotator CallFunc_BreakTransform_Rotation_2;  // 0x228 (0x228)
	struct FVector CallFunc_BreakTransform_Scale_2;  // 0x240 (0x240)
	struct FVector CallFunc_BreakTransform_Location_3;  // 0x258 (0x258)
	struct FRotator CallFunc_BreakTransform_Rotation_3;  // 0x270 (0x270)
	struct FVector CallFunc_BreakTransform_Scale_3;  // 0x288 (0x288)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_6;  // 0x2A0 (0x2A0)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_5;  // 0x2A8 (0x2A8)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_7;  // 0x2C0 (0x2C0)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_6;  // 0x2C8 (0x2C8)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_7;  // 0x2E0 (0x2E0)
	double CallFunc_Vector_Distance_ReturnValue_2;  // 0x2F8 (0x2F8)
	char pad_768_1 : 7;  // 0x300 (0x300)
	bool CallFunc_InRange_FloatFloat_ReturnValue : 1;  // 0x300 (0x300)
	char pad_769[7];  // 0x301 (0x301)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_8;  // 0x308 (0x308)
	double CallFunc_Vector_Distance_ReturnValue_3;  // 0x320 (0x320)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_8;  // 0x328 (0x328)
	char pad_816_1 : 7;  // 0x330 (0x330)
	bool CallFunc_InRange_FloatFloat_ReturnValue_2 : 1;  // 0x330 (0x330)
	char pad_817[7];  // 0x331 (0x331)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_9;  // 0x338 (0x338)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_9;  // 0x350 (0x350)
	char pad_856[8];  // 0x358 (0x358)
	struct FTransform CallFunc_GetTransform_ReturnValue_4;  // 0x360 (0x360)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_10;  // 0x3C0 (0x3C0)
	struct FVector CallFunc_BreakTransform_Location_4;  // 0x3D8 (0x3D8)
	struct FRotator CallFunc_BreakTransform_Rotation_4;  // 0x3F0 (0x3F0)
	struct FVector CallFunc_BreakTransform_Scale_4;  // 0x408 (0x408)
	double CallFunc_Vector_Distance_ReturnValue_4;  // 0x420 (0x420)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_10;  // 0x428 (0x428)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x430 (0x430)
	char pad_1080[8];  // 0x438 (0x438)
	struct FTransform CallFunc_GetTransform_ReturnValue_5;  // 0x440 (0x440)
	struct FVector CallFunc_BreakTransform_Location_5;  // 0x4A0 (0x4A0)
	struct FRotator CallFunc_BreakTransform_Rotation_5;  // 0x4B8 (0x4B8)
	struct FVector CallFunc_BreakTransform_Scale_5;  // 0x4D0 (0x4D0)
	struct FRotator CallFunc_FindLookAtRotation_ReturnValue;  // 0x4E8 (0x4E8)
	char pad_1280_1 : 7;  // 0x500 (0x500)
	bool K2Node_Event_bWasCancelled : 1;  // 0x500 (0x500)
	char pad_1281_1 : 7;  // 0x501 (0x501)
	bool CallFunc_K2_SetActorRotation_ReturnValue : 1;  // 0x501 (0x501)
	char pad_1282[6];  // 0x502 (0x502)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x508 (0x508)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_11;  // 0x5B8 (0x5B8)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_12;  // 0x5C0 (0x5C0)
	struct AAIController* CallFunc_GetAIController_ReturnValue;  // 0x5C8 (0x5C8)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x5D0 (0x5D0)
	char pad_1496_1 : 7;  // 0x5D8 (0x5D8)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x5D8 (0x5D8)
	char pad_1497[3];  // 0x5D9 (0x5D9)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x5DC (0x5DC)
	char pad_1516[4];  // 0x5EC (0x5EC)
	double CallFunc_GetWorldDeltaSeconds_ReturnValue;  // 0x5F0 (0x5F0)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x5F8 (0x5F8)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue;  // 0x608 (0x608)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue_2;  // 0x610 (0x610)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x618 (0x618)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue_3;  // 0x628 (0x628)
	enum class EPathFollowingResult Temp_byte_Variable;  // 0x630 (0x630)
	char pad_1585[7];  // 0x631 (0x631)
	struct AAIController* CallFunc_GetAIController_ReturnValue_2;  // 0x638 (0x638)
	enum class EPathFollowingResult K2Node_CustomEvent_MovementResult;  // 0x640 (0x640)
	char pad_1601_1 : 7;  // 0x641 (0x641)
	bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue : 1;  // 0x641 (0x641)
	char pad_1602_1 : 7;  // 0x642 (0x642)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x642 (0x642)
	char pad_1603[5];  // 0x643 (0x643)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_11;  // 0x648 (0x648)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_13;  // 0x660 (0x660)
	struct AAIController* CallFunc_GetAIController_ReturnValue_3;  // 0x668 (0x668)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_4;  // 0x670 (0x670)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_14;  // 0x680 (0x680)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_5;  // 0x688 (0x688)
	struct AAIController* CallFunc_GetAIController_ReturnValue_4;  // 0x698 (0x698)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue_4;  // 0x6A0 (0x6A0)
	enum class EPathFollowingResult K2Node_CustomEvent_MovementResult_2;  // 0x6A8 (0x6A8)
	char pad_1705[7];  // 0x6A9 (0x6A9)
	double CallFunc_Vector_Distance2D_ReturnValue;  // 0x6B0 (0x6B0)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_6;  // 0x6B8 (0x6B8)
	char pad_1736_1 : 7;  // 0x6C8 (0x6C8)
	bool CallFunc_LessEqual_DoubleDouble_ReturnValue : 1;  // 0x6C8 (0x6C8)
	char pad_1737[7];  // 0x6C9 (0x6C9)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_15;  // 0x6D0 (0x6D0)
	char pad_1752[8];  // 0x6D8 (0x6D8)
	struct FTransform CallFunc_GetTransform_ReturnValue_6;  // 0x6E0 (0x6E0)
	struct FVector CallFunc_BreakTransform_Location_6;  // 0x740 (0x740)
	struct FRotator CallFunc_BreakTransform_Rotation_6;  // 0x758 (0x758)
	struct FVector CallFunc_BreakTransform_Scale_6;  // 0x770 (0x770)
	struct FRotator CallFunc_FindLookAtRotation_ReturnValue_2;  // 0x788 (0x788)
	char pad_1952_1 : 7;  // 0x7A0 (0x7A0)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x7A0 (0x7A0)
	char pad_1953_1 : 7;  // 0x7A1 (0x7A1)
	bool CallFunc_K2_SetActorRotation_ReturnValue_2 : 1;  // 0x7A1 (0x7A1)
	char pad_1954[6];  // 0x7A2 (0x7A2)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_12;  // 0x7A8 (0x7A8)
	struct FRotator CallFunc_FindLookAtRotation_ReturnValue_3;  // 0x7C0 (0x7C0)
	struct FVector CallFunc_Conv_FloatToVector_ReturnValue;  // 0x7D8 (0x7D8)
	struct FVector CallFunc_GetForwardVector_ReturnValue;  // 0x7F0 (0x7F0)
	struct FVector CallFunc_Multiply_VectorVector_ReturnValue;  // 0x808 (0x808)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x820 (0x820)
	struct UAIAsyncTaskBlueprintProxy* CallFunc_CreateMoveToProxyObject_ReturnValue;  // 0x838 (0x838)
	char pad_2112_1 : 7;  // 0x840 (0x840)
	bool CallFunc_IsValid_ReturnValue_4 : 1;  // 0x840 (0x840)
	char pad_2113[3];  // 0x841 (0x841)
	float K2Node_VariableSet_GoalDistanceFromEnemy_ImplicitCast;  // 0x844 (0x844)
	float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;  // 0x848 (0x848)
	float CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2;  // 0x84C (0x84C)
	double CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast;  // 0x850 (0x850)


}; 
 
 // Function GA_GiantCentipede_RunPhase.GA_GiantCentipede_RunPhase_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 // Function GA_GiantCentipede_RunPhase.GA_GiantCentipede_RunPhase_C.OnFail_83E8B56F4909F3B83D11AAB504F6F509
struct FOnFail_83E8B56F4909F3B83D11AAB504F6F509
{
	enum class EPathFollowingResult MovementResult;  // 0x0 (0x0)


}; 
 
 // Function GA_GiantCentipede_RunPhase.GA_GiantCentipede_RunPhase_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 // Function GA_GiantCentipede_RunPhase.GA_GiantCentipede_RunPhase_C.OnSuccess_83E8B56F4909F3B83D11AAB504F6F509
struct FOnSuccess_83E8B56F4909F3B83D11AAB504F6F509
{
	enum class EPathFollowingResult MovementResult;  // 0x0 (0x0)


}; 
 
 