#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_InvisibilityPotionGranted.GA_InvisibilityPotionGranted_C.ExecuteUbergraph_GA_InvisibilityPotionGranted
struct FExecuteUbergraph_GA_InvisibilityPotionGranted
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	float K2Node_CustomEvent_OldValue;  // 0x10 (0x10)
	float K2Node_CustomEvent_NewValue;  // 0x14 (0x14)
	float Temp_real_Variable;  // 0x18 (0x18)
	float Temp_real_Variable_2;  // 0x1C (0x1C)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool CallFunc_Greater_DoubleDouble_ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)
	struct UDCAT_WaitAttributeChangeByExecution* CallFunc_WaitForAttributeChange_ReturnValue;  // 0x28 (0x28)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[3];  // 0x31 (0x31)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x34 (0x34)
	char pad_68[4];  // 0x44 (0x44)
	struct UDCAT_WaitVelocityChange* CallFunc_WaitVelocityChange_ReturnValue;  // 0x48 (0x48)
	struct FGameplayCueParameters Temp_struct_Variable;  // 0x50 (0x50)
	char pad_296_1 : 7;  // 0x128 (0x128)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x128 (0x128)
	char pad_297[7];  // 0x129 (0x129)
	struct FGameplayCueParameters Temp_struct_Variable_2;  // 0x130 (0x130)
	char pad_520_1 : 7;  // 0x208 (0x208)
	bool K2Node_Event_bWasCancelled : 1;  // 0x208 (0x208)
	char pad_521[7];  // 0x209 (0x209)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x210 (0x210)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x2C0 (0x2C0)
	char pad_720_1 : 7;  // 0x2D0 (0x2D0)
	bool CallFunc_K2_HasAuthority_ReturnValue : 1;  // 0x2D0 (0x2D0)
	char pad_721[7];  // 0x2D1 (0x2D1)
	double CallFunc_Greater_DoubleDouble_B_ImplicitCast;  // 0x2D8 (0x2D8)
	double CallFunc_Greater_DoubleDouble_A_ImplicitCast;  // 0x2E0 (0x2E0)


}; 
 
 // Function GA_InvisibilityPotionGranted.GA_InvisibilityPotionGranted_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 // Function GA_InvisibilityPotionGranted.GA_InvisibilityPotionGranted_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 // Function GA_InvisibilityPotionGranted.GA_InvisibilityPotionGranted_C.OnChange_2A946EE74ABF944157D8C4A9D3B54AD9
struct FOnChange_2A946EE74ABF944157D8C4A9D3B54AD9
{
	float OldValue;  // 0x0 (0x0)
	float NewValue;  // 0x4 (0x4)


}; 
 
 