#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_InvisibilityHideGranted.GA_InvisibilityHideGranted_C.ExecuteUbergraph_GA_InvisibilityHideGranted
struct FExecuteUbergraph_GA_InvisibilityHideGranted
{
	int32_t EntryPoint;  // 0x0 (0x0)
	float K2Node_CustomEvent_OldValue;  // 0x4 (0x4)
	float K2Node_CustomEvent_NewValue;  // 0x8 (0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0xC (0xC)
	float Temp_real_Variable;  // 0x1C (0x1C)
	float Temp_real_Variable_2;  // 0x20 (0x20)
	char pad_36_1 : 7;  // 0x24 (0x24)
	bool CallFunc_Greater_DoubleDouble_ReturnValue : 1;  // 0x24 (0x24)
	char pad_37[3];  // 0x25 (0x25)
	struct UDCAT_WaitAttributeChangeByExecution* CallFunc_WaitForAttributeChange_ReturnValue;  // 0x28 (0x28)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x30 (0x30)
	char pad_49_1 : 7;  // 0x31 (0x31)
	bool K2Node_Event_bWasCancelled : 1;  // 0x31 (0x31)
	char pad_50[6];  // 0x32 (0x32)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x38 (0x38)
	double CallFunc_Greater_DoubleDouble_B_ImplicitCast;  // 0xE8 (0xE8)
	double CallFunc_Greater_DoubleDouble_A_ImplicitCast;  // 0xF0 (0xF0)


}; 
 
 // Function GA_InvisibilityHideGranted.GA_InvisibilityHideGranted_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 // Function GA_InvisibilityHideGranted.GA_InvisibilityHideGranted_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 // Function GA_InvisibilityHideGranted.GA_InvisibilityHideGranted_C.OnChange_C21C93F04394F1680C51A9B0A83B79E5
struct FOnChange_C21C93F04394F1680C51A9B0A83B79E5
{
	float OldValue;  // 0x0 (0x0)
	float NewValue;  // 0x4 (0x4)


}; 
 
 