#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_Kindness.GA_Kindness_C.EventReceived_89CB85084463471F9396E38CC9E180E6
struct FEventReceived_89CB85084463471F9396E38CC9E180E6
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_Kindness.GA_Kindness_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 // Function GA_Kindness.GA_Kindness_C.ExecuteUbergraph_GA_Kindness
struct FExecuteUbergraph_GA_Kindness
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FPrimaryAssetId CallFunc_GetPrimaryAssetIdFromObject_ReturnValue;  // 0x4 (0x4)
	float CallFunc_GetConstantFloat_ReturnValue;  // 0x14 (0x14)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x18 (0x18)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0x28 (0x28)
	struct FGameplayEventData Temp_struct_Variable;  // 0xD8 (0xD8)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0x188 (0x188)
	char pad_400_1 : 7;  // 0x190 (0x190)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x190 (0x190)
	char pad_401[7];  // 0x191 (0x191)
	double CallFunc_Multiply_DoubleDouble_ReturnValue;  // 0x198 (0x198)
	char pad_416_1 : 7;  // 0x1A0 (0x1A0)
	bool CallFunc_EqualEqual_ObjectObject_ReturnValue : 1;  // 0x1A0 (0x1A0)
	char pad_417[3];  // 0x1A1 (0x1A1)
	struct FDCGameplayEffectSetByCallerData K2Node_MakeStruct_DCGameplayEffectSetByCallerData;  // 0x1A4 (0x1A4)
	struct TArray<struct FDCGameplayEffectSetByCallerData> K2Node_MakeArray_Array;  // 0x1B0 (0x1B0)
	struct FDCGameplayEffectData K2Node_MakeStruct_DCGameplayEffectData;  // 0x1C0 (0x1C0)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x208 (0x208)
	struct TArray<struct FDCGameplayEffectData> K2Node_MakeArray_Array_2;  // 0x2B8 (0x2B8)
	char pad_712_1 : 7;  // 0x2C8 (0x2C8)
	bool CallFunc_IsLocallyControlled_ReturnValue : 1;  // 0x2C8 (0x2C8)
	char pad_713[7];  // 0x2C9 (0x2C9)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x2D0 (0x2D0)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffects_ReturnValue;  // 0x2D8 (0x2D8)
	double CallFunc_Multiply_DoubleDouble_B_ImplicitCast;  // 0x2E8 (0x2E8)
	double CallFunc_Multiply_DoubleDouble_A_ImplicitCast;  // 0x2F0 (0x2F0)
	float K2Node_MakeStruct_SetByCallerValue_ImplicitCast;  // 0x2F8 (0x2F8)


}; 
 
 