#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_LichCurseState.GA_LichCurseState_C.ExecuteUbergraph_GA_LichCurseState
struct FExecuteUbergraph_GA_LichCurseState
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FGameplayEventData Temp_struct_Variable;  // 0x8 (0x8)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0xB8 (0xB8)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0xC0 (0xC0)
	char pad_200_1 : 7;  // 0xC8 (0xC8)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0xC8 (0xC8)
	char pad_201[7];  // 0xC9 (0xC9)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0xD0 (0xD0)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x180 (0x180)
	struct ABP_Lich_Common_C* K2Node_DynamicCast_AsBP_Lich_Common;  // 0x188 (0x188)
	char pad_400_1 : 7;  // 0x190 (0x190)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x190 (0x190)
	char pad_401[7];  // 0x191 (0x191)
	double CallFunc_RandomFloatInRange_ReturnValue;  // 0x198 (0x198)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0x1A0 (0x1A0)
	char pad_592_1 : 7;  // 0x250 (0x250)
	bool CallFunc_Greater_DoubleDouble_ReturnValue : 1;  // 0x250 (0x250)
	char pad_593[7];  // 0x251 (0x251)
	double CallFunc_Get_BB_HPRatio_HPRatio;  // 0x258 (0x258)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x260 (0x260)
	double CallFunc_Subtract_DoubleDouble_ReturnValue;  // 0x270 (0x270)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_2;  // 0x278 (0x278)


}; 
 
 // Function GA_LichCurseState.GA_LichCurseState_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 // Function GA_LichCurseState.GA_LichCurseState_C.EventReceived_9212A9594B6FFC3702D584854BF20D3E
struct FEventReceived_9212A9594B6FFC3702D584854BF20D3E
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 