#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_Longsword_UniquePassive.GA_Longsword_UniquePassive_C.ExecuteUbergraph_GA_Longsword_UniquePassive
struct FExecuteUbergraph_GA_Longsword_UniquePassive
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	struct UObject* CallFunc_EffectContextGetSourceObject_ReturnValue;  // 0x10 (0x10)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x18 (0x18)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0xC8 (0xC8)
	struct USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue;  // 0xE0 (0xE0)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue;  // 0xE8 (0xE8)


}; 
 
 // Function GA_Longsword_UniquePassive.GA_Longsword_UniquePassive_C.OnHit
// Size: 0xB0(Inherited: 0xB0)
struct FOnHit : FOnHit
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 