#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_Longbow_UniquePassive.GA_Longbow_UniquePassive_C.OnHit
// Size: 0x188(Inherited: 0xB0)
struct FOnHit : FOnHit
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)
	double KnockbackPower;  // 0xB0 (0xB0)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0xB8 (0xB8)
	struct ADCCharacterBase* K2Node_DynamicCast_AsDCCharacter_Base;  // 0xD0 (0xD0)
	char pad_392_1 : 7;  // 0x188 (0x188)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0xD8 (0xD8)
	char pad_393_1 : 7;  // 0x189 (0x189)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0xD9 (0xD9)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0xE0 (0xE0)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_2;  // 0xF8 (0xF8)
	struct FVector CallFunc_Conv_DoubleToVector_ReturnValue;  // 0x110 (0x110)
	struct FVector CallFunc_Subtract_VectorVector_ReturnValue;  // 0x128 (0x128)
	struct FVector CallFunc_Normal_ReturnValue;  // 0x140 (0x140)
	struct FVector CallFunc_Multiply_VectorVector_ReturnValue;  // 0x158 (0x158)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x170 (0x170)


}; 
 
 