#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_MusicGranted_Gradual.GA_MusicGranted_Gradual_C.OnPerformAction_66648D634759F8326498DBBB3733D3C9
struct FOnPerformAction_66648D634759F8326498DBBB3733D3C9
{
	int32_t ActionNumber;  // 0x0 (0x0)


}; 
 
 // Function GA_MusicGranted_Gradual.GA_MusicGranted_Gradual_C.ExecuteUbergraph_GA_MusicGranted_Gradual
struct FExecuteUbergraph_GA_MusicGranted_Gradual
{
	int32_t EntryPoint;  // 0x0 (0x0)
	int32_t K2Node_CustomEvent_ActionNumber_2;  // 0x4 (0x4)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x8 (0x8)
	int32_t K2Node_CustomEvent_ActionNumber;  // 0x18 (0x18)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x1C (0x1C)
	int32_t Temp_int_Variable;  // 0x2C (0x2C)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x30 (0x30)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0xE0 (0xE0)
	struct FGameplayTagContainer CallFunc_GetOwnedGameplayTags_TagContainer;  // 0xE8 (0xE8)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool CallFunc_HasTag_ReturnValue : 1;  // 0x108 (0x108)
	char pad_265_1 : 7;  // 0x109 (0x109)
	bool CallFunc_HasTag_ReturnValue_2 : 1;  // 0x109 (0x109)
	char pad_266[6];  // 0x10A (0x10A)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0x110 (0x110)
	char pad_280_1 : 7;  // 0x118 (0x118)
	bool CallFunc_HasTag_ReturnValue_3 : 1;  // 0x118 (0x118)
	char pad_281[7];  // 0x119 (0x119)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3;  // 0x120 (0x120)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4;  // 0x128 (0x128)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue;  // 0x130 (0x130)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue_2;  // 0x140 (0x140)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue_3;  // 0x150 (0x150)
	struct UAbilityTask_Repeat* CallFunc_RepeatAction_ReturnValue;  // 0x160 (0x160)
	char pad_360_1 : 7;  // 0x168 (0x168)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x168 (0x168)


}; 
 
 // Function GA_MusicGranted_Gradual.GA_MusicGranted_Gradual_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 // Function GA_MusicGranted_Gradual.GA_MusicGranted_Gradual_C.OnFinished_66648D634759F8326498DBBB3733D3C9
struct FOnFinished_66648D634759F8326498DBBB3733D3C9
{
	int32_t ActionNumber;  // 0x0 (0x0)


}; 
 
 