#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_Mummy_Attack4.GA_Mummy_Attack4_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 // Function GA_Mummy_Attack4.GA_Mummy_Attack4_C.EventReceived_2E178BC945F30FDA58F6BCA304969C89
struct FEventReceived_2E178BC945F30FDA58F6BCA304969C89
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_Mummy_Attack4.GA_Mummy_Attack4_C.EventReceived_2E178BC945F30FDA58F6BCA3E8BA296F
struct FEventReceived_2E178BC945F30FDA58F6BCA3E8BA296F
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_Mummy_Attack4.GA_Mummy_Attack4_C.EventReceived_9AADA1DC4072B1DBEE17C7B0EAC80A2B
struct FEventReceived_9AADA1DC4072B1DBEE17C7B0EAC80A2B
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_Mummy_Attack4.GA_Mummy_Attack4_C.ExecuteUbergraph_GA_Mummy_Attack4
struct FExecuteUbergraph_GA_Mummy_Attack4
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0x8 (0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x10 (0x10)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)
	struct FGameplayEventData K2Node_CustomEvent_Payload_2;  // 0x28 (0x28)
	struct FGameplayEventData Temp_struct_Variable;  // 0xD8 (0xD8)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue_2;  // 0x188 (0x188)
	char pad_400_1 : 7;  // 0x190 (0x190)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x190 (0x190)
	char pad_401[3];  // 0x191 (0x191)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x194 (0x194)
	char pad_420[4];  // 0x1A4 (0x1A4)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0x1A8 (0x1A8)
	struct FGameplayEventData Temp_struct_Variable_2;  // 0x258 (0x258)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue_3;  // 0x308 (0x308)
	char pad_784_1 : 7;  // 0x310 (0x310)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x310 (0x310)
	char pad_785[7];  // 0x311 (0x311)
	struct FGameplayEventData K2Node_CustomEvent_Payload_3;  // 0x318 (0x318)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x3C8 (0x3C8)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x3D8 (0x3D8)
	struct FGameplayEventData Temp_struct_Variable_3;  // 0x488 (0x488)
	struct UDCAT_RotateToActor* CallFunc_RotateToActor_ReturnValue;  // 0x538 (0x538)
	char pad_1344_1 : 7;  // 0x540 (0x540)
	bool CallFunc_IsValid_ReturnValue_4 : 1;  // 0x540 (0x540)
	char pad_1345[7];  // 0x541 (0x541)
	struct UDCAT_RotateToActor* CallFunc_RotateToActor_ReturnValue_2;  // 0x548 (0x548)
	char pad_1360_1 : 7;  // 0x550 (0x550)
	bool K2Node_Event_bWasCancelled : 1;  // 0x550 (0x550)
	char pad_1361_1 : 7;  // 0x551 (0x551)
	bool CallFunc_IsValid_ReturnValue_5 : 1;  // 0x551 (0x551)


}; 
 
 // Function GA_Mummy_Attack4.GA_Mummy_Attack4_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 