#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_NormalAttack_Return_ProjectileCollision.GA_NormalAttack_Return_ProjectileCollision_C.ExecuteUbergraph_GA_NormalAttack_Return_ProjectileCollision
struct FExecuteUbergraph_GA_NormalAttack_Return_ProjectileCollision
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct ABP_GhostKing_DebuffArea_C* K2Node_DynamicCast_AsBP_Ghost_King_Debuff_Area;  // 0x8 (0x8)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x18 (0x18)
	struct AProjectileActor* K2Node_DynamicCast_AsProjectile_Actor;  // 0x20 (0x20)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)
	struct ABP_GhostKing_Common_C* K2Node_DynamicCast_AsBP_Ghost_King_Common;  // 0x30 (0x30)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool K2Node_DynamicCast_bSuccess_3 : 1;  // 0x38 (0x38)
	char pad_57_1 : 7;  // 0x39 (0x39)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x39 (0x39)
	char pad_58[6];  // 0x3A (0x3A)
	double K2Node_VariableSet_Launch_Interval_ImplicitCast;  // 0x40 (0x40)


}; 
 
 