#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_PlayerCharBlockReactionBase.GA_PlayerCharBlockReactionBase_C.EventReceived_9082A8194C120F827B853A826395D816
struct FEventReceived_9082A8194C120F827B853A826395D816
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_PlayerCharBlockReactionBase.GA_PlayerCharBlockReactionBase_C.ReceivedEvent
struct FReceivedEvent
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_PlayerCharBlockReactionBase.GA_PlayerCharBlockReactionBase_C.OnCompleted_9082A8194C120F827B853A826395D816
struct FOnCompleted_9082A8194C120F827B853A826395D816
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_PlayerCharBlockReactionBase.GA_PlayerCharBlockReactionBase_C.ExecuteUbergraph_GA_PlayerCharBlockReactionBase
struct FExecuteUbergraph_GA_PlayerCharBlockReactionBase
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x4 (0x4)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x14 (0x14)
	struct FGameplayTag K2Node_CustomEvent_EventTag_4;  // 0x24 (0x24)
	char pad_44[4];  // 0x2C (0x2C)
	struct FGameplayEventData K2Node_CustomEvent_EventData_4;  // 0x30 (0x30)
	struct FGameplayTag K2Node_CustomEvent_EventTag_3;  // 0xE0 (0xE0)
	struct FGameplayEventData K2Node_CustomEvent_EventData_3;  // 0xE8 (0xE8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x198 (0x198)
	struct FGameplayTag K2Node_CustomEvent_EventTag_2;  // 0x1A8 (0x1A8)
	struct FGameplayEventData K2Node_CustomEvent_EventData_2;  // 0x1B0 (0x1B0)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_4;  // 0x260 (0x260)
	struct FGameplayEventData Temp_struct_Variable;  // 0x270 (0x270)
	struct FGameplayTag Temp_struct_Variable_2;  // 0x320 (0x320)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_5;  // 0x328 (0x328)
	char pad_824_1 : 7;  // 0x338 (0x338)
	bool Temp_bool_Variable : 1;  // 0x338 (0x338)
	char pad_825_1 : 7;  // 0x339 (0x339)
	bool CallFunc_IsLocallyControlled_ReturnValue : 1;  // 0x339 (0x339)
	char pad_826[6];  // 0x33A (0x33A)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x340 (0x340)
	struct FGameplayTag K2Node_CustomEvent_EventTag;  // 0x3F0 (0x3F0)
	struct FGameplayEventData K2Node_CustomEvent_EventData;  // 0x3F8 (0x3F8)
	int32_t CallFunc_FTrunc_ReturnValue;  // 0x4A8 (0x4A8)
	char pad_1196_1 : 7;  // 0x4AC (0x4AC)
	bool CallFunc_MatchesTag_ReturnValue : 1;  // 0x4AC (0x4AC)
	char pad_1197[3];  // 0x4AD (0x4AD)
	struct UObject* CallFunc_GetCurrentSourceObject_ReturnValue;  // 0x4B0 (0x4B0)
	char pad_1208_1 : 7;  // 0x4B8 (0x4B8)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x4B8 (0x4B8)
	char pad_1209[7];  // 0x4B9 (0x4B9)
	struct AItemActor* K2Node_DynamicCast_AsItem_Actor;  // 0x4C0 (0x4C0)
	char pad_1224_1 : 7;  // 0x4C8 (0x4C8)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x4C8 (0x4C8)
	char pad_1225[3];  // 0x4C9 (0x4C9)
	float CallFunc_GetActorAttributeValue_ReturnValue;  // 0x4CC (0x4CC)
	int32_t CallFunc_FTrunc_ReturnValue_2;  // 0x4D0 (0x4D0)
	char pad_1236_1 : 7;  // 0x4D4 (0x4D4)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x4D4 (0x4D4)
	char pad_1237_1 : 7;  // 0x4D5 (0x4D5)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x4D5 (0x4D5)
	char pad_1238[2];  // 0x4D6 (0x4D6)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x4D8 (0x4D8)
	char pad_1416_1 : 7;  // 0x588 (0x588)
	bool CallFunc_GetActionBoolWithController_ReturnValue : 1;  // 0x588 (0x588)
	char pad_1417[3];  // 0x589 (0x589)
	struct FGameplayTag K2Node_CustomEvent_EventTag_5;  // 0x58C (0x58C)
	char pad_1428[4];  // 0x594 (0x594)
	struct FGameplayEventData K2Node_CustomEvent_EventData_5;  // 0x598 (0x598)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_6;  // 0x648 (0x648)
	float CallFunc_GetPlayLength_ReturnValue;  // 0x658 (0x658)
	char pad_1628[4];  // 0x65C (0x65C)
	struct UAbilityTask_WaitDelay* CallFunc_WaitDelay_ReturnValue;  // 0x660 (0x660)
	struct FGameplayTag K2Node_CustomEvent_EventTag_6;  // 0x668 (0x668)
	struct FGameplayEventData K2Node_CustomEvent_EventData_6;  // 0x670 (0x670)
	char pad_1824_1 : 7;  // 0x720 (0x720)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x720 (0x720)
	char pad_1825_1 : 7;  // 0x721 (0x721)
	bool CallFunc_K2_HasAuthority_ReturnValue : 1;  // 0x721 (0x721)
	char pad_1826_1 : 7;  // 0x722 (0x722)
	bool CallFunc_K2_HasAuthority_ReturnValue_2 : 1;  // 0x722 (0x722)
	char pad_1827[5];  // 0x723 (0x723)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x728 (0x728)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0x730 (0x730)
	float CallFunc_GetActorAttributeValue_ReturnValue_2;  // 0x738 (0x738)
	char pad_1852[4];  // 0x73C (0x73C)
	struct TScriptInterface<IGameplayTagAssetInterface> K2Node_DynamicCast_As_________________;  // 0x740 (0x740)
	char pad_1872_1 : 7;  // 0x750 (0x750)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x750 (0x750)
	char pad_1873[7];  // 0x751 (0x751)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x758 (0x758)
	char pad_1888_1 : 7;  // 0x760 (0x760)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // 0x760 (0x760)
	char pad_1889[7];  // 0x761 (0x761)
	struct UDCAT_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue;  // 0x768 (0x768)
	char pad_1904_1 : 7;  // 0x770 (0x770)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x770 (0x770)
	char pad_1905[7];  // 0x771 (0x771)
	double CallFunc_FTrunc_A_ImplicitCast;  // 0x778 (0x778)
	double CallFunc_FTrunc_A_ImplicitCast_2;  // 0x780 (0x780)
	double CallFunc_Add_DoubleDouble_A_ImplicitCast;  // 0x788 (0x788)
	float CallFunc_PlayMontageAndWaitForEvent_Rate_ImplicitCast;  // 0x790 (0x790)


}; 
 
 // Function GA_PlayerCharBlockReactionBase.GA_PlayerCharBlockReactionBase_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 // Function GA_PlayerCharBlockReactionBase.GA_PlayerCharBlockReactionBase_C.OnBlendOut_9082A8194C120F827B853A826395D816
struct FOnBlendOut_9082A8194C120F827B853A826395D816
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_PlayerCharBlockReactionBase.GA_PlayerCharBlockReactionBase_C.OnCancelled_9082A8194C120F827B853A826395D816
struct FOnCancelled_9082A8194C120F827B853A826395D816
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_PlayerCharBlockReactionBase.GA_PlayerCharBlockReactionBase_C.OnInterrupted_9082A8194C120F827B853A826395D816
struct FOnInterrupted_9082A8194C120F827B853A826395D816
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_PlayerCharBlockReactionBase.GA_PlayerCharBlockReactionBase_C.RemoveItemActivateTag
struct FRemoveItemActivateTag
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool CallFunc_K2_HasAuthority_ReturnValue : 1;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool CallFunc_EqualEqual_ObjectObject_ReturnValue : 1;  // 0x1 (0x1)
	char pad_2[6];  // 0x2 (0x2)
	struct UObject* CallFunc_GetCurrentSourceObject_ReturnValue;  // 0x8 (0x8)
	struct AItemActor* K2Node_DynamicCast_AsItem_Actor;  // 0x10 (0x10)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue;  // 0x20 (0x20)
	int32_t CallFunc_GetGameplayTagCount_ReturnValue;  // 0x28 (0x28)
	char pad_44_1 : 7;  // 0x2C (0x2C)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x2C (0x2C)
	char pad_45_1 : 7;  // 0x2D (0x2D)
	bool CallFunc_Not_PreBool_ReturnValue : 1;  // 0x2D (0x2D)


}; 
 
 