#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_ReactiveShield.GA_ReactiveShield_C.OnChange_C36BDEA94E9C5D5E269839B204C448A7
struct FOnChange_C36BDEA94E9C5D5E269839B204C448A7
{
	float OldValue;  // 0x0 (0x0)
	float NewValue;  // 0x4 (0x4)


}; 
 
 // Function GA_ReactiveShield.GA_ReactiveShield_C.ExecuteUbergraph_GA_ReactiveShield
struct FExecuteUbergraph_GA_ReactiveShield
{
	int32_t EntryPoint;  // 0x0 (0x0)
	float K2Node_CustomEvent_OldValue;  // 0x4 (0x4)
	float K2Node_CustomEvent_NewValue;  // 0x8 (0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0xC (0xC)
	float Temp_real_Variable;  // 0x1C (0x1C)
	float Temp_real_Variable_2;  // 0x20 (0x20)
	char pad_36_1 : 7;  // 0x24 (0x24)
	bool CallFunc_Less_DoubleDouble_ReturnValue : 1;  // 0x24 (0x24)
	char pad_37[3];  // 0x25 (0x25)
	struct UDCAT_WaitAttributeChangeByExecution* CallFunc_WaitForAttributeChange_ReturnValue;  // 0x28 (0x28)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[7];  // 0x31 (0x31)
	struct FGameplayEventData Temp_struct_Variable;  // 0x38 (0x38)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue;  // 0xE8 (0xE8)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0xF8 (0xF8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0xFC (0xFC)
	char pad_268[4];  // 0x10C (0x10C)
	struct UAbilityTask_WaitGameplayTagRemoved* CallFunc_WaitGameplayTagRemove_ReturnValue;  // 0x110 (0x110)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x118 (0x118)
	char pad_296_1 : 7;  // 0x128 (0x128)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x128 (0x128)
	char pad_297[7];  // 0x129 (0x129)
	struct FGameplayEventData Temp_struct_Variable_2;  // 0x130 (0x130)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue_2;  // 0x1E0 (0x1E0)
	int32_t Temp_int_Array_Index_Variable;  // 0x1F0 (0x1F0)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x1F4 (0x1F4)
	struct FActiveGameplayEffectHandle CallFunc_Array_Get_Item;  // 0x1F8 (0x1F8)
	float CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue;  // 0x200 (0x200)
	char pad_516_1 : 7;  // 0x204 (0x204)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x204 (0x204)
	char pad_517[3];  // 0x205 (0x205)
	struct UAbilityTask_WaitDelay* CallFunc_WaitDelay_ReturnValue;  // 0x208 (0x208)
	char pad_528_1 : 7;  // 0x210 (0x210)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x210 (0x210)
	char pad_529[3];  // 0x211 (0x211)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x214 (0x214)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x218 (0x218)
	char pad_712_1 : 7;  // 0x2C8 (0x2C8)
	bool CallFunc_IsLocallyControlled_ReturnValue : 1;  // 0x2C8 (0x2C8)
	char pad_713[7];  // 0x2C9 (0x2C9)
	double CallFunc_Less_DoubleDouble_A_ImplicitCast;  // 0x2D0 (0x2D0)
	double CallFunc_Less_DoubleDouble_B_ImplicitCast;  // 0x2D8 (0x2D8)


}; 
 
 // Function GA_ReactiveShield.GA_ReactiveShield_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 