#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_RuinsGolem_StonePillar_Attack.GA_RuinsGolem_StonePillar_Attack_C.ExecuteUbergraph_GA_RuinsGolem_StonePillar_Attack
struct FExecuteUbergraph_GA_RuinsGolem_StonePillar_Attack
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	int32_t Temp_int_Array_Index_Variable;  // 0x10 (0x10)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x14 (0x14)
	int32_t CallFunc_Subtract_IntInt_ReturnValue;  // 0x18 (0x18)
	char pad_28_1 : 7;  // 0x1C (0x1C)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x1C (0x1C)
	char pad_29[3];  // 0x1D (0x1D)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x20 (0x20)
	char pad_36[4];  // 0x24 (0x24)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0x28 (0x28)
	int32_t CallFunc_Subtract_IntInt_ReturnValue_2;  // 0x30 (0x30)
	char pad_52[4];  // 0x34 (0x34)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x38 (0x38)
	int32_t CallFunc_Max_ReturnValue;  // 0xE8 (0xE8)
	char pad_236[4];  // 0xEC (0xEC)
	struct ABP_PlayerCharacter_C* K2Node_DynamicCast_AsBP_Player_Character;  // 0xF0 (0xF0)
	char pad_248_1 : 7;  // 0xF8 (0xF8)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0xF8 (0xF8)
	char pad_249[7];  // 0xF9 (0xF9)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;  // 0x100 (0x100)
	char pad_272_1 : 7;  // 0x110 (0x110)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // 0x110 (0x110)


}; 
 
 