#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_SkeletonWarlord_BonePrison.GA_SkeletonWarlord_BonePrison_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonWarlord_BonePrison.GA_SkeletonWarlord_BonePrison_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonWarlord_BonePrison.GA_SkeletonWarlord_BonePrison_C.EventReceived_D2CC5BCE4261685F5F94E29E8E5F42BF
struct FEventReceived_D2CC5BCE4261685F5F94E29E8E5F42BF
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonWarlord_BonePrison.GA_SkeletonWarlord_BonePrison_C.ExecuteUbergraph_GA_SkeletonWarlord_BonePrison
struct FExecuteUbergraph_GA_SkeletonWarlord_BonePrison
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool Temp_bool_Variable : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x8 (0x8)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0xC (0xC)
	int32_t Temp_int_Array_Index_Variable;  // 0x10 (0x10)
	char pad_20[4];  // 0x14 (0x14)
	struct TArray<struct AActor*> Temp_object_Variable;  // 0x18 (0x18)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool Temp_bool_Variable_2 : 1;  // 0x28 (0x28)
	char pad_41[3];  // 0x29 (0x29)
	int32_t Temp_int_Loop_Counter_Variable_2;  // 0x2C (0x2C)
	struct TArray<struct AActor*> Temp_object_Variable_2;  // 0x30 (0x30)
	int32_t CallFunc_Add_IntInt_ReturnValue_2;  // 0x40 (0x40)
	char pad_68_1 : 7;  // 0x44 (0x44)
	bool K2Node_Event_bWasCancelled : 1;  // 0x44 (0x44)
	char pad_69[3];  // 0x45 (0x45)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x48 (0x48)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0xF8 (0xF8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x100 (0x100)
	struct ABP_SkeletonWarlord_C* K2Node_DynamicCast_AsBP_Skeleton_Warlord;  // 0x110 (0x110)
	char pad_280_1 : 7;  // 0x118 (0x118)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x118 (0x118)
	char pad_281[7];  // 0x119 (0x119)
	struct FTimerHandle CallFunc_K2_SetTimerDelegate_ReturnValue;  // 0x120 (0x120)
	int32_t Temp_int_Array_Index_Variable_2;  // 0x128 (0x128)
	char pad_300[4];  // 0x12C (0x12C)
	struct AActor* CallFunc_Array_Get_Item;  // 0x130 (0x130)
	struct AActor* CallFunc_Array_Get_Item_2;  // 0x138 (0x138)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x140 (0x140)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData_2;  // 0x1F0 (0x1F0)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue;  // 0x2A0 (0x2A0)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue_2;  // 0x2B0 (0x2B0)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData_3;  // 0x2C0 (0x2C0)
	struct FRotator CallFunc_K2_GetActorRotation_ReturnValue;  // 0x370 (0x370)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue_3;  // 0x388 (0x388)
	struct ADCCharacterBase* K2Node_DynamicCast_AsDCCharacter_Base;  // 0x398 (0x398)
	char pad_928_1 : 7;  // 0x3A0 (0x3A0)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x3A0 (0x3A0)
	char pad_929[7];  // 0x3A1 (0x3A1)
	struct ADCCharacterBase* K2Node_DynamicCast_AsDCCharacter_Base_2;  // 0x3A8 (0x3A8)
	char pad_944_1 : 7;  // 0x3B0 (0x3B0)
	bool K2Node_DynamicCast_bSuccess_3 : 1;  // 0x3B0 (0x3B0)
	char pad_945[7];  // 0x3B1 (0x3B1)
	struct TScriptInterface<IGameplayTagAssetInterface> K2Node_DynamicCast_As_________________;  // 0x3B8 (0x3B8)
	char pad_968_1 : 7;  // 0x3C8 (0x3C8)
	bool K2Node_DynamicCast_bSuccess_4 : 1;  // 0x3C8 (0x3C8)
	char pad_969[7];  // 0x3C9 (0x3C9)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue;  // 0x3D0 (0x3D0)
	char pad_1000_1 : 7;  // 0x3E8 (0x3E8)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // 0x3E8 (0x3E8)
	char pad_1001[7];  // 0x3E9 (0x3E9)
	double CallFunc_BreakVector_X;  // 0x3F0 (0x3F0)
	double CallFunc_BreakVector_Y;  // 0x3F8 (0x3F8)
	double CallFunc_BreakVector_Z;  // 0x400 (0x400)
	double CallFunc_Subtract_DoubleDouble_ReturnValue;  // 0x408 (0x408)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x410 (0x410)
	struct FVector CallFunc_MakeVector_ReturnValue;  // 0x418 (0x418)
	struct FVector CallFunc_MakeVector_ReturnValue_2;  // 0x430 (0x430)
	int32_t CallFunc_Map_Find_Value;  // 0x448 (0x448)
	char pad_1100_1 : 7;  // 0x44C (0x44C)
	bool CallFunc_Map_Find_ReturnValue : 1;  // 0x44C (0x44C)
	char pad_1101_1 : 7;  // 0x44D (0x44D)
	bool CallFunc_Greater_IntInt_ReturnValue : 1;  // 0x44D (0x44D)
	char pad_1102[2];  // 0x44E (0x44E)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue;  // 0x450 (0x450)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue;  // 0x458 (0x458)
	int32_t CallFunc_GetGameplayEffectCount_ReturnValue;  // 0x45C (0x45C)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData_4;  // 0x460 (0x460)
	char pad_1296_1 : 7;  // 0x510 (0x510)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue : 1;  // 0x510 (0x510)
	char pad_1297[7];  // 0x511 (0x511)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue_4;  // 0x518 (0x518)
	struct FRotator CallFunc_K2_GetActorRotation_ReturnValue_2;  // 0x528 (0x528)
	struct ADCCharacterBase* K2Node_DynamicCast_AsDCCharacter_Base_3;  // 0x540 (0x540)
	char pad_1352_1 : 7;  // 0x548 (0x548)
	bool K2Node_DynamicCast_bSuccess_5 : 1;  // 0x548 (0x548)
	char pad_1353[7];  // 0x549 (0x549)
	struct ADCCharacterBase* K2Node_DynamicCast_AsDCCharacter_Base_4;  // 0x550 (0x550)
	char pad_1368_1 : 7;  // 0x558 (0x558)
	bool K2Node_DynamicCast_bSuccess_6 : 1;  // 0x558 (0x558)
	char pad_1369[7];  // 0x559 (0x559)
	struct TScriptInterface<IGameplayTagAssetInterface> K2Node_DynamicCast_As__________________2;  // 0x560 (0x560)
	char pad_1392_1 : 7;  // 0x570 (0x570)
	bool K2Node_DynamicCast_bSuccess_7 : 1;  // 0x570 (0x570)
	char pad_1393[7];  // 0x571 (0x571)
	struct FVector CallFunc_K2_GetComponentLocation_ReturnValue_2;  // 0x578 (0x578)
	char pad_1424_1 : 7;  // 0x590 (0x590)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue_2 : 1;  // 0x590 (0x590)
	char pad_1425[7];  // 0x591 (0x591)
	double CallFunc_BreakVector_X_2;  // 0x598 (0x598)
	double CallFunc_BreakVector_Y_2;  // 0x5A0 (0x5A0)
	double CallFunc_BreakVector_Z_2;  // 0x5A8 (0x5A8)
	double CallFunc_Subtract_DoubleDouble_ReturnValue_2;  // 0x5B0 (0x5B0)
	double CallFunc_Add_DoubleDouble_ReturnValue_2;  // 0x5B8 (0x5B8)
	struct FVector CallFunc_MakeVector_ReturnValue_3;  // 0x5C0 (0x5C0)
	struct FVector CallFunc_MakeVector_ReturnValue_4;  // 0x5D8 (0x5D8)
	int32_t CallFunc_Map_Find_Value_2;  // 0x5F0 (0x5F0)
	char pad_1524_1 : 7;  // 0x5F4 (0x5F4)
	bool CallFunc_Map_Find_ReturnValue_2 : 1;  // 0x5F4 (0x5F4)
	char pad_1525_1 : 7;  // 0x5F5 (0x5F5)
	bool CallFunc_Greater_IntInt_ReturnValue_2 : 1;  // 0x5F5 (0x5F5)
	char pad_1526[2];  // 0x5F6 (0x5F6)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x5F8 (0x5F8)
	int32_t CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue_2;  // 0x600 (0x600)
	int32_t CallFunc_GetGameplayEffectCount_ReturnValue_2;  // 0x604 (0x604)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x608 (0x608)
	char pad_1548_1 : 7;  // 0x60C (0x60C)
	bool CallFunc_GreaterEqual_IntInt_ReturnValue_2 : 1;  // 0x60C (0x60C)
	char pad_1549_1 : 7;  // 0x60D (0x60D)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x60D (0x60D)
	char pad_1550[2];  // 0x60E (0x60E)
	int32_t CallFunc_Array_Length_ReturnValue_2;  // 0x610 (0x610)
	char pad_1556_1 : 7;  // 0x614 (0x614)
	bool CallFunc_Less_IntInt_ReturnValue_2 : 1;  // 0x614 (0x614)
	char pad_1557[3];  // 0x615 (0x615)
	int32_t CallFunc_Array_AddUnique_ReturnValue;  // 0x618 (0x618)
	char pad_1564[4];  // 0x61C (0x61C)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0x620 (0x620)
	struct FGameplayEventData Temp_struct_Variable;  // 0x628 (0x628)
	char pad_1752_1 : 7;  // 0x6D8 (0x6D8)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x6D8 (0x6D8)
	char pad_1753[7];  // 0x6D9 (0x6D9)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0x6E0 (0x6E0)
	struct TArray<enum class EObjectTypeQuery> K2Node_MakeArray_Array;  // 0x790 (0x790)
	struct FHitResult CallFunc_LineTraceSingleForObjects_OutHit;  // 0x7A0 (0x7A0)
	char pad_2184_1 : 7;  // 0x888 (0x888)
	bool CallFunc_LineTraceSingleForObjects_ReturnValue : 1;  // 0x888 (0x888)
	char pad_2185[3];  // 0x889 (0x889)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x88C (0x88C)
	char pad_2204_1 : 7;  // 0x89C (0x89C)
	bool CallFunc_BreakHitResult_bBlockingHit : 1;  // 0x89C (0x89C)
	char pad_2205_1 : 7;  // 0x89D (0x89D)
	bool CallFunc_BreakHitResult_bInitialOverlap : 1;  // 0x89D (0x89D)
	char pad_2206[2];  // 0x89E (0x89E)
	float CallFunc_BreakHitResult_Time;  // 0x8A0 (0x8A0)
	float CallFunc_BreakHitResult_Distance;  // 0x8A4 (0x8A4)
	struct FVector CallFunc_BreakHitResult_Location;  // 0x8A8 (0x8A8)
	struct FVector CallFunc_BreakHitResult_ImpactPoint;  // 0x8C0 (0x8C0)
	struct FVector CallFunc_BreakHitResult_Normal;  // 0x8D8 (0x8D8)
	struct FVector CallFunc_BreakHitResult_ImpactNormal;  // 0x8F0 (0x8F0)
	struct UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat;  // 0x908 (0x908)
	struct AActor* CallFunc_BreakHitResult_HitActor;  // 0x910 (0x910)
	struct UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent;  // 0x918 (0x918)
	struct FName CallFunc_BreakHitResult_HitBoneName;  // 0x920 (0x920)
	struct FName CallFunc_BreakHitResult_BoneName;  // 0x928 (0x928)
	int32_t CallFunc_BreakHitResult_HitItem;  // 0x930 (0x930)
	int32_t CallFunc_BreakHitResult_ElementIndex;  // 0x934 (0x934)
	int32_t CallFunc_BreakHitResult_FaceIndex;  // 0x938 (0x938)
	char pad_2364[4];  // 0x93C (0x93C)
	struct FVector CallFunc_BreakHitResult_TraceStart;  // 0x940 (0x940)
	struct FVector CallFunc_BreakHitResult_TraceEnd;  // 0x958 (0x958)
	struct FTransform CallFunc_MakeTransform_ReturnValue;  // 0x970 (0x970)
	struct TArray<enum class EObjectTypeQuery> K2Node_MakeArray_Array_2;  // 0x9D0 (0x9D0)
	struct AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue;  // 0x9E0 (0x9E0)
	struct FHitResult CallFunc_LineTraceSingleForObjects_OutHit_2;  // 0x9E8 (0x9E8)
	char pad_2768_1 : 7;  // 0xAD0 (0xAD0)
	bool CallFunc_LineTraceSingleForObjects_ReturnValue_2 : 1;  // 0xAD0 (0xAD0)
	char pad_2769[7];  // 0xAD1 (0xAD1)
	struct ABP_GameSpawner_C* CallFunc_FinishSpawningActor_ReturnValue;  // 0xAD8 (0xAD8)
	char pad_2784_1 : 7;  // 0xAE0 (0xAE0)
	bool CallFunc_BreakHitResult_bBlockingHit_2 : 1;  // 0xAE0 (0xAE0)
	char pad_2785_1 : 7;  // 0xAE1 (0xAE1)
	bool CallFunc_BreakHitResult_bInitialOverlap_2 : 1;  // 0xAE1 (0xAE1)
	char pad_2786[2];  // 0xAE2 (0xAE2)
	float CallFunc_BreakHitResult_Time_2;  // 0xAE4 (0xAE4)
	float CallFunc_BreakHitResult_Distance_2;  // 0xAE8 (0xAE8)
	char pad_2796[4];  // 0xAEC (0xAEC)
	struct FVector CallFunc_BreakHitResult_Location_2;  // 0xAF0 (0xAF0)
	struct FVector CallFunc_BreakHitResult_ImpactPoint_2;  // 0xB08 (0xB08)
	struct FVector CallFunc_BreakHitResult_Normal_2;  // 0xB20 (0xB20)
	struct FVector CallFunc_BreakHitResult_ImpactNormal_2;  // 0xB38 (0xB38)
	struct UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_2;  // 0xB50 (0xB50)
	struct AActor* CallFunc_BreakHitResult_HitActor_2;  // 0xB58 (0xB58)
	struct UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_2;  // 0xB60 (0xB60)
	struct FName CallFunc_BreakHitResult_HitBoneName_2;  // 0xB68 (0xB68)
	struct FName CallFunc_BreakHitResult_BoneName_2;  // 0xB70 (0xB70)
	int32_t CallFunc_BreakHitResult_HitItem_2;  // 0xB78 (0xB78)
	int32_t CallFunc_BreakHitResult_ElementIndex_2;  // 0xB7C (0xB7C)
	int32_t CallFunc_BreakHitResult_FaceIndex_2;  // 0xB80 (0xB80)
	char pad_2948[4];  // 0xB84 (0xB84)
	struct FVector CallFunc_BreakHitResult_TraceStart_2;  // 0xB88 (0xB88)
	struct FVector CallFunc_BreakHitResult_TraceEnd_2;  // 0xBA0 (0xBA0)
	struct ADCMonsterBase* CallFunc_SpawnMonster_ReturnValue;  // 0xBB8 (0xBB8)
	struct FTransform CallFunc_MakeTransform_ReturnValue_2;  // 0xBC0 (0xBC0)
	struct ABP_SkeletonWarlord_BonePrison_C* K2Node_DynamicCast_AsBP_Skeleton_Warlord_Bone_Prison;  // 0xC20 (0xC20)
	char pad_3112_1 : 7;  // 0xC28 (0xC28)
	bool K2Node_DynamicCast_bSuccess_8 : 1;  // 0xC28 (0xC28)
	char pad_3113[7];  // 0xC29 (0xC29)
	struct AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2;  // 0xC30 (0xC30)
	struct ABP_GameSpawner_C* CallFunc_FinishSpawningActor_ReturnValue_2;  // 0xC38 (0xC38)
	int32_t CallFunc_Array_AddUnique_ReturnValue_2;  // 0xC40 (0xC40)
	char pad_3140[4];  // 0xC44 (0xC44)
	struct ADCMonsterBase* CallFunc_SpawnMonster_ReturnValue_2;  // 0xC48 (0xC48)
	struct ABP_SkeletonWarlord_BonePrison_C* K2Node_DynamicCast_AsBP_Skeleton_Warlord_Bone_Prison_2;  // 0xC50 (0xC50)
	char pad_3160_1 : 7;  // 0xC58 (0xC58)
	bool K2Node_DynamicCast_bSuccess_9 : 1;  // 0xC58 (0xC58)
	char pad_3161[3];  // 0xC59 (0xC59)
	int32_t CallFunc_Array_AddUnique_ReturnValue_3;  // 0xC5C (0xC5C)


}; 
 
 