#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_SkeweredFoodRest.GA_SkeweredFoodRest_C.ExecuteUbergraph_GA_SkeweredFoodRest
struct FExecuteUbergraph_GA_SkeweredFoodRest
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x8 (0x8)
	char pad_184_1 : 7;  // 0xB8 (0xB8)
	bool K2Node_Event_bWasCancelled : 1;  // 0xB8 (0xB8)


}; 
 
 // Function GA_SkeweredFoodRest.GA_SkeweredFoodRest_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeweredFoodRest.GA_SkeweredFoodRest_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 