#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_SmokePot_Area.GA_SmokePot_Area_C.ExecuteUbergraph_GA_SmokePot_Area
struct FExecuteUbergraph_GA_SmokePot_Area
{
	int32_t EntryPoint;  // 0x0 (0x0)
	int32_t Temp_int_Array_Index_Variable;  // 0x4 (0x4)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x8 (0x8)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0xC (0xC)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_K2_CommitAbility_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x18 (0x18)
	struct ABP_DCAoeDefineBase_AutoActive_C* K2Node_DynamicCast_AsBP_DCAoe_Define_Base_Auto_Active;  // 0x20 (0x20)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0x30 (0x30)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x38 (0x38)
	char pad_60[4];  // 0x3C (0x3C)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x40 (0x40)
	char pad_240_1 : 7;  // 0xF0 (0xF0)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0xF0 (0xF0)
	char pad_241[7];  // 0xF1 (0xF1)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyPremadeSpecArray_ReturnValue;  // 0xF8 (0xF8)
	char pad_264_1 : 7;  // 0x108 (0x108)
	bool CallFunc_GetTargetArray_ReturnValue : 1;  // 0x108 (0x108)


}; 
 
 