#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_Slayer.GA_Slayer_C.OnCountChanged_A6ACC65E49785454FF743EA5D4B43272
struct FOnCountChanged_A6ACC65E49785454FF743EA5D4B43272
{
	int32_t TagCount;  // 0x0 (0x0)


}; 
 
 // Function GA_Slayer.GA_Slayer_C.Added_A6ACC65E49785454FF743EA5D4B43272
struct FAdded_A6ACC65E49785454FF743EA5D4B43272
{
	int32_t TagCount;  // 0x0 (0x0)


}; 
 
 // Function GA_Slayer.GA_Slayer_C.ExecuteUbergraph_GA_Slayer
struct FExecuteUbergraph_GA_Slayer
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue;  // 0x8 (0x8)
	int32_t K2Node_CustomEvent_TagCount_3;  // 0x10 (0x10)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x14 (0x14)
	int32_t K2Node_CustomEvent_TagCount_2;  // 0x24 (0x24)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x28 (0x28)
	int32_t K2Node_CustomEvent_TagCount;  // 0x38 (0x38)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x3C (0x3C)
	int32_t Temp_int_Variable;  // 0x4C (0x4C)
	struct UDCAT_WaitTargetGameplayTagEvent* CallFunc_WaitTargetGameplayTagEvent_ReturnValue;  // 0x50 (0x50)
	char pad_88_1 : 7;  // 0x58 (0x58)
	bool CallFunc_EqualEqual_IntInt_ReturnValue : 1;  // 0x58 (0x58)
	char pad_89_1 : 7;  // 0x59 (0x59)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x59 (0x59)
	char pad_90[2];  // 0x5A (0x5A)
	int32_t Temp_int_Array_Index_Variable;  // 0x5C (0x5C)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x60 (0x60)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0x64 (0x64)
	struct UAbilitySystemComponent* CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_2;  // 0x68 (0x68)
	struct TScriptInterface<IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;  // 0x70 (0x70)
	char pad_128_1 : 7;  // 0x80 (0x80)
	bool CallFunc_HasMatchingGameplayTag_ReturnValue : 1;  // 0x80 (0x80)
	char pad_129_1 : 7;  // 0x81 (0x81)
	bool CallFunc_K2_HasAuthority_ReturnValue : 1;  // 0x81 (0x81)
	char pad_130[6];  // 0x82 (0x82)
	struct FGameplayEventData Temp_struct_Variable;  // 0x88 (0x88)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue;  // 0x138 (0x138)
	struct FActiveGameplayEffectHandle CallFunc_Array_Get_Item;  // 0x148 (0x148)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x150 (0x150)
	char pad_340_1 : 7;  // 0x154 (0x154)
	bool CallFunc_RemoveActiveGameplayEffect_ReturnValue : 1;  // 0x154 (0x154)
	char pad_341_1 : 7;  // 0x155 (0x155)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x155 (0x155)


}; 
 
 // Function GA_Slayer.GA_Slayer_C.Removed_A6ACC65E49785454FF743EA5D4B43272
struct FRemoved_A6ACC65E49785454FF743EA5D4B43272
{
	int32_t TagCount;  // 0x0 (0x0)


}; 
 
 