#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_SongOfShadowGranted.GA_SongOfShadowGranted_C.ExecuteUbergraph_GA_SongOfShadowGranted
struct FExecuteUbergraph_GA_SongOfShadowGranted
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	float K2Node_CustomEvent_OldValue;  // 0x10 (0x10)
	float K2Node_CustomEvent_NewValue;  // 0x14 (0x14)
	float Temp_real_Variable;  // 0x18 (0x18)
	float Temp_real_Variable_2;  // 0x1C (0x1C)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool CallFunc_Greater_DoubleDouble_ReturnValue : 1;  // 0x20 (0x20)
	char pad_33[7];  // 0x21 (0x21)
	struct UDCAT_WaitAttributeChangeByExecution* CallFunc_WaitForAttributeChange_ReturnValue;  // 0x28 (0x28)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x30 (0x30)
	char pad_49[3];  // 0x31 (0x31)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x34 (0x34)
	char pad_68[4];  // 0x44 (0x44)
	struct UDCAT_WaitVelocityChange* CallFunc_WaitVelocityChange_ReturnValue;  // 0x48 (0x48)
	struct FGameplayCueParameters Temp_struct_Variable;  // 0x50 (0x50)
	char pad_296_1 : 7;  // 0x128 (0x128)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x128 (0x128)
	char pad_297[7];  // 0x129 (0x129)
	struct FGameplayCueParameters Temp_struct_Variable_2;  // 0x130 (0x130)
	struct FGameplayEventData K2Node_Event_EventData;  // 0x208 (0x208)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x2B8 (0x2B8)
	char pad_712_1 : 7;  // 0x2C8 (0x2C8)
	bool CallFunc_K2_HasAuthority_ReturnValue : 1;  // 0x2C8 (0x2C8)
	char pad_713[7];  // 0x2C9 (0x2C9)
	double CallFunc_Greater_DoubleDouble_B_ImplicitCast;  // 0x2D0 (0x2D0)
	double CallFunc_Greater_DoubleDouble_A_ImplicitCast;  // 0x2D8 (0x2D8)


}; 
 
 // Function GA_SongOfShadowGranted.GA_SongOfShadowGranted_C.K2_ActivateAbilityFromEvent
// Size: 0xB0(Inherited: 0xB0)
struct FK2_ActivateAbilityFromEvent : FK2_ActivateAbilityFromEvent
{
	struct FGameplayEventData EventData;  // 0x0 (0x0)


}; 
 
 // Function GA_SongOfShadowGranted.GA_SongOfShadowGranted_C.OnChange_C278A0BC4D007A28B825B08DB976CC55
struct FOnChange_C278A0BC4D007A28B825B08DB976CC55
{
	float OldValue;  // 0x0 (0x0)
	float NewValue;  // 0x4 (0x4)


}; 
 
 