#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_SkeletonRoyalGuard_BackStep.GA_SkeletonRoyalGuard_BackStep_C.EventReceived_4485961E499397E7ECF8C9ABD81E7C83
struct FEventReceived_4485961E499397E7ECF8C9ABD81E7C83
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonRoyalGuard_BackStep.GA_SkeletonRoyalGuard_BackStep_C.EventReceived_55C9B74E4B49AA8B3DD829B2F1ED1F44
struct FEventReceived_55C9B74E4B49AA8B3DD829B2F1ED1F44
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonRoyalGuard_BackStep.GA_SkeletonRoyalGuard_BackStep_C.ExecuteUbergraph_GA_SkeletonRoyalGuard_BackStep
struct FExecuteUbergraph_GA_SkeletonRoyalGuard_BackStep
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	struct ABP_SkeletonRoyalGuard_C* K2Node_DynamicCast_AsBP_Skeleton_Royal_Guard;  // 0x10 (0x10)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x18 (0x18)
	char pad_25[3];  // 0x19 (0x19)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x1C (0x1C)
	char pad_44[4];  // 0x2C (0x2C)
	struct UPawnMovementComponent* CallFunc_GetMovementComponent_ReturnValue;  // 0x30 (0x30)
	struct FGameplayEventData K2Node_CustomEvent_Payload_2;  // 0x38 (0x38)
	struct FGameplayEventData Temp_struct_Variable;  // 0xE8 (0xE8)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0x198 (0x198)
	char pad_416_1 : 7;  // 0x1A0 (0x1A0)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x1A0 (0x1A0)
	char pad_417[3];  // 0x1A1 (0x1A1)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x1A4 (0x1A4)
	char pad_436[4];  // 0x1B4 (0x1B4)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0x1B8 (0x1B8)
	struct FGameplayEventData Temp_struct_Variable_2;  // 0x268 (0x268)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue_2;  // 0x318 (0x318)
	char pad_800_1 : 7;  // 0x320 (0x320)
	bool CallFunc_IsValid_ReturnValue_2 : 1;  // 0x320 (0x320)
	char pad_801[3];  // 0x321 (0x321)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x324 (0x324)
	char pad_820[4];  // 0x334 (0x334)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0x338 (0x338)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3;  // 0x340 (0x340)
	char pad_840[8];  // 0x348 (0x348)
	struct FTransform CallFunc_GetTransform_ReturnValue;  // 0x350 (0x350)
	struct FTransform CallFunc_GetTransform_ReturnValue_2;  // 0x3B0 (0x3B0)
	struct FVector CallFunc_BreakTransform_Location;  // 0x410 (0x410)
	struct FRotator CallFunc_BreakTransform_Rotation;  // 0x428 (0x428)
	struct FVector CallFunc_BreakTransform_Scale;  // 0x440 (0x440)
	struct FVector CallFunc_BreakTransform_Location_2;  // 0x458 (0x458)
	struct FRotator CallFunc_BreakTransform_Rotation_2;  // 0x470 (0x470)
	struct FVector CallFunc_BreakTransform_Scale_2;  // 0x488 (0x488)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x4A0 (0x4A0)
	char pad_1360_1 : 7;  // 0x550 (0x550)
	bool CallFunc_IsValid_ReturnValue_3 : 1;  // 0x550 (0x550)
	char pad_1361[7];  // 0x551 (0x551)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_4;  // 0x558 (0x558)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue_3;  // 0x560 (0x560)
	struct ABP_SkeletonRoyalGuard_C* K2Node_DynamicCast_AsBP_Skeleton_Royal_Guard_2;  // 0x568 (0x568)
	char pad_1392_1 : 7;  // 0x570 (0x570)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x570 (0x570)
	char pad_1393_1 : 7;  // 0x571 (0x571)
	bool CallFunc_Burrow_ReturnValue : 1;  // 0x571 (0x571)
	char pad_1394[6];  // 0x572 (0x572)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue;  // 0x578 (0x578)
	char pad_1616_1 : 7;  // 0x650 (0x650)
	bool CallFunc_IsValid_ReturnValue_4 : 1;  // 0x650 (0x650)
	char pad_1617[7];  // 0x651 (0x651)
	struct UDCAT_RotateToActor* CallFunc_RotateToActor_ReturnValue;  // 0x658 (0x658)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x660 (0x660)
	char pad_1656_1 : 7;  // 0x678 (0x678)
	bool CallFunc_IsValid_ReturnValue_5 : 1;  // 0x678 (0x678)
	char pad_1657[7];  // 0x679 (0x679)
	struct FRotator CallFunc_FindLookAtRotation_ReturnValue;  // 0x680 (0x680)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_5;  // 0x698 (0x698)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_6;  // 0x6A0 (0x6A0)
	struct FGameplayEventData Temp_struct_Variable_3;  // 0x6A8 (0x6A8)
	char pad_1880_1 : 7;  // 0x758 (0x758)
	bool CallFunc_K2_SetActorRotation_ReturnValue : 1;  // 0x758 (0x758)
	char pad_1881[7];  // 0x759 (0x759)
	struct FGameplayEventData K2Node_CustomEvent_Payload_3;  // 0x760 (0x760)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue_2;  // 0x810 (0x810)
	double CallFunc_Vector_Distance2D_ReturnValue;  // 0x828 (0x828)
	struct FRotator CallFunc_FindLookAtRotation_ReturnValue_2;  // 0x830 (0x830)
	double CallFunc_Add_DoubleDouble_ReturnValue;  // 0x848 (0x848)
	struct FVector CallFunc_GetForwardVector_ReturnValue;  // 0x850 (0x850)
	struct FVector CallFunc_Conv_DoubleToVector_ReturnValue;  // 0x868 (0x868)
	char pad_2176_1 : 7;  // 0x880 (0x880)
	bool K2Node_Event_bWasCancelled : 1;  // 0x880 (0x880)
	char pad_2177[7];  // 0x881 (0x881)
	struct FVector CallFunc_Multiply_VectorVector_ReturnValue;  // 0x888 (0x888)
	struct FVector CallFunc_Add_VectorVector_ReturnValue;  // 0x8A0 (0x8A0)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_7;  // 0x8B8 (0x8B8)
	struct FHitResult CallFunc_K2_SetActorLocation_SweepHitResult;  // 0x8C0 (0x8C0)
	char pad_2472_1 : 7;  // 0x9A8 (0x9A8)
	bool CallFunc_K2_SetActorLocation_ReturnValue : 1;  // 0x9A8 (0x9A8)
	char pad_2473[7];  // 0x9A9 (0x9A9)
	struct ABP_SkeletonRoyalGuard_C* K2Node_DynamicCast_AsBP_Skeleton_Royal_Guard_3;  // 0x9B0 (0x9B0)
	char pad_2488_1 : 7;  // 0x9B8 (0x9B8)
	bool K2Node_DynamicCast_bSuccess_3 : 1;  // 0x9B8 (0x9B8)
	char pad_2489_1 : 7;  // 0x9B9 (0x9B9)
	bool CallFunc_Normal_ReturnValue : 1;  // 0x9B9 (0x9B9)


}; 
 
 // Function GA_SkeletonRoyalGuard_BackStep.GA_SkeletonRoyalGuard_BackStep_C.EventReceived_CAB9D45E4CB99D3D874F89AE01FCF203
struct FEventReceived_CAB9D45E4CB99D3D874F89AE01FCF203
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonRoyalGuard_BackStep.GA_SkeletonRoyalGuard_BackStep_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonRoyalGuard_BackStep.GA_SkeletonRoyalGuard_BackStep_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 