#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_SkeletonGuardmanSummoned_Resurrection.GA_SkeletonGuardmanSummoned_Resurrection_C.OnCancelled_F5DB03154B705B01887AA294184B876B
struct FOnCancelled_F5DB03154B705B01887AA294184B876B
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_SkeletonGuardmanSummoned_Resurrection.GA_SkeletonGuardmanSummoned_Resurrection_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonGuardmanSummoned_Resurrection.GA_SkeletonGuardmanSummoned_Resurrection_C.EventReceived_F5DB03154B705B01887AA294184B876B
struct FEventReceived_F5DB03154B705B01887AA294184B876B
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_SkeletonGuardmanSummoned_Resurrection.GA_SkeletonGuardmanSummoned_Resurrection_C.OnInterrupted_F5DB03154B705B01887AA294184B876B
struct FOnInterrupted_F5DB03154B705B01887AA294184B876B
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_SkeletonGuardmanSummoned_Resurrection.GA_SkeletonGuardmanSummoned_Resurrection_C.ExecuteUbergraph_GA_SkeletonGuardmanSummoned_Resurrection
struct FExecuteUbergraph_GA_SkeletonGuardmanSummoned_Resurrection
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x10 (0x10)
	struct FGameplayTag K2Node_CustomEvent_EventTag_5;  // 0x20 (0x20)
	struct FGameplayEventData K2Node_CustomEvent_EventData_5;  // 0x28 (0x28)
	struct FGameplayTag K2Node_CustomEvent_EventTag_4;  // 0xD8 (0xD8)
	struct FGameplayEventData K2Node_CustomEvent_EventData_4;  // 0xE0 (0xE0)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x190 (0x190)
	struct FGameplayTag K2Node_CustomEvent_EventTag_3;  // 0x1A0 (0x1A0)
	struct FGameplayEventData K2Node_CustomEvent_EventData_3;  // 0x1A8 (0x1A8)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3;  // 0x258 (0x258)
	struct FGameplayTag K2Node_CustomEvent_EventTag_2;  // 0x268 (0x268)
	struct FGameplayEventData K2Node_CustomEvent_EventData_2;  // 0x270 (0x270)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_4;  // 0x320 (0x320)
	struct FGameplayTag K2Node_CustomEvent_EventTag;  // 0x330 (0x330)
	struct FGameplayEventData K2Node_CustomEvent_EventData;  // 0x338 (0x338)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_5;  // 0x3E8 (0x3E8)
	struct FGameplayEventData Temp_struct_Variable;  // 0x3F8 (0x3F8)
	struct FGameplayTag Temp_struct_Variable_2;  // 0x4A8 (0x4A8)
	char pad_1200_1 : 7;  // 0x4B0 (0x4B0)
	bool K2Node_Event_bWasCancelled : 1;  // 0x4B0 (0x4B0)
	char pad_1201[7];  // 0x4B1 (0x4B1)
	struct UDCAT_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue;  // 0x4B8 (0x4B8)
	int32_t CallFunc_RandomInteger_ReturnValue;  // 0x4C0 (0x4C0)
	char pad_1220_1 : 7;  // 0x4C4 (0x4C4)
	bool K2Node_SwitchInteger_CmpSuccess : 1;  // 0x4C4 (0x4C4)
	char pad_1221_1 : 7;  // 0x4C5 (0x4C5)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x4C5 (0x4C5)
	char pad_1222[2];  // 0x4C6 (0x4C6)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2;  // 0x4C8 (0x4C8)
	struct TArray<struct FPrimaryAssetId> K2Node_MakeArray_Array;  // 0x4D0 (0x4D0)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x4E0 (0x4E0)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyGameplayEffectByIds_ReturnValue;  // 0x590 (0x590)


}; 
 
 // Function GA_SkeletonGuardmanSummoned_Resurrection.GA_SkeletonGuardmanSummoned_Resurrection_C.K2_OnEndAbility
// Size: 0x1(Inherited: 0x1)
struct FK2_OnEndAbility : FK2_OnEndAbility
{
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool bWasCancelled : 1;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonGuardmanSummoned_Resurrection.GA_SkeletonGuardmanSummoned_Resurrection_C.OnBlendOut_F5DB03154B705B01887AA294184B876B
struct FOnBlendOut_F5DB03154B705B01887AA294184B876B
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 // Function GA_SkeletonGuardmanSummoned_Resurrection.GA_SkeletonGuardmanSummoned_Resurrection_C.OnCompleted_F5DB03154B705B01887AA294184B876B
struct FOnCompleted_F5DB03154B705B01887AA294184B876B
{
	struct FGameplayTag EventTag;  // 0x0 (0x0)
	struct FGameplayEventData EventData;  // 0x8 (0x8)


}; 
 
 