#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_ScalableCircle_Attack1.GA_ScalableCircle_Attack1_C.ExecuteUbergraph_GA_ScalableCircle_Attack1
struct FExecuteUbergraph_GA_ScalableCircle_Attack1
{
	int32_t EntryPoint;  // 0x0 (0x0)
	int32_t Temp_int_Array_Index_Variable;  // 0x4 (0x4)
	int32_t Temp_int_Loop_Counter_Variable;  // 0x8 (0x8)
	int32_t CallFunc_Add_IntInt_ReturnValue;  // 0xC (0xC)
	char pad_16_1 : 7;  // 0x10 (0x10)
	bool CallFunc_K2_CommitAbility_ReturnValue : 1;  // 0x10 (0x10)
	char pad_17[7];  // 0x11 (0x11)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x18 (0x18)
	struct ABP_DCAoeBase_C* K2Node_DynamicCast_AsBP_DCAoe_Base;  // 0x20 (0x20)
	char pad_40_1 : 7;  // 0x28 (0x28)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x28 (0x28)
	char pad_41[7];  // 0x29 (0x29)
	struct ADCCharacterBase* CallFunc_Array_Get_Item;  // 0x30 (0x30)
	char pad_56_1 : 7;  // 0x38 (0x38)
	bool CallFunc_GetTargetArray_ReturnValue : 1;  // 0x38 (0x38)
	char pad_57[7];  // 0x39 (0x39)
	struct FVector CallFunc_K2_GetActorLocation_ReturnValue;  // 0x40 (0x40)
	struct FGameplayCueParameters CallFunc_MakeGameplayCueParameters_ReturnValue;  // 0x58 (0x58)
	struct FGameplayEventData K2Node_MakeStruct_GameplayEventData;  // 0x130 (0x130)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyPremadeSpecArray_ReturnValue;  // 0x1E0 (0x1E0)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x1F0 (0x1F0)
	char pad_500_1 : 7;  // 0x1F4 (0x1F4)
	bool CallFunc_Less_IntInt_ReturnValue : 1;  // 0x1F4 (0x1F4)


}; 
 
 