#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_SkeletonRoyalGuard_PositionChange.GA_SkeletonRoyalGuard_PositionChange_C.AbilityActivated
// Size: 0xB0(Inherited: 0xB0)
struct FAbilityActivated : FAbilityActivated
{
	struct FGameplayEventData TriggerEventData;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonRoyalGuard_PositionChange.GA_SkeletonRoyalGuard_PositionChange_C.EventReceived_6877487E47E72A10EB05558A26A404D4
struct FEventReceived_6877487E47E72A10EB05558A26A404D4
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_SkeletonRoyalGuard_PositionChange.GA_SkeletonRoyalGuard_PositionChange_C.ExecuteUbergraph_GA_SkeletonRoyalGuard_PositionChange
struct FExecuteUbergraph_GA_SkeletonRoyalGuard_PositionChange
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options;  // 0x10 (0x10)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x18 (0x18)
	char pad_25[3];  // 0x19 (0x19)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x1C (0x1C)
	char pad_44[4];  // 0x2C (0x2C)
	struct UPawnMovementComponent* CallFunc_GetMovementComponent_ReturnValue;  // 0x30 (0x30)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0x38 (0x38)
	struct FGameplayEventData Temp_struct_Variable;  // 0xE8 (0xE8)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0x198 (0x198)
	char pad_416_1 : 7;  // 0x1A0 (0x1A0)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x1A0 (0x1A0)
	char pad_417[7];  // 0x1A1 (0x1A1)
	struct FGameplayEventData K2Node_Event_TriggerEventData;  // 0x1A8 (0x1A8)
	struct ABP_DCMonsterBaseWithOptions_C* K2Node_DynamicCast_AsBP_DCMonster_Base_with_Options_2;  // 0x258 (0x258)
	char pad_608_1 : 7;  // 0x260 (0x260)
	bool K2Node_DynamicCast_bSuccess_2 : 1;  // 0x260 (0x260)


}; 
 
 