#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function GA_TortureMastery.GA_TortureMastery_C.EventReceived_3DAE65694E63C5F1E083E3AD03B4725A
struct FEventReceived_3DAE65694E63C5F1E083E3AD03B4725A
{
	struct FGameplayEventData Payload;  // 0x0 (0x0)


}; 
 
 // Function GA_TortureMastery.GA_TortureMastery_C.ExecuteUbergraph_GA_TortureMastery
struct FExecuteUbergraph_GA_TortureMastery
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct AActor* CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x8 (0x8)
	struct FGameplayEventData K2Node_CustomEvent_Payload;  // 0x10 (0x10)
	struct FGameplayEventData Temp_struct_Variable;  // 0xC0 (0xC0)
	struct UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue;  // 0x170 (0x170)
	char pad_376_1 : 7;  // 0x178 (0x178)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x178 (0x178)
	char pad_377_1 : 7;  // 0x179 (0x179)
	bool CallFunc_HasTag_ReturnValue : 1;  // 0x179 (0x179)
	char pad_378_1 : 7;  // 0x17A (0x17A)
	bool CallFunc_NotEqual_ObjectObject_ReturnValue : 1;  // 0x17A (0x17A)
	char pad_379_1 : 7;  // 0x17B (0x17B)
	bool CallFunc_ObjectIsA_ReturnValue : 1;  // 0x17B (0x17B)
	char pad_380_1 : 7;  // 0x17C (0x17C)
	bool CallFunc_EqualEqual_ObjectObject_ReturnValue : 1;  // 0x17C (0x17C)
	char pad_381[3];  // 0x17D (0x17D)
	struct FGameplayEventData Temp_struct_Variable_2;  // 0x180 (0x180)
	char pad_560_1 : 7;  // 0x230 (0x230)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0x230 (0x230)
	char pad_561[7];  // 0x231 (0x231)
	struct TArray<struct FActiveGameplayEffectHandle> CallFunc_ApplyEffectContainer_ReturnValue;  // 0x238 (0x238)
	char pad_584_1 : 7;  // 0x248 (0x248)
	bool CallFunc_BooleanAND_ReturnValue_2 : 1;  // 0x248 (0x248)
	char pad_585_1 : 7;  // 0x249 (0x249)
	bool CallFunc_BooleanAND_ReturnValue_3 : 1;  // 0x249 (0x249)
	char pad_586_1 : 7;  // 0x24A (0x24A)
	bool CallFunc_K2_HasAuthority_ReturnValue : 1;  // 0x24A (0x24A)
	char pad_587[1];  // 0x24B (0x24B)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x24C (0x24C)


}; 
 
 