#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_Credit.WB_Credit_C.
struct F
{
	uint8_t Invisibility;  // 0x0 (0x0)


}; 
 
 // Function WB_Credit.WB_Credit_C.ExecuteUbergraph_WB_Credit
struct FExecuteUbergraph_WB_Credit
{
	int32_t EntryPoint;  // 0x0 (0x0)
	uint8_t K2Node_CustomEvent_InVisibility;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FText Temp_text_Variable;  // 0x8 (0x8)
	char pad_32_1 : 7;  // 0x20 (0x20)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue : 1;  // 0x20 (0x20)
	char pad_33_1 : 7;  // 0x21 (0x21)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_2 : 1;  // 0x21 (0x21)
	char pad_34_1 : 7;  // 0x22 (0x22)
	bool CallFunc_BooleanOR_ReturnValue : 1;  // 0x22 (0x22)
	char pad_35[1];  // 0x23 (0x23)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x24 (0x24)
	char pad_52[4];  // 0x34 (0x34)
	struct UCommonButtonBase* K2Node_CustomEvent_Button;  // 0x38 (0x38)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2;  // 0x40 (0x40)


}; 
 
 // Function WB_Credit.WB_Credit_C.BP_GetDesiredFocusTarget
// Size: 0x8(Inherited: 0x8)
struct FBP_GetDesiredFocusTarget : FBP_GetDesiredFocusTarget
{
	struct UWidget* ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function WB_Credit.WB_Credit_C.CreditButtonClicked
struct FCreditButtonClicked
{
	struct UCommonButtonBase* Button;  // 0x0 (0x0)


}; 
 
 