#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_CharacterSelectGroupMenu.WB_CharacterSelectGroupMenu_C.OnVisibilityChanged_Event
struct FOnVisibilityChanged_Event
{
	uint8_t Invisibility;  // 0x0 (0x0)


}; 
 
 // Function WB_CharacterSelectGroupMenu.WB_CharacterSelectGroupMenu_C.ExecuteUbergraph_WB_CharacterSelectGroupMenu
struct FExecuteUbergraph_WB_CharacterSelectGroupMenu
{
	int32_t EntryPoint;  // 0x0 (0x0)
	uint8_t K2Node_CustomEvent_InVisibility;  // 0x4 (0x4)
	char pad_5_1 : 7;  // 0x5 (0x5)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue : 1;  // 0x5 (0x5)
	char pad_6[2];  // 0x6 (0x6)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x8 (0x8)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool CallFunc_EqualEqual_ByteByte_ReturnValue_2 : 1;  // 0x18 (0x18)
	char pad_25_1 : 7;  // 0x19 (0x19)
	bool CallFunc_BooleanOR_ReturnValue : 1;  // 0x19 (0x19)


}; 
 
 