#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_CharacterCreate_ClassAttributeItem.WB_CharacterCreate_ClassAttributeItem_C.OnListItemObjectSet
// Size: 0x8(Inherited: 0x8)
struct FOnListItemObjectSet : FOnListItemObjectSet
{
	struct UObject* ListItemObject;  // 0x0 (0x0)


}; 
 
 // Function WB_CharacterCreate_ClassAttributeItem.WB_CharacterCreate_ClassAttributeItem_C.ExecuteUbergraph_WB_CharacterCreate_ClassAttributeItem
struct FExecuteUbergraph_WB_CharacterCreate_ClassAttributeItem
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UObject* K2Node_Event_ListItemObject;  // 0x8 (0x8)
	struct UCharacterCreateAttributeWidgetData* K2Node_DynamicCast_AsCharacter_Create_Attribute_Widget_Data;  // 0x10 (0x10)
	char pad_24_1 : 7;  // 0x18 (0x18)
	bool K2Node_DynamicCast_bSuccess : 1;  // 0x18 (0x18)
	char pad_25[7];  // 0x19 (0x19)
	struct FText CallFunc_GetPlayerCharacterEffectTypeText_Text;  // 0x20 (0x20)
	struct FText CallFunc_Conv_IntToText_ReturnValue;  // 0x38 (0x38)


}; 
 
 