#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_ContextMenu.WB_ContextMenu_C.OnMouseButtonDown
// Size: 0x248(Inherited: 0x190)
struct FOnMouseButtonDown : FOnMouseButtonDown
{
	struct FGeometry MyGeometry;  // 0x0 (0x0)
	struct FPointerEvent MouseEvent;  // 0x40 (0x40)
	struct FEventReply ReturnValue;  // 0xD8 (0xD8)
	struct FEventReply CallFunc_Unhandled_ReturnValue;  // 0x190 (0x190)


}; 
 
 // Function WB_ContextMenu.WB_ContextMenu_C.ExecuteUbergraph_WB_ContextMenu
struct FExecuteUbergraph_WB_ContextMenu
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UObject* K2Node_ComponentBoundEvent_Item;  // 0x8 (0x8)
	struct UUserWidget* K2Node_ComponentBoundEvent_Widget;  // 0x10 (0x10)


}; 
 
 // Function WB_ContextMenu.WB_ContextMenu_C.BndEvt__WB_ContextMenu_ListView_ContextOptions_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
struct FBndEvt__WB_ContextMenu_ListView_ContextOptions_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature
{
	struct UObject* Item;  // 0x0 (0x0)
	struct UUserWidget* Widget;  // 0x8 (0x8)


}; 
 
 