#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_CommonBtn_Text.WB_CommonBtn_Text_C.OnFocusReceived
// Size: 0x1B8(Inherited: 0x100)
struct FOnFocusReceived : FOnFocusReceived
{
	struct FGeometry MyGeometry;  // 0x0 (0x0)
	struct FFocusEvent InFocusEvent;  // 0x40 (0x40)
	struct FEventReply ReturnValue;  // 0x48 (0x48)
	struct FEventReply CallFunc_Unhandled_ReturnValue;  // 0x100 (0x100)


}; 
 
 // Function WB_CommonBtn_Text.WB_CommonBtn_Text_C.ExecuteUbergraph_WB_CommonBtn_Text
struct FExecuteUbergraph_WB_CommonBtn_Text
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FSlateColor K2Node_MakeStruct_SlateColor;  // 0x4 (0x4)
	struct FSlateColor K2Node_MakeStruct_SlateColor_2;  // 0x18 (0x18)
	struct FSlateColor K2Node_MakeStruct_SlateColor_3;  // 0x2C (0x2C)
	struct FSlateColor K2Node_MakeStruct_SlateColor_4;  // 0x40 (0x40)


}; 
 
 