#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_CommonPopup_S.WB_CommonPopup_S_C.OnCreatePopup
// Size: 0x20(Inherited: 0x20)
struct FOnCreatePopup : FOnCreatePopup
{
	struct FPopupSWidgetData PopupSWidgetData;  // 0x0 (0x0)


}; 
 
 // Function WB_CommonPopup_S.WB_CommonPopup_S_C.ExecuteUbergraph_WB_CommonPopup_S
struct FExecuteUbergraph_WB_CommonPopup_S
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4[4];  // 0x4 (0x4)
	struct UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue;  // 0x8 (0x8)
	struct FPopupSWidgetData K2Node_Event_PopupSWidgetData;  // 0x10 (0x10)
	char pad_48_1 : 7;  // 0x30 (0x30)
	bool K2Node_SwitchEnum_CmpSuccess : 1;  // 0x30 (0x30)


}; 
 
 // Function WB_CommonPopup_S.WB_CommonPopup_S_C.BP_GetDesiredFocusTarget
// Size: 0xD(Inherited: 0x8)
struct FBP_GetDesiredFocusTarget : FBP_GetDesiredFocusTarget
{
	struct UWidget* ReturnValue;  // 0x0 (0x0)
	int32_t CallFunc_GetActiveWidgetIndex_ReturnValue;  // 0x8 (0x8)
	char pad_20_1 : 7;  // 0x14 (0x14)
	bool K2Node_SwitchInteger_CmpSuccess : 1;  // 0xC (0xC)


}; 
 
 