#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_CharacterCreate_ClassPortraitItem.WB_CharacterCreate_ClassPortraitItem_C.IsVisibleIfSelected
struct FIsVisibleIfSelected
{
	uint8_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function WB_CharacterCreate_ClassPortraitItem.WB_CharacterCreate_ClassPortraitItem_C.GetWorkinprogressVisibility
struct FGetWorkinprogressVisibility
{
	uint8_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function WB_CharacterCreate_ClassPortraitItem.WB_CharacterCreate_ClassPortraitItem_C.GetVisibilityByClassCreatable
struct FGetVisibilityByClassCreatable
{
	uint8_t ReturnValue;  // 0x0 (0x0)


}; 
 
 // Function WB_CharacterCreate_ClassPortraitItem.WB_CharacterCreate_ClassPortraitItem_C.GetLockedVisibility
struct FGetLockedVisibility
{
	uint8_t ReturnValue;  // 0x0 (0x0)
	char pad_1_1 : 7;  // 0x1 (0x1)
	bool CallFunc_Not_PreBool_ReturnValue : 1;  // 0x1 (0x1)
	char pad_2_1 : 7;  // 0x2 (0x2)
	bool CallFunc_BooleanAND_ReturnValue : 1;  // 0x2 (0x2)


}; 
 
 // Function WB_CharacterCreate_ClassPortraitItem.WB_CharacterCreate_ClassPortraitItem_C.GetClassAvailableVisibility
struct FGetClassAvailableVisibility
{
	uint8_t ReturnValue;  // 0x0 (0x0)


}; 
 
 