#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_Headup.WB_Headup_C.GetCharacterClassIconTexture
struct FGetCharacterClassIconTexture
{
	struct FSlateBrush ReturnValue;  // 0x0 (0x0)
	struct UTexture2D* DefaultClassCharacterIconTexture;  // 0xD0 (0xD0)
	char pad_216[8];  // 0xD8 (0xD8)
	struct FSlateBrush CallFunc_MakeBrushFromTexture_ReturnValue;  // 0xE0 (0xE0)
	char pad_432_1 : 7;  // 0x1B0 (0x1B0)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x1B0 (0x1B0)
	char pad_433[15];  // 0x1B1 (0x1B1)
	struct FSlateBrush CallFunc_MakeBrushFromTexture_ReturnValue_2;  // 0x1C0 (0x1C0)


}; 
 
 // Function WB_Headup.WB_Headup_C.ExecuteUbergraph_WB_Headup
struct FExecuteUbergraph_WB_Headup
{
	int32_t EntryPoint;  // 0x0 (0x0)
	struct FLinearColor CallFunc_GetViewNicknameColor_ReturnValue;  // 0x4 (0x4)
	char pad_20[4];  // 0x14 (0x14)
	struct FString CallFunc_GetViewNickName_ReturnValue;  // 0x18 (0x18)
	struct FSlateColor K2Node_MakeStruct_SlateColor;  // 0x28 (0x28)
	char pad_60[4];  // 0x3C (0x3C)
	struct FText CallFunc_Conv_StringToText_ReturnValue;  // 0x40 (0x40)


}; 
 
 // Function WB_Headup.WB_Headup_C.Get Visibility
struct FGet Visibility
{
	uint8_t ReturnValue;  // 0x0 (0x0)


}; 
 
 