#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_LoadingScreen.WB_LoadingScreen_C.ExecuteUbergraph_WB_LoadingScreen
struct FExecuteUbergraph_WB_LoadingScreen
{
	int32_t EntryPoint;  // 0x0 (0x0)


}; 
 
 // Function WB_LoadingScreen.WB_LoadingScreen_C.UpdateImage
struct FUpdateImage
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool CallFunc_Array_IsValidIndex_ReturnValue : 1;  // 0x0 (0x0)
	char pad_1[7];  // 0x1 (0x1)
	struct UTexture2D* CallFunc_Array_Get_Item;  // 0x8 (0x8)


}; 
 
 // Function WB_LoadingScreen.WB_LoadingScreen_C.GetNumDescs
// Size: 0x8(Inherited: 0x4)
struct FGetNumDescs : FGetNumDescs
{
	int32_t ReturnValue;  // 0x0 (0x0)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x4 (0x4)


}; 
 
 // Function WB_LoadingScreen.WB_LoadingScreen_C.UpdateDesc
struct FUpdateDesc
{
	char pad_0_1 : 7;  // 0x0 (0x0)
	bool CallFunc_Array_IsValidIndex_ReturnValue : 1;  // 0x7FF7D3428690 (0x16FAD03EBC0) (0x7FF7D3428690 (0x16FAD03EBC0))


}; 
 
 // Function WB_LoadingScreen.WB_LoadingScreen_C.GetNumImages
// Size: 0x8(Inherited: 0x4)
struct FGetNumImages : FGetNumImages
{
	int32_t ReturnValue;  // 0x0 (0x0)
	int32_t CallFunc_Array_Length_ReturnValue;  // 0x4 (0x4)


}; 
 
 