#pragma once 
#include <SDK_Engine_Objects.h> 
 
 
// Function WB_OptionCheckButton01.WB_OptionCheckButton01_C.UpdateButtonSize
struct FUpdateButtonSize
{
	double Scale X;  // 0x0 (0x0)
	double Scale Y;  // 0x8 (0x8)
	struct FVector2D CallFunc_MakeVector2D_ReturnValue;  // 0x10 (0x10)
	struct FSlateBrush K2Node_MakeStruct_SlateBrush;  // 0x20 (0x20)


}; 
 
 // Function WB_OptionCheckButton01.WB_OptionCheckButton01_C.Init
struct FInit
{
	struct UGameMenuOptionSlotWidget* InGameMenuOptionSlotWidget;  // 0x0 (0x0)
	int32_t InSlotIdx;  // 0x8 (0x8)


}; 
 
 // Function WB_OptionCheckButton01.WB_OptionCheckButton01_C.ExecuteUbergraph_WB_OptionCheckButton01
struct FExecuteUbergraph_WB_OptionCheckButton01
{
	int32_t EntryPoint;  // 0x0 (0x0)
	char pad_4_1 : 7;  // 0x4 (0x4)
	bool CallFunc_IsValid_ReturnValue : 1;  // 0x4 (0x4)
	char pad_5[3];  // 0x5 (0x5)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate;  // 0x8 (0x8)
	struct FSlateColor K2Node_MakeStruct_SlateColor;  // 0x18 (0x18)
	struct FSlateColor K2Node_MakeStruct_SlateColor_2;  // 0x2C (0x2C)
	struct UGameMenuOptionSlotWidget* K2Node_CustomEvent_InGameMenuOptionSlotWidget;  // 0x40 (0x40)
	int32_t K2Node_CustomEvent_InSlotIdx;  // 0x48 (0x48)


}; 
 
 